[
  {
    "id": "CARD-001",
    "title": "Rheumatic Mitral Stenosis with Atrial Fibrillation",
    "specialty": "cardiology",
    "difficulty": "intermediate",
    "source": "JAPI Case Series - Rheumatic Heart Disease in India",
    "demographics": {"age": 32, "gender": "Female", "location": "Varanasi, UP"},
    "chief_complaint": "Progressive breathlessness and palpitations for 6 months",
    "presentation": "A 32-year-old woman from rural Varanasi presents with progressive exertional dyspnea (NYHA Class III) and palpitations for 6 months. She reports orthopnea requiring 3 pillows and two episodes of paroxysmal nocturnal dyspnea. She had recurrent sore throats in childhood but never received penicillin prophylaxis. She recently noticed hemoptysis with pink frothy sputum.",
    "vital_signs": {"bp": "110/80", "hr": 130, "rr": 26, "temp": 37.0, "spo2": 92},
    "history": "Recurrent sore throats aged 8-12 years in rural UP, never evaluated. Progressive dyspnea started 2 years ago, worsened significantly in last 6 months. Two episodes of PND. Recent hemoptysis. Palpitations irregular. No chest pain. History of one episode of transient right-sided weakness 3 months ago (likely TIA). Married, 2 children (both delivered with difficulty due to breathlessness). No family history of cardiac disease.",
    "physical_exam": "Malar flush present. JVP elevated with prominent 'a' waves absent (AF). Irregularly irregular pulse. Left parasternal heave. Loud S1, opening snap followed by low-pitched mid-diastolic rumbling murmur best heard at apex in left lateral position with bell. Loud P2. Fine bilateral basal crepitations. Mild hepatomegaly. Bilateral pedal edema.",
    "investigations": "ECG: Atrial fibrillation with ventricular rate 130/min, right axis deviation, P mitrale absent (AF). 2D Echo: Mitral valve area 0.8 cm² (severe MS), LA dilated 5.2 cm, moderate pulmonary hypertension (PASP 55 mmHg), Wilkins score 9/16, LA clot absent. CXR: Straightening of left heart border, double density sign, upper lobe pulmonary venous diversion, Kerley B lines. CBC: Hb 11.2 g/dL. INR: 1.0. BNP: 890 pg/mL.",
    "diagnosis": "Severe rheumatic mitral stenosis with atrial fibrillation and pulmonary hypertension",
    "differentials": ["Rheumatic mitral stenosis", "Left atrial myxoma", "Cor triatriatum", "Lutembacher syndrome", "Pulmonary veno-occlusive disease"],
    "learning_points": [
      "India accounts for 25-50% of global RHD burden with ~2 million cases",
      "Mitral valve area <1.0 cm² = severe stenosis",
      "Wilkins score ≤8 favors balloon mitral valvotomy (BMV)",
      "AF in MS mandates anticoagulation (warfarin, target INR 2-3) due to high stroke risk",
      "Hemoptysis in MS can be from pulmonary venous hypertension or bronchial vein rupture",
      "Pregnancy is high-risk in severe MS - counsel before conception"
    ],
    "india_context": "RHD remains the leading cause of cardiovascular morbidity in young Indians. Poor access to primary healthcare in rural areas leads to missed secondary prophylaxis with penicillin. The ICMR has recommended school-based screening programs."
  },
  {
    "id": "CARD-002",
    "title": "Young Male with Acute STEMI - Premature CAD",
    "specialty": "cardiology",
    "difficulty": "intermediate",
    "source": "Indian Heart Journal - Premature CAD in South Asians",
    "demographics": {"age": 34, "gender": "Male", "location": "Ludhiana, Punjab"},
    "chief_complaint": "Sudden crushing chest pain for 2 hours",
    "presentation": "A 34-year-old Punjabi businessman presents to a district hospital emergency with sudden onset severe retrosternal chest pain radiating to left arm for 2 hours. He is diaphoretic and nauseated. He has a family history of premature MI (father at 45, brother at 40). He smokes 20 bidis/day, consumes alcohol regularly, and eats a high-fat Punjabi diet. BMI 29.",
    "vital_signs": {"bp": "90/60", "hr": 115, "rr": 24, "temp": 36.8, "spo2": 94},
    "history": "Chest pain started suddenly while at work, crushing quality, severity 9/10, radiating to left arm and jaw. Associated with profuse sweating, nausea, one episode of vomiting. No prior cardiac evaluation. Smokes 20 bidis/day for 15 years. Drinks 180ml whisky daily. Diet: heavy ghee, butter, fried foods. Father died of MI at 45. Brother had stent placement at 40. Known to have high cholesterol but never treated. No diabetes known.",
    "physical_exam": "Anxious, diaphoretic, cold clammy extremities. JVP elevated. Heart sounds: S1 soft, S4 gallop present, no murmurs. Lungs: Bilateral basal crepitations (Killip class II). Abdomen: Soft. Peripheral pulses: Weak. No pedal edema.",
    "investigations": "ECG: ST elevation V1-V6, I, aVL (extensive anterior STEMI), reciprocal ST depression II, III, aVF. Troponin I: 12.4 ng/mL (markedly elevated). CBC: Normal. RBS: 210 mg/dL (stress hyperglycemia). Creatinine: 1.0. Lipid profile: TC 280, LDL 190, HDL 28, TG 320 mg/dL. Echo (bedside): Anterior wall hypokinesis, EF 35%, no MR, no pericardial effusion.",
    "diagnosis": "Acute extensive anterior STEMI with cardiogenic shock (Killip Class II-III) in a young patient with premature CAD",
    "differentials": ["Acute STEMI", "Aortic dissection", "Acute myocarditis", "Takotsubo cardiomyopathy", "Pulmonary embolism"],
    "learning_points": [
      "South Asians develop CAD 10 years earlier than Western populations",
      "Atherogenic dyslipidemia (high TG, low HDL) is the commonest lipid pattern in Indians",
      "Door-to-balloon time <90 min for primary PCI, door-to-needle <30 min for thrombolysis",
      "In India where PCI may not be available, thrombolysis with tenecteplase is acceptable if given within 12 hours",
      "Killip classification: I (no failure), II (mild-moderate), III (pulmonary edema), IV (cardiogenic shock)",
      "STEMI in young Indians: screen for familial hypercholesterolemia, Lp(a), homocysteine"
    ],
    "india_context": "India faces the highest burden of premature CAD globally. INTERHEART study showed South Asians have MI 5-10 years earlier. Punjab has among the highest CAD rates due to dietary habits. Only 30% of STEMI patients in India receive timely reperfusion therapy."
  },
  {
    "id": "CARD-003",
    "title": "Dilated Cardiomyopathy with Decompensated Heart Failure",
    "specialty": "cardiology",
    "difficulty": "advanced",
    "source": "IJMR - Heart Failure Registry of India",
    "demographics": {"age": 48, "gender": "Male", "location": "Thiruvananthapuram, Kerala"},
    "chief_complaint": "Worsening breathlessness and leg swelling for 2 weeks",
    "presentation": "A 48-year-old Kerala toddy tapper presents with progressive breathlessness at rest, bilateral leg swelling, and abdominal distension for 2 weeks. He has a history of heavy alcohol consumption (toddy and arrack, ~200ml ethanol equivalent daily for 25 years). He was diagnosed with dilated cardiomyopathy 2 years ago but has been non-compliant with medications.",
    "vital_signs": {"bp": "95/65", "hr": 108, "rr": 30, "temp": 36.5, "spo2": 88},
    "history": "Progressive dyspnea from NYHA II to IV over 2 weeks. Orthopnea, PND nightly. Bilateral leg swelling progressive. Abdominal distension with early satiety. Reduced urine output last 3 days. History of DCM diagnosed 2 years ago - prescribed carvedilol, enalapril, furosemide, spironolactone but stopped all medications 6 months ago due to financial constraints. Heavy alcohol use: toddy and arrack daily for 25 years. No chest pain. No fever.",
    "physical_exam": "Cachexic, tachypneic, using accessory muscles. JVP markedly elevated (12 cm). Displaced apex beat (6th ICS, anterior axillary line). S3 gallop, pansystolic murmur at apex (functional MR). Bilateral extensive crepitations up to mid-zones. Tense ascites. Tender hepatomegaly (6 cm). Bilateral pitting edema up to thighs. Cool extremities, prolonged CRT.",
    "investigations": "ECG: Sinus tachycardia, LBBB (QRS 160ms), poor R progression, low voltage in limb leads. CXR: Massive cardiomegaly (CTR 0.72), bilateral pleural effusions, pulmonary edema. Echo: Severely dilated LV (LVEDD 7.2 cm), global hypokinesis, LVEF 15%, severe functional MR, moderate TR, PASP 60 mmHg, RV dysfunction. BNP: 3200 pg/mL. Renal: Creatinine 2.1 (baseline 1.0), Na+ 128, K+ 5.2. LFT: Bilirubin 3.2, AST 180, ALT 95 (congestive hepatopathy). Hb: 10.2. TSH: Normal.",
    "diagnosis": "Alcoholic dilated cardiomyopathy with acute decompensated heart failure (Killip IV/cardiogenic shock) and cardiorenal syndrome",
    "differentials": ["Alcoholic cardiomyopathy", "Idiopathic DCM", "Viral myocarditis", "Peripartum cardiomyopathy", "Tachycardia-mediated cardiomyopathy", "Chagas disease"],
    "learning_points": [
      "Alcoholic CM accounts for ~30% of non-ischemic DCM in India",
      "Abstinence can lead to partial or complete recovery of LV function in alcoholic CM",
      "LVEF <15% with LBBB: consider CRT-D (cardiac resynchronization + defibrillator)",
      "Cardiorenal syndrome: worsening renal function due to low cardiac output and venous congestion",
      "GDMT for HFrEF: ARNI/ACEi + beta-blocker + MRA + SGLT2i (four pillars)",
      "Diuretic resistance: combine loop + thiazide (sequential nephron blockade)"
    ],
    "india_context": "Toddy and arrack (country liquor) consumption is widespread in Kerala and contributes to high rates of alcoholic liver disease and cardiomyopathy. THFR (Trivandrum Heart Failure Registry) showed non-ischemic CM constitutes 40% of HF in Kerala. Financial barriers to medication compliance are a major challenge."
  },
  {
    "id": "CARD-004",
    "title": "Infective Endocarditis on Bicuspid Aortic Valve",
    "specialty": "cardiology",
    "difficulty": "advanced",
    "source": "JAPI - Infective Endocarditis in India",
    "demographics": {"age": 26, "gender": "Male", "location": "Jaipur, Rajasthan"},
    "chief_complaint": "Prolonged fever with joint pains for 3 weeks",
    "presentation": "A 26-year-old male dental student presents with 3 weeks of high-grade intermittent fever with chills, generalized joint pains, and progressive fatigue. He had a dental extraction 5 weeks ago without antibiotic prophylaxis. He was previously told he had a 'heart murmur' during a school medical exam but never followed up. He has recently noticed painful red spots on his fingers.",
    "vital_signs": {"bp": "120/55", "hr": 100, "rr": 20, "temp": 39.2, "spo2": 97},
    "history": "Fever for 3 weeks, high-grade (102-104°F), intermittent with chills and rigors. Night sweats. Joint pains (knees, ankles, wrists) - migratory. Weight loss ~4 kg. Fatigue and malaise. Dental extraction 5 weeks ago - no antibiotic prophylaxis given. Known 'heart murmur' since age 12, never evaluated. Noticed painful red spots on finger pads 1 week ago. No IV drug use. No recent hospitalization.",
    "physical_exam": "Febrile, pale. Clubbing present. Osler nodes on finger pads (tender, erythematous). Janeway lesions on palms (non-tender, erythematous). Splinter hemorrhages in nail beds. Conjunctival petechiae. CVS: Ejection systolic murmur at right upper sternal border radiating to neck + early diastolic murmur at left sternal edge (aortic regurgitation). Wide pulse pressure. Splenomegaly 3 cm. No focal neurological deficit.",
    "investigations": "Blood cultures (3 sets): Streptococcus mutans (2/3 positive). CBC: Hb 9.8, WBC 16,000, Platelets 110,000. ESR 85, CRP 120. RF positive. Complement low. Urinalysis: Microscopic hematuria, RBC casts. Echo (TTE): Bicuspid aortic valve with 1.8 cm vegetation on non-coronary cusp, moderate-severe AR, no abscess. TEE confirms. Renal: Creatinine 1.4 (immune-complex GN). CT brain: No mycotic aneurysm.",
    "diagnosis": "Subacute bacterial endocarditis (Streptococcus mutans) on bicuspid aortic valve with peripheral embolization",
    "differentials": ["Infective endocarditis", "Rheumatic fever", "SLE with Libman-Sacks endocarditis", "Atrial myxoma", "Lymphoma with fever"],
    "learning_points": [
      "Bicuspid aortic valve is the commonest congenital cardiac anomaly (1-2% population)",
      "Modified Duke criteria: 2 major or 1 major + 3 minor or 5 minor for definite IE",
      "Dental procedures without prophylaxis in structural heart disease is a preventable cause",
      "Osler nodes = immune complex (tender), Janeway lesions = septic emboli (non-tender)",
      "Vegetation >10 mm with embolic events = surgical indication",
      "Empiric therapy: Ampicillin + Gentamicin (native valve streptococcal IE)"
    ],
    "india_context": "IE in India often presents late due to delayed diagnosis. RHD remains the most common predisposing condition unlike the West where it's prosthetic valves and IV drug use. Lack of awareness about endocarditis prophylaxis is a significant issue. The ICMR recommends prophylaxis for high-risk procedures in structural heart disease."
  },
  {
    "id": "CARD-005",
    "title": "Takayasu Arteritis with Hypertension",
    "specialty": "cardiology",
    "difficulty": "advanced",
    "source": "IJMR - Large Vessel Vasculitis in Indian Women",
    "demographics": {"age": 24, "gender": "Female", "location": "Chennai, Tamil Nadu"},
    "chief_complaint": "Headache, dizziness, and unequal arm blood pressures",
    "presentation": "A 24-year-old female nursing student presents with recurrent severe headaches for 4 months, dizziness on standing, and claudication pain in her left arm on exertion. During a routine BP check, markedly different readings were noted between arms (right 170/100, left 90/60). She also reports low-grade fever, malaise, and 3 kg weight loss. She has noticed diminished pulse in her left wrist.",
    "vital_signs": {"bp_right": "170/100", "bp_left": "90/60", "hr": 78, "rr": 16, "temp": 37.5, "spo2": 98},
    "history": "Headaches for 4 months, throbbing, occipital, worse in mornings. Dizziness on standing and exertion. Left arm pain and fatigue on use (arm claudication). Low-grade evening fever for 3 months. Weight loss 3 kg. Fatigue. No visual symptoms. No stroke symptoms. No chest pain. Menarche at 13, regular cycles. No joint pains. No oral ulcers. No photosensitivity.",
    "physical_exam": "Young woman, appears well. Absent left radial and left brachial pulses. Right radial pulse bounding. Right carotid bruit. Left subclavian bruit. BP difference >40 mmHg between arms. No carotid tenderness. CVS: Aortic regurgitation murmur (early diastolic). Fundoscopy: AV nipping, microaneurysms (hypertensive retinopathy grade II). No focal neuro deficit.",
    "investigations": "ESR: 78 mm/hr, CRP: 45 mg/L. CT angiography: Concentric wall thickening of aortic arch, complete occlusion of left subclavian artery, stenosis of left common carotid (70%), mild aortic root dilatation. MR angiography confirms. Renal arteries: Bilateral ostial stenosis (explaining hypertension). Echo: Mild AR, concentric LVH. CBC: Mild anemia (Hb 10.5). ANA/ANCA: Negative. TB workup: Mantoux negative, QuantiFERON negative.",
    "diagnosis": "Takayasu arteritis (Type I - aortic arch and branches) with renovascular hypertension",
    "differentials": ["Takayasu arteritis", "Giant cell arteritis", "Fibromuscular dysplasia", "Aortic coarctation", "Atherosclerotic renovascular disease", "Mid-aortic syndrome"],
    "learning_points": [
      "Takayasu arteritis is most common in Asian women aged 15-30 ('pulseless disease')",
      "India has one of the highest prevalence rates globally",
      "BP must be measured in all 4 limbs - >10 mmHg difference is significant",
      "Classification: Type I (arch branches), Type II (descending/abdominal aorta), Type III (combined), Type IV (+pulmonary), Type V (entire aorta)",
      "Treatment: High-dose corticosteroids; steroid-sparing agents (MTX, AZA, tocilizumab) for relapse",
      "Renovascular hypertension: consider balloon angioplasty only in inactive disease phase"
    ],
    "india_context": "Takayasu arteritis was first described by Mikito Takayasu but Indian cardiologist Savitri Devi described 'pulseless disease' in young women independently. India has among the highest reported prevalence. Association with tuberculosis has been debated in Indian literature. ICMR recommends TB screening in all Takayasu patients."
  },
  {
    "id": "CARD-006",
    "title": "Acute Rheumatic Fever - Carditis in Adolescent",
    "specialty": "cardiology",
    "difficulty": "beginner",
    "source": "IJMR - Rheumatic Fever Prevention Program",
    "demographics": {"age": 14, "gender": "Male", "location": "Patna, Bihar"},
    "chief_complaint": "Fever, joint pains, and a new heart murmur",
    "presentation": "A 14-year-old boy from rural Bihar presents with high-grade fever for 10 days, migratory joint pains affecting knees and ankles, and a new heart murmur detected by the local health worker. He had a sore throat 3 weeks ago treated with home remedies. He lives in an overcrowded household with 8 family members in 2 rooms.",
    "vital_signs": {"bp": "100/60", "hr": 110, "rr": 22, "temp": 38.8, "spo2": 97},
    "history": "Sore throat 3 weeks ago, lasted 5 days, treated with warm salt water gargles. Fever started 10 days ago, high-grade, continuous. Joint pains: first left knee (swollen, red, hot for 2 days), then right ankle, then left wrist - migratory pattern. Rash noticed on trunk. No chorea movements. No chest pain. Lives in overcrowded conditions. Poor sanitation. No prior cardiac history. No family history of rheumatic disease.",
    "physical_exam": "Febrile child, looks unwell. Erythema marginatum on trunk (evanescent, pink rings). Swollen, tender, hot right ankle. Left knee: resolving synovitis. CVS: Tachycardic, pansystolic murmur at apex radiating to axilla (mitral regurgitation), mid-diastolic Carey Coombs murmur. No features of heart failure. Subcutaneous nodules over extensor surface of elbows.",
    "investigations": "Throat swab: Negative (post-infectious). ASO titer: 640 IU/mL (elevated, >200 significant). Anti-DNase B: Positive. ESR: 95 mm/hr. CRP: 88 mg/L. CBC: WBC 15,000, Hb 11. ECG: Prolonged PR interval (240ms), sinus tachycardia. Echo: Mild mitral regurgitation with thickened mitral leaflets, no pericardial effusion. Blood cultures: Negative (rules out IE).",
    "diagnosis": "Acute rheumatic fever with carditis (Jones criteria: 2 major + evidence of preceding streptococcal infection)",
    "differentials": ["Acute rheumatic fever", "Juvenile idiopathic arthritis", "Reactive arthritis", "Infective endocarditis", "SLE", "Viral myocarditis"],
    "learning_points": [
      "Revised Jones criteria (2015): Major criteria differ for low-risk vs high-risk populations",
      "India is a high-risk population: polyarthralgia and monoarthritis count as major criteria",
      "This patient has: Carditis + Polyarthritis + Erythema marginatum + Subcutaneous nodules = 4 major criteria",
      "Treatment: Benzathine penicillin G 1.2 MU IM stat + aspirin for arthritis + bed rest",
      "Secondary prophylaxis: Benzathine penicillin G every 3 weeks for at least 10 years or until age 40",
      "Overcrowding and poverty are major risk factors for streptococcal pharyngitis and RF"
    ],
    "india_context": "India has an estimated 6 million children with RHD. Bihar has among the highest prevalence rates. The ICMR-RHD registry highlights delayed diagnosis as a key driver of valvular damage. School screening programs and penicillin prophylaxis programs have been launched by NHM."
  },
  {
    "id": "CARD-007",
    "title": "Peripartum Cardiomyopathy",
    "specialty": "cardiology",
    "difficulty": "advanced",
    "source": "JAPI - Peripartum Cardiomyopathy in India",
    "demographics": {"age": 28, "gender": "Female", "location": "Hyderabad, Telangana"},
    "chief_complaint": "Breathlessness and leg swelling 3 weeks after delivery",
    "presentation": "A 28-year-old primigravida presents 3 weeks postpartum with progressive dyspnea, orthopnea, bilateral ankle swelling, and cough with pink frothy sputum. She had a normal vaginal delivery at term. Her pregnancy was complicated by pre-eclampsia in the third trimester. She has no prior cardiac history.",
    "vital_signs": {"bp": "100/70", "hr": 120, "rr": 32, "temp": 36.8, "spo2": 86},
    "history": "Normal pregnancy until 34 weeks when she developed pre-eclampsia (BP 160/100, proteinuria). Induced at 38 weeks, normal vaginal delivery. Baby healthy. Discharged day 2. Progressive breathlessness started 1 week postpartum, now at rest. Cannot lie flat. Bilateral leg swelling. Cough with pink frothy sputum since morning. Reduced urine output. No chest pain. No fever. No DVT symptoms.",
    "physical_exam": "Severely dyspneic, tachypneic, diaphoretic. JVP markedly elevated. Cold extremities. Displaced apex beat (6th ICS, MCL). S3 gallop. Pansystolic murmur apex (functional MR). Bilateral extensive crepitations. Tense bilateral pedal edema. Liver palpable 4 cm, tender.",
    "investigations": "ECG: Sinus tachycardia, LVH, T wave inversions V4-V6. CXR: Cardiomegaly, bilateral pleural effusions, pulmonary edema. Echo: LVEF 20%, globally dilated LV (LVEDD 6.5 cm), severe MR, moderate TR, PASP 55 mmHg, small pericardial effusion. BNP: 2800 pg/mL. Troponin: 0.12 (mildly elevated). CBC: Hb 9.5. Renal: Creatinine 1.6. LFT: Mildly deranged (congestive). Prolactin: Elevated.",
    "diagnosis": "Peripartum cardiomyopathy with acute decompensated heart failure",
    "differentials": ["Peripartum cardiomyopathy", "Pre-eclampsia related cardiac dysfunction", "Undiagnosed pre-existing DCM", "Viral myocarditis", "Pulmonary embolism"],
    "learning_points": [
      "PPCM defined: HF in last month of pregnancy to 5 months postpartum, no prior heart disease, LVEF <45%",
      "Risk factors: Pre-eclampsia (strongest), multiparity, advanced maternal age, African descent",
      "Bromocriptine (prolactin blocker) may improve outcomes - based on REBIRTH trial",
      "Breastfeeding may be discouraged if bromocriptine is used",
      "50% recovery of LV function within 6 months; risk of recurrence in subsequent pregnancies is 30-50%",
      "Avoid ACEi/ARBs if still breastfeeding - use hydralazine + nitrates instead"
    ],
    "india_context": "PPCM incidence in India estimated at 1 in 1000-1300 deliveries, higher than Western countries. Often diagnosed late due to attribution of symptoms to 'normal postpartum tiredness'. Pre-eclampsia is a major risk factor in Indian women. Limited access to echo in rural areas delays diagnosis."
  },
  {
    "id": "CARD-008",
    "title": "Complete Heart Block with Syncope",
    "specialty": "cardiology",
    "difficulty": "intermediate",
    "source": "Indian Pacing and Electrophysiology Journal",
    "demographics": {"age": 65, "gender": "Male", "location": "Kolkata, West Bengal"},
    "chief_complaint": "Recurrent episodes of fainting",
    "presentation": "A 65-year-old retired government clerk presents with 3 episodes of sudden loss of consciousness over 2 weeks, each lasting 30-60 seconds with spontaneous recovery. His wife reports he becomes pale and limp without any jerking movements. He has hypertension controlled with amlodipine. He reports progressive exertional fatigue and dizziness for 3 months.",
    "vital_signs": {"bp": "150/60", "hr": 38, "rr": 16, "temp": 36.8, "spo2": 96},
    "history": "Three syncopal episodes in 2 weeks - sudden onset, no prodrome, no seizure activity, rapid recovery (Stokes-Adams attacks). Progressive fatigue and exertional dizziness for 3 months. Known hypertension for 10 years, on amlodipine 5mg. No diabetes. No ischemic symptoms. No palpitations. No drug history of beta-blockers, CCBs (rate-lowering), digoxin.",
    "physical_exam": "Bradycardic (38/min), regular. Cannon 'a' waves in JVP (intermittent). Variable intensity of S1 (classic). Blood pressure well-maintained. No signs of heart failure. Neurological exam normal.",
    "investigations": "ECG: Complete heart block (third-degree AV block). Atrial rate 80/min, ventricular rate 38/min, no relationship between P waves and QRS. Narrow QRS escape rhythm (junctional, 38/min). Holter: Persistent complete heart block, minimum HR 28 during sleep, multiple pauses >3 seconds. Echo: Concentric LVH, LVEF 55%, no RWMA, no valvular disease. Troponin: Normal. Electrolytes: Normal. TSH: Normal.",
    "diagnosis": "Complete (third-degree) atrioventricular block with Stokes-Adams attacks - Class I indication for permanent pacemaker",
    "differentials": ["Complete heart block (degenerative)", "Drug-induced bradycardia", "Inferior MI with AV block", "Lyme disease carditis", "Infiltrative cardiomyopathy (amyloid, sarcoid)"],
    "learning_points": [
      "Complete heart block: no P-QRS relationship, escape rhythm determines prognosis",
      "Narrow QRS escape = junctional (more stable), wide QRS escape = ventricular (less reliable)",
      "Class I indication for permanent pacemaker: symptomatic bradycardia, Stokes-Adams attacks",
      "Cannon 'a' waves and variable S1 are classic signs of AV dissociation",
      "In India, idiopathic fibrosis (Lev/Lenègre disease) is the commonest cause in elderly",
      "Dual-chamber (DDD) pacemaker preferred over single-chamber (VVI) to maintain AV synchrony"
    ],
    "india_context": "Pacemaker implantation rates in India are 3/million vs 900/million in the US. Cost and access remain barriers. Government schemes like Ayushman Bharat cover pacemaker implantation. The Indian Pacing and Electrophysiology Journal has documented successful low-cost pacemaker programs."
  },
  {
    "id": "CARD-009",
    "title": "Hypertrophic Cardiomyopathy with Sudden Cardiac Arrest",
    "specialty": "cardiology",
    "difficulty": "advanced",
    "source": "Indian Heart Journal - HCM in Young Athletes",
    "demographics": {"age": 19, "gender": "Male", "location": "Pune, Maharashtra"},
    "chief_complaint": "Collapsed during a cricket match",
    "presentation": "A 19-year-old college cricket player collapsed suddenly while batting in an inter-college match. Bystander CPR was initiated. He was found in ventricular fibrillation by the arriving paramedics and was successfully defibrillated with one shock. He had experienced occasional exertional dizziness during practice but attributed it to dehydration. His uncle died suddenly at age 35 while playing football.",
    "vital_signs": {"bp": "110/75", "hr": 88, "rr": 16, "temp": 36.9, "spo2": 99},
    "history": "Post-resuscitation, patient is alert and oriented. Reports occasional dizziness during intense exercise for past 6 months, never evaluated. One episode of near-syncope during a run 3 months ago. No chest pain. No palpitations usually. Uncle (mother's brother) died suddenly at 35 during sports. Cousin diagnosed with 'thick heart muscle'. No other medical history. No drug use. No supplements.",
    "physical_exam": "Post-resuscitation, hemodynamically stable. Bisferiens pulse. Double apical impulse. Harsh crescendo-decrescendo systolic murmur at left sternal border that increases with Valsalva and standing (decreases with squatting). S4 present. JVP: Prominent 'a' wave. No signs of heart failure.",
    "investigations": "ECG: LVH with strain pattern, deep T inversions V3-V6, pathological Q waves in lateral leads. Echo: Asymmetric septal hypertrophy (IVS 2.4 cm), SAM of mitral valve with LVOT gradient 65 mmHg at rest (provokable to 95 mmHg with Valsalva), LVEF 70%, LA dilated. Cardiac MRI: Extensive late gadolinium enhancement (fibrosis). Holter: Multiple runs of NSVT. Genetic testing: MYH7 mutation (sarcomere gene). HCM Risk-SCD calculator: >6% (high risk).",
    "diagnosis": "Hypertrophic obstructive cardiomyopathy (HOCM) with survived sudden cardiac arrest - indication for secondary prevention ICD",
    "differentials": ["Hypertrophic cardiomyopathy", "Athlete's heart", "Hypertensive cardiomyopathy", "Anderson-Fabry disease", "Cardiac amyloidosis"],
    "learning_points": [
      "HCM is the commonest cause of sudden cardiac death in young athletes",
      "LVOT obstruction increases with decreased preload (Valsalva, dehydration, standing)",
      "Survived cardiac arrest = Class I indication for ICD (secondary prevention)",
      "Risk factors for SCD in HCM: NSVT, massive LVH (>30mm), unexplained syncope, family history of SCD, extensive fibrosis on CMR",
      "Treatment: Beta-blockers (first line), disopyramide, septal myectomy/alcohol ablation for refractory obstruction",
      "First-degree relatives must be screened with ECG + Echo"
    ],
    "india_context": "HCM prevalence in India estimated at 0.2% in community studies. Lack of pre-participation cardiac screening in Indian sports leads to undetected cases. AED availability at sports venues is extremely limited. Genetic testing is becoming available at select Indian centers."
  },
  {
    "id": "CARD-010",
    "title": "Constrictive Pericarditis - Tubercular Etiology",
    "specialty": "cardiology",
    "difficulty": "advanced",
    "source": "JAPI - Tubercular Pericarditis Series",
    "demographics": {"age": 38, "gender": "Male", "location": "Bhopal, Madhya Pradesh"},
    "chief_complaint": "Progressive abdominal distension and leg swelling for 4 months",
    "presentation": "A 38-year-old farmer presents with progressive abdominal distension, bilateral leg swelling, and exertional dyspnea for 4 months. He was treated for pulmonary TB 5 years ago (completed 6-month ATT). He was initially treated for liver cirrhosis at a local hospital, but ascitic fluid analysis was atypical. He has facial puffiness worse in mornings.",
    "vital_signs": {"bp": "105/80", "hr": 90, "rr": 20, "temp": 36.8, "spo2": 96},
    "history": "Progressive abdominal distension for 4 months, not responding to diuretics. Bilateral leg swelling. Facial puffiness. Exertional dyspnea NYHA II. No orthopnea. No chest pain. Treated for pulmonary TB 5 years ago at a government DOTs center. During TB treatment, had 2 weeks of chest pain with fever (likely pericarditis - not evaluated). No alcohol use. No jaundice. No GI bleeding.",
    "physical_exam": "Facial puffiness. JVP markedly elevated with prominent y descent (Friedreich sign). Kussmaul sign positive (JVP rises with inspiration). Pericardial knock (high-pitched early diastolic sound). No murmurs. Tense ascites. Hepatomegaly, pulsatile (systolic hepatic pulsation). Bilateral pitting edema. No jaundice. No spider naevi.",
    "investigations": "ECG: Low voltage QRS, T wave inversions diffuse. CXR: Pericardial calcification (eggshell pattern), normal heart size. Echo: Thickened pericardium (6 mm), septal bounce, respiratory septal shift, dilated IVC without respiratory variation, E/A >1.5 with restrictive filling. Cardiac MRI: Pericardial thickening 6-8 mm with enhancement, septal bounce on real-time cine. CT chest: Pericardial calcification confirmed. Ascitic fluid: High protein (4.5 g/dL), SAAG <1.1 (not portal hypertension). Hepatic venography: Elevated RA pressure 22 mmHg, equalization of diastolic pressures. ADA: 45 U/L (pericardial fluid).",
    "diagnosis": "Tubercular constrictive pericarditis",
    "differentials": ["Constrictive pericarditis (tubercular)", "Restrictive cardiomyopathy", "Hepatic cirrhosis", "Budd-Chiari syndrome", "Nephrotic syndrome", "Right heart failure"],
    "learning_points": [
      "TB is the commonest cause of constrictive pericarditis in India (30-60%)",
      "Key signs: Kussmaul sign, prominent y descent, pericardial knock",
      "Constrictive vs Restrictive: Septal bounce, pericardial thickening, respiratory variation in ventricular filling distinguish CP",
      "SAAG <1.1 in ascites helps rule out portal hypertension and think of cardiac/peritoneal causes",
      "Treatment: Pericardiectomy is definitive; medical therapy with ATT + steroids may help in early/subacute cases",
      "Pericardial calcification on CXR is virtually diagnostic in the Indian context"
    ],
    "india_context": "India accounts for 26% of global TB burden. Pericardial TB is an extrapulmonary manifestation. RNTCP recommends 6-month ATT for TB pericarditis. Constrictive pericarditis is a feared sequela. Early initiation of steroids during TB pericarditis may reduce progression to constriction (IMPI trial)."
  },
  {
    "id": "CARD-011",
    "title": "Acute Pulmonary Embolism Post-Surgery",
    "specialty": "cardiology",
    "difficulty": "intermediate",
    "source": "Indian Journal of Surgery - VTE Prevention",
    "demographics": {"age": 52, "gender": "Female", "location": "Bengaluru, Karnataka"},
    "chief_complaint": "Sudden breathlessness and chest pain 5 days after knee replacement",
    "presentation": "A 52-year-old woman develops sudden severe dyspnea and pleuritic chest pain on postoperative day 5 following right total knee replacement. She had been mostly bed-bound since surgery. She was not started on thromboprophylaxis due to concern about surgical bleeding. She had one episode of syncope while attempting to walk to the bathroom.",
    "vital_signs": {"bp": "85/55", "hr": 125, "rr": 32, "temp": 37.3, "spo2": 84},
    "history": "Elective right TKR 5 days ago for severe osteoarthritis. Post-op course uneventful until today. Bed-bound for first 3 days. No DVT prophylaxis given. Sudden onset breathlessness and right-sided pleuritic chest pain. One syncopal episode. No hemoptysis. BMI 33. On OCP for menorrhagia. No prior DVT/PE. No family history of clots. No recent long travel.",
    "physical_exam": "Acutely dyspneic, tachypneic, anxious. Hypotensive. JVP markedly elevated. Right ventricular heave. Loud P2. Tricuspid regurgitation murmur. Clear lung fields (no consolidation). Right calf swollen, tender, positive Homan's sign. Left leg: surgical site clean.",
    "investigations": "ECG: Sinus tachycardia, S1Q3T3 pattern, right axis deviation, T wave inversions V1-V4 (RV strain). D-dimer: 8500 ng/mL. CT Pulmonary Angiography: Saddle embolus at pulmonary artery bifurcation with extension into both main pulmonary arteries. RV/LV ratio 1.6 (RV strain). Troponin I: 0.8 (elevated - RV injury). BNP: 850. Echo: Dilated RV, McConnell sign (RV free wall akinesis with apical sparing), TAPSE 12 mm (reduced), moderate TR, PASP 65 mmHg, D-shaped LV. Doppler ultrasound: Acute DVT right popliteal and femoral veins.",
    "diagnosis": "Massive (high-risk) pulmonary embolism with hemodynamic instability - indication for systemic thrombolysis",
    "differentials": ["Pulmonary embolism", "Acute MI", "Pneumothorax", "Aortic dissection", "Fat embolism syndrome (post-orthopedic)"],
    "learning_points": [
      "VTE prophylaxis is mandatory after major orthopedic surgery (LMWH or DOAC for 35 days post TKR/THR)",
      "Massive PE = hemodynamic instability (SBP <90 or requiring vasopressors)",
      "First-line treatment for massive PE: Systemic thrombolysis (alteplase 100mg over 2 hours)",
      "S1Q3T3 is classic but present in only 20% - sinus tachycardia is the commonest ECG finding",
      "McConnell sign on echo is highly specific for acute PE",
      "Risk factors here: major orthopedic surgery, immobility, obesity, OCP use - Padua score high"
    ],
    "india_context": "VTE is under-recognized in India. The ENDORSE study showed only 17% of surgical patients in Indian hospitals received appropriate thromboprophylaxis. Cultural factors (early ambulation, vegetarian diet) were erroneously believed to be protective. API (Association of Physicians of India) guidelines recommend risk-stratified VTE prophylaxis."
  },
  {
    "id": "CARD-012",
    "title": "Atrial Septal Defect with Eisenmenger Syndrome",
    "specialty": "cardiology",
    "difficulty": "advanced",
    "source": "IJMR - Adult Congenital Heart Disease",
    "demographics": {"age": 30, "gender": "Female", "location": "Guwahati, Assam"},
    "chief_complaint": "Progressive bluish discoloration and breathlessness",
    "presentation": "A 30-year-old woman from rural Assam presents with progressive cyanosis and exertional dyspnea for 2 years. She was known to have a 'hole in the heart' since childhood but never received treatment due to lack of access to cardiac surgery. She recently had an episode of massive hemoptysis. She also reports recurrent headaches and visual disturbances.",
    "vital_signs": {"bp": "110/70", "hr": 86, "rr": 22, "temp": 37.0, "spo2": 78},
    "history": "Known ASD since age 8 - diagnosed during an episode of pneumonia. Advised surgery but family could not afford it. Asymptomatic until age 28 when she noticed bluish lips and fingertips. Progressive dyspnea on exertion (NYHA III now). Massive hemoptysis 1 week ago (100ml). Recurrent headaches. One episode of visual disturbance (transient). Erythrocytosis causing hyperviscosity symptoms. No syncope. No chest pain.",
    "physical_exam": "Central cyanosis, clubbing (grade IV). Plethoric face. SpO2 78% on room air. JVP: Elevated, prominent 'a' wave. Right ventricular heave. Palpable P2. Loud single S2 (loud P2, inaudible A2). Graham Steell murmur (high-pitched early diastolic murmur of pulmonary regurgitation). Previously present ASD murmur (flow murmur) now absent. Hepatomegaly. No peripheral edema.",
    "investigations": "ECG: Right axis deviation, RVH with strain, P pulmonale. CXR: Enlarged main pulmonary artery, pruning of peripheral vessels, right atrial and RV enlargement. Echo: Large secundum ASD (3.5 cm), bidirectional shunt (predominantly right-to-left), severely dilated RA and RV, severe pulmonary hypertension (PASP 110 mmHg), severe TR. Cardiac catheterization: PVR 14 Wood units (irreversible), Qp:Qs 0.8 (right-to-left shunt). CBC: Hb 22 g/dL, Hct 68% (secondary erythrocytosis). Uric acid: 10.5. Iron studies: Low ferritin (iron-deficient erythrocytosis).",
    "diagnosis": "Eisenmenger syndrome secondary to large unrepaired atrial septal defect",
    "differentials": ["Eisenmenger syndrome", "Primary pulmonary arterial hypertension", "Chronic thromboembolic pulmonary hypertension", "COPD with cor pulmonale", "Cyanotic congenital heart disease (other)"],
    "learning_points": [
      "Eisenmenger syndrome: irreversible pulmonary vascular disease causing shunt reversal - ASD closure is CONTRAINDICATED",
      "Surgery/device closure is contraindicated once Eisenmenger develops (PVR >8 Wood units)",
      "Hemoptysis in Eisenmenger is from bronchial collaterals and is a late, ominous sign",
      "Secondary erythrocytosis is compensatory - do NOT phlebotomize routinely (only if symptomatic hyperviscosity AND Hct >65%)",
      "Iron deficiency in Eisenmenger worsens hyperviscosity - must supplement iron",
      "Pulmonary vasodilators (bosentan, sildenafil) improve functional capacity and survival"
    ],
    "india_context": "Late presentation of congenital heart disease is common in India due to delayed diagnosis and surgical access barriers. An estimated 200,000 children are born with CHD annually in India, and many progress to Eisenmenger physiology. Bosentan is available through government programs in some states."
  }
]
