[
  {
    "id": "DERM-001",
    "title": "Stevens-Johnson Syndrome / Toxic Epidermal Necrolysis Overlap from Carbamazepine",
    "specialty": "dermatology",
    "difficulty": "advanced",
    "source": "IJDVL Case Reports - Drug-Induced SJS/TEN in Indian Population",
    "demographics": {"age": 28, "gender": "Male", "location": "Lucknow, Uttar Pradesh"},
    "chief_complaint": "Painful blistering rash all over the body with fever and difficulty swallowing for 3 days",
    "presentation": "A 28-year-old man from Lucknow presents to the emergency department with a rapidly progressive painful blistering eruption involving the trunk, extremities, face, and oral mucosa for 3 days. He was started on carbamazepine 200 mg twice daily for newly diagnosed epilepsy 18 days ago. He initially developed fever (39.2°C) and sore throat 4 days ago, followed by erythematous macules on the face and trunk that rapidly coalesced and developed flaccid blisters. He reports painful oral erosions making it difficult to eat or swallow. He also complains of burning and watering of both eyes.",
    "vital_signs": {"bp": "100/60", "hr": 118, "rr": 22, "temp": 39.4, "spo2": 95},
    "history": "Newly diagnosed generalized tonic-clonic seizures 3 weeks ago after a road traffic accident; started on carbamazepine 200 mg BD by a local practitioner 18 days prior. No prior drug allergies known. No history of previous similar episodes. No HIV risk factors. No family history of drug reactions. Non-smoker, occasional alcohol use. No other medications. The rash began as 'target-like' red spots on the chest 3 days ago, rapidly spreading to involve the face, arms, legs, and back. Oral ulcers appeared on day 2. Eye redness and discharge appeared on day 2. Genital erosions noted on day 3. Progressively unable to eat due to oral pain.",
    "physical_exam": "Toxic-appearing, febrile, tachycardic. Skin: Widespread dusky erythematous to violaceous macules and patches with central necrosis involving approximately 18% body surface area (BSA) of full-thickness epidermal detachment (SJS-TEN overlap). Nikolsky sign positive over erythematous areas. Asboe-Hansen sign positive. Flaccid blisters with serous fluid on the trunk and proximal extremities. Large sheets of denuded epidermis on the back resembling 'wet cigarette paper.' Mucous membranes: Hemorrhagic crusting of lips, extensive erosions on buccal mucosa and palate. Eyes: Bilateral conjunctival injection, pseudomembrane formation on right palpebral conjunctiva, lid edema. Genital: Erosions on glans penis and urethral meatus. No lymphadenopathy. Lungs: Clear. Abdomen: Soft, non-tender.",
    "investigations": "CBC: WBC 3,200/μL (leukopenia), Hb 13.8 g/dL, platelets 1,45,000/μL. ESR: 42 mm/hr. CRP: 86 mg/L. LFT: AST 68 IU/L, ALT 72 IU/L, ALP 132 IU/L, bilirubin 1.4 mg/dL. RFT: BUN 32 mg/dL, creatinine 1.3 mg/dL. Serum electrolytes: Na+ 131 mEq/L, K+ 4.8 mEq/L. Blood glucose: 128 mg/dL. Serum bicarbonate: 18 mEq/L. Urine routine: Trace protein. Blood culture: Sent (pending). Skin biopsy (frozen section): Full-thickness epidermal necrosis with subepidermal cleavage, sparse perivascular lymphocytic infiltrate, necrotic keratinocytes — consistent with TEN. SCORTEN at admission: 3 (predicted mortality ~35%). HIV ELISA: Non-reactive. HLA-B*15:02 testing: Sent.",
    "diagnosis": "Stevens-Johnson Syndrome / Toxic Epidermal Necrolysis overlap (SJS-TEN overlap, 10-30% BSA detachment) secondary to carbamazepine",
    "differentials": ["Staphylococcal scalded skin syndrome", "Pemphigus vulgaris", "Acute generalized exanthematous pustulosis (AGEP)", "Erythema multiforme major", "Paraneoplastic pemphigus"],
    "learning_points": [
      "SJS (<10% BSA detachment), SJS-TEN overlap (10-30%), TEN (>30%) represent a severity spectrum; SCORTEN predicts mortality using 7 parameters (age >40, malignancy, BSA >10%, tachycardia >120, BUN >28, glucose >252, bicarbonate <20)",
      "Carbamazepine, phenytoin, allopurinol, sulfonamides, and nevirapine are the most common causative drugs; aromatic anticonvulsants share cross-reactivity",
      "HLA-B*15:02 is strongly associated with carbamazepine-induced SJS/TEN and has high prevalence (6-8%) in Indian populations; ICMR recommends pre-prescription screening in high-risk ethnic groups",
      "Nikolsky sign (lateral pressure on normal-appearing skin causes epidermal separation) and Asboe-Hansen sign (pressure on blister extends it laterally) are key clinical signs",
      "Immediate withdrawal of the offending drug is the single most important intervention; management in a burns unit or ICU with wound care, fluid resuscitation, nutritional support, and ophthalmology consultation is critical",
      "IADVL consensus guidelines recommend against routine systemic corticosteroids; cyclosporine 3-5 mg/kg/day has emerging evidence for reducing mortality if started early"
    ],
    "india_context": "Carbamazepine remains widely prescribed by general practitioners in India for epilepsy. HLA-B*15:02, the pharmacogenomic marker for carbamazepine-induced SJS/TEN, is prevalent in 6-8% of North Indian and up to 15% of South Indian populations. The US FDA mandates HLA-B*15:02 testing before prescribing carbamazepine in Southeast Asian populations. ICMR and IADVL have advocated for pre-prescription HLA screening, but cost and accessibility remain barriers in public hospitals. Lack of dedicated burn units in district hospitals contributes to high mortality. The ADR reporting under PvPI (Pharmacovigilance Programme of India) is gradually improving awareness."
  },
  {
    "id": "DERM-002",
    "title": "Borderline Tuberculoid Leprosy with Ulnar Nerve Involvement",
    "specialty": "dermatology",
    "difficulty": "intermediate",
    "source": "Indian Journal of Leprosy - NLEP Operational Guidelines Case Series",
    "demographics": {"age": 35, "gender": "Male", "location": "Darbhanga, Bihar"},
    "chief_complaint": "Pale patch on left forearm with numbness and weakness of left hand for 4 months",
    "presentation": "A 35-year-old agricultural laborer from Darbhanga, Bihar presents to a primary health center with a single large hypopigmented patch on the left forearm noticed 4 months ago, associated with loss of sensation over the patch. He reports progressive weakness and tingling in his left hand for 2 months, with difficulty buttoning his shirt and holding objects. He has no prior history of skin disease. He lives in a joint family in rural Bihar; a neighbor was treated for leprosy 3 years ago.",
    "vital_signs": {"bp": "122/78", "hr": 76, "rr": 16, "temp": 36.8, "spo2": 98},
    "history": "Single hypopigmented patch first noticed on the left forearm 4 months ago; initially ignored as 'safed daag' (white patch). Gradual numbness over the patch — unable to feel hot or cold. Progressive tingling and weakness of left hand for 2 months. Difficulty with fine motor tasks: buttoning, picking up coins, holding a pen. No history of recurrent painless burns or injuries on hands. No similar lesions elsewhere initially, but on careful questioning, reports a smaller pale patch on the left upper arm noticed 2 weeks ago. No nasal stuffiness or epistaxis. No joint pains. No eye problems. Family history: No known cases of leprosy in family. Lives in a leprosy-endemic area of Bihar. Contact history: A neighbor in the same village completed MDT for multibacillary leprosy 3 years ago.",
    "physical_exam": "Skin: A single well-defined, large (8 × 6 cm) hypopigmented, dry, and scaly plaque with a raised erythematous border on the left forearm. A second smaller (3 × 2 cm) hypopigmented macule on the left upper arm with less distinct margins. Both lesions show definite sensory loss to light touch, pain, and temperature (tested with cotton wisp, pinprick, and warm/cold test tubes). No anhidrosis test performed but the larger lesion appears dry compared to surrounding skin. Nerve examination: Left ulnar nerve — thickened and palpable at the elbow (olecranon groove), tender on palpation. Left lateral popliteal nerve — normal. Left radial cutaneous nerve — normal. Motor: Left hand — partial clawing of ring and little fingers (4th and 5th digits), weakness of finger abduction (dorsal interossei) and adduction (palmar interossei), positive Froment sign (weakness of adductor pollicis), card test positive. Sensory: Diminished sensation over the medial 1.5 fingers of the left hand (ulnar nerve territory). No trophic ulcers. No muscle wasting noted yet. Eyes: No lagophthalmos, corneal sensation intact. Ears: No thickened earlobes. Nasal mucosa: Normal.",
    "investigations": "Slit-skin smear (SSS) from both lesions and both earlobes: Bacteriological Index (BI) = 0 (no acid-fast bacilli seen) — consistent with paucibacillary spectrum. Skin biopsy from the edge of the larger lesion: Well-formed epithelioid granulomas with Langhans giant cells around dermal nerves and adnexal structures, surrounded by a dense lymphocytic cuff. Perineural granulomatous infiltration (granuloma within and around nerve bundles). No acid-fast bacilli on Fite-Faraco stain. Features consistent with borderline tuberculoid (BT) leprosy. Nerve conduction study (NCS): Left ulnar nerve — reduced motor conduction velocity (32 m/s, normal >50 m/s), reduced CMAP amplitude. Sensory conduction absent across the elbow segment. Right ulnar nerve — normal. CBC: Hb 12.8 g/dL, WBC 7,400/μL. Lepromin test: Strongly positive (Mitsuda reaction 8 mm at 4 weeks) — indicates good cell-mediated immunity.",
    "diagnosis": "Borderline tuberculoid (BT) leprosy with left ulnar nerve involvement and early ulnar claw hand (WHO classification: Paucibacillary with Grade 2 disability)",
    "differentials": ["Vitiligo", "Pityriasis versicolor (tinea versicolor)", "Morphea (localized scleroderma)", "Granuloma annulare", "Post-inflammatory hypopigmentation"],
    "learning_points": [
      "The Ridley-Jopling classification places BT leprosy toward the tuberculoid pole with good CMI: well-formed granulomas, few or no AFB, and a positive lepromin test; the key distinguishing feature from TT is involvement of more than one lesion or a nerve trunk",
      "Under the WHO/NLEP simplified classification, paucibacillary (PB) leprosy has 1-5 skin lesions with negative SSS, while multibacillary (MB) has 6 or more lesions or positive SSS; when in doubt, classify as MB",
      "Ulnar nerve is the most commonly affected nerve in leprosy (followed by lateral popliteal, posterior tibial, and facial nerves); thickened peripheral nerves are pathognomonic and must be palpated systematically",
      "Clawing of the 4th and 5th digits (ulnar claw) occurs due to paralysis of the 3rd and 4th lumbricals and interossei; paradoxically, a 'complete' claw (all 4 fingers) indicates combined ulnar + median nerve palsy",
      "NLEP MDT regimen for PB leprosy: Rifampicin 600 mg once monthly (supervised) + Dapsone 100 mg daily for 6 months; however, given the nerve involvement and a second emerging lesion, this patient may warrant MB-MDT (Rifampicin + Clofazimine + Dapsone for 12 months)",
      "Grade 2 disability (visible deformity or damage) requires referral for physiotherapy, voluntary muscle testing, and disability prevention — patients must be taught self-care for insensitive hands"
    ],
    "india_context": "India was declared to have achieved leprosy elimination (<1 case per 10,000 population) at the national level in 2005, but pockets of high endemicity persist in Bihar, Jharkhand, UP, West Bengal, Chhattisgarh, and Odisha. Bihar has the highest prevalence rate among all states. Under NLEP (National Leprosy Eradication Programme), MDT is provided free of cost at all government health facilities. Active case finding through LCDC (Leprosy Case Detection Campaign) and Sparsh Leprosy Awareness Campaign aims to reduce hidden cases. Stigma remains a major barrier to early presentation — this patient initially dismissed the patch as cosmetic. IADVL guidelines emphasize examination of peripheral nerves in any hypopigmented anaesthetic patch and recommend MB-MDT when nerve involvement is prominent even with fewer than 5 skin lesions."
  },
  {
    "id": "DERM-003",
    "title": "Pemphigus Vulgaris with Oral and Cutaneous Involvement",
    "specialty": "dermatology",
    "difficulty": "advanced",
    "source": "IJDVL - IADVL Task Force on Pemphigus Management in India",
    "demographics": {"age": 42, "gender": "Female", "location": "Jodhpur, Rajasthan"},
    "chief_complaint": "Painful non-healing oral ulcers for 2 months and blisters all over the body for 3 weeks",
    "presentation": "A 42-year-old woman from Jodhpur, Rajasthan presents with painful erosions in the mouth for 2 months that have not responded to multiple courses of antifungal and antibiotic gels. For the last 3 weeks, she has developed multiple flaccid blisters on the scalp, face, trunk, and groin that rupture easily, leaving painful raw areas. She reports significant weight loss (5 kg) due to inability to eat because of oral pain. She has no history of drug intake prior to the onset of oral lesions.",
    "vital_signs": {"bp": "118/76", "hr": 88, "rr": 18, "temp": 37.2, "spo2": 97},
    "history": "Oral erosions began 2 months ago on the buccal mucosa and palate, initially mistaken for aphthous ulcers. Treated by a dentist with fluconazole mouth paint and chlorhexidine without improvement. Erosions spread to involve the gingiva and lips. Cutaneous blisters appeared 3 weeks ago — first on the scalp, then trunk, axillae, and groin. Blisters are superficial, rupture within hours of forming, and leave painful eroded surfaces that do not heal. Clothing and bedsheets stick to the raw areas. No itching — predominantly painful. Significant difficulty eating (lost 5 kg in 2 months). No eye involvement. No genital blisters initially but now has vulvar erosions. No fever. No prior skin disease. No drug history prior to onset. Hindu vegetarian. No family history of autoimmune disease.",
    "physical_exam": "Thin, appears distressed due to pain. Skin: Multiple flaccid blisters (0.5-3 cm) containing clear serous fluid on an erythematous base, scattered over the scalp, face, neck, trunk, axillae, and inguinal folds. Extensive post-blister erosions with thin serosanguinous crust — irregularly shaped, non-grouped. Nikolsky sign positive (direct and marginal): lateral pressure on perilesional normal-appearing skin produces epidermal separation. Asboe-Hansen sign positive: gentle pressure on intact blister causes lateral extension. No intact 'tense' blisters seen (all flaccid). Scalp: Crusted erosions with matted hair. Oral cavity: Extensive painful erosions on buccal mucosa bilaterally, hard palate, soft palate, and lower lip vermilion. Gingiva shows desquamative gingivitis. No intact oral blisters visible (rupture immediately). Bulla spread sign positive. Eyes: No conjunctival involvement. Nails: Normal. No mucosal involvement of nose.",
    "investigations": "Tzanck smear (from blister floor): Acantholytic cells (rounded keratinocytes with large hyperchromatic nuclei and peripheral condensation of cytoplasm — 'fried egg' appearance) — highly suggestive of pemphigus. Skin biopsy (perilesional skin of intact blister): Suprabasal acantholysis with a 'row of tombstones' appearance (basal cells remain attached to basement membrane while suprabasal cells separate). Intraepidermal cleft formation. Mild perivascular inflammatory infiltrate with eosinophils. Direct immunofluorescence (DIF) of perilesional uninvolved skin: 'Fishnet' or 'chicken-wire' pattern of intercellular IgG and C3 deposits in the epidermis — pathognomonic. Indirect immunofluorescence (IIF): Positive for circulating IgG anti-intercellular antibodies on monkey esophagus substrate, titer 1:160. Anti-Desmoglein ELISA: Anti-Dsg3: 186 U/mL (strongly positive, normal <20), Anti-Dsg1: 124 U/mL (positive). CBC: Hb 10.8 g/dL, WBC 8,200/μL. Serum protein: Total 5.2 g/dL, albumin 2.8 g/dL (hypoalbuminemia from protein loss through denuded skin). RBS: 94 mg/dL. LFT, RFT: Normal. HIV, Hepatitis B & C: Non-reactive. Chest X-ray: Normal.",
    "diagnosis": "Pemphigus vulgaris — mucocutaneous type (both anti-Dsg1 and anti-Dsg3 positive) with hypoalbuminemia",
    "differentials": ["Bullous pemphigoid", "Paraneoplastic pemphigus", "Pemphigus foliaceus", "Erythema multiforme / SJS", "Herpetiform dermatitis (dermatitis herpetiformis)"],
    "learning_points": [
      "Pemphigus vulgaris is the most common autoimmune blistering disease in India (unlike Western countries where bullous pemphigoid is more common); PV has a particularly high incidence among Indians, possibly linked to HLA-DRB1*14:04",
      "The 'desmoglein compensation theory' explains clinical phenotypes: mucosal-dominant PV (anti-Dsg3 only), mucocutaneous PV (anti-Dsg1 + Dsg3), and pemphigus foliaceus (anti-Dsg1 only) — Dsg3 predominates in oral mucosa while Dsg1 predominates in skin",
      "Nikolsky sign (positive) and Tzanck smear (showing acantholytic cells) are rapid bedside tests; but DIF showing intercellular IgG/C3 in a fishnet pattern is the gold standard for diagnosis",
      "IADVL consensus recommends systemic corticosteroids (prednisolone 1-1.5 mg/kg/day) as initial therapy combined with a steroid-sparing immunosuppressant (azathioprine 2-3 mg/kg/day is first-line in India due to cost; check TPMT before starting); rituximab is increasingly used for refractory cases",
      "Anti-Dsg1 and anti-Dsg3 ELISA titers correlate with disease activity and are used to guide tapering of immunosuppression; rising titers may predict relapse before clinical flare",
      "Complications include secondary bacterial sepsis (leading cause of death), electrolyte imbalances from extensive skin loss, hypoalbuminemia, and iatrogenic complications from prolonged immunosuppression (steroid-induced diabetes, osteoporosis, infections)"
    ],
    "india_context": "India has one of the highest incidences of pemphigus vulgaris in the world. The IADVL Task Force on Pemphigus (2019) provides India-specific management guidelines. Rituximab, now recommended as an early treatment option by international consensus, is available in India but cost (~Rs 30,000-40,000 per cycle) remains a barrier in public hospitals. Azathioprine remains the most commonly used steroid-sparing agent. Mycophenolate mofetil is an alternative. Dexamethasone-cyclophosphamide pulse (DCP) therapy, pioneered in India, involves monthly IV pulses and is still used in some centers for severe PV. Endemic pemphigus foliaceus (fogo selvagem) is not reported in India, but sporadic PF does occur. Patients in Rajasthan often present late due to initial misdiagnosis as oral candidiasis or aphthous stomatitis."
  },
  {
    "id": "DERM-004",
    "title": "Chronic Plaque Psoriasis with Psoriatic Arthritis",
    "specialty": "dermatology",
    "difficulty": "intermediate",
    "source": "Indian Journal of Dermatology - GRAPPA and IADVL Guidelines on Psoriatic Disease",
    "demographics": {"age": 38, "gender": "Male", "location": "Pune, Maharashtra"},
    "chief_complaint": "Recurrent scaly red patches on elbows, knees, and scalp for 5 years with joint pain and swelling in fingers for 6 months",
    "presentation": "A 38-year-old IT professional from Pune presents with a chronic relapsing history of well-defined erythematous scaly plaques on extensor surfaces and scalp for 5 years, now worsened. Over the last 6 months, he has developed pain, stiffness, and sausage-like swelling of the 3rd and 4th fingers of the right hand and bilateral heel pain. He reports significant psychological distress and workplace embarrassment due to visible skin lesions. He was previously treated with topical steroids and coal tar with partial improvement.",
    "vital_signs": {"bp": "130/84", "hr": 78, "rr": 16, "temp": 36.9, "spo2": 98},
    "history": "Skin lesions first appeared at age 33 on the elbows as small red patches. Gradually spread to knees, lower back, and scalp. Recurrent course with partial remission in summers and exacerbation in winters. Auspitz sign noted by previous dermatologist — pinpoint bleeding on scraping. Scalp involvement causes significant 'flaking' and social embarrassment. Nail changes noticed 2 years ago — pitting and yellowish discoloration. Joint symptoms began 6 months ago: early morning stiffness lasting >45 minutes, pain and swelling of right 3rd and 4th DIP joints, and dactylitis of right 3rd finger. Bilateral heel pain (enthesitis) worse on waking. Low back stiffness for 3 months. No preceding sore throat or urethritis. No eye symptoms. Family history: Father had similar skin patches (never diagnosed). Alcohol: Occasional social drinking. Non-smoker. BMI 28.5. No history of diabetes or hypertension.",
    "physical_exam": "Skin: Well-defined erythematous plaques with thick, silvery-white, micaceous scales on bilateral elbows (3 × 4 cm each), knees (5 × 6 cm each), lower back/sacral area, and intergluteal cleft. Scalp: Extensive scaling extending beyond the hairline at the forehead and behind ears (scalp PASI: severe). Auspitz sign: Positive — gentle removal of scales produces pinpoint bleeding. Grattage test positive — initial candle wax-like silvery scale (candle sign), followed by shiny membrane (last membrane), followed by pinpoint bleeding (Auspitz sign). Koebner phenomenon: Linear psoriatic plaque at the site of a recent scratch on the forearm. Nails: Bilateral fingernail pitting (>20 pits), oil drop sign (yellowish-brown discoloration under nail plate) on right 3rd and 4th nails, distal onycholysis of right 2nd nail. No subungual hyperkeratosis. PASI score: 18.4 (moderate-to-severe). BSA involvement: 14%. DLQI score: 19 (very large impact on quality of life). Joints: Right 3rd finger — dactylitis ('sausage digit'), tender swollen DIP joint. Right 4th finger — DIP joint tender and swollen. Left hand — 2nd DIP mildly tender. Bilateral Achilles tendon tenderness (enthesitis). Restricted lumbar flexion (modified Schober: 3.5 cm, normal >5 cm). SI joint compression test: Mildly positive bilaterally.",
    "investigations": "CBC: Hb 14.2 g/dL, WBC 9,100/μL, platelets 3,20,000/μL. ESR: 38 mm/hr. CRP: 22 mg/L. Rheumatoid factor: Negative. Anti-CCP antibodies: Negative. Serum uric acid: 7.8 mg/dL (mildly elevated — associated with psoriasis). HLA-B27: Positive. ANA: Negative. Fasting glucose: 108 mg/dL (impaired fasting glucose). Lipid profile: TC 232, LDL 152, TG 198, HDL 38 mg/dL (metabolic syndrome features). LFT: Normal (important before methotrexate). Hepatitis B sAg: Negative. Hepatitis C: Negative. X-ray hands: Pencil-in-cup deformity at right 3rd DIP joint, periosteal new bone formation, juxta-articular soft tissue swelling, preserved joint space at MCP joints (unlike RA). X-ray pelvis: Bilateral sacroiliitis grade 2. X-ray feet: Achilles tendon enthesophyte bilaterally. Skin biopsy (confirmatory): Regular acanthosis (psoriasiform hyperplasia), thinning of suprapapillary plates, dilated and tortuous capillaries in dermal papillae, Munro microabscesses (neutrophils in stratum corneum), hypogranulosis. Consistent with psoriasis.",
    "diagnosis": "Chronic plaque psoriasis (moderate-to-severe, PASI 18.4) with psoriatic arthritis — oligoarticular with dactylitis, enthesitis, and axial involvement (CASPAR criteria met)",
    "differentials": ["Seborrhoeic dermatitis (scalp involvement)", "Pityriasis rosea", "Nummular eczema", "Lichen planus", "Secondary syphilis (psoriasiform lesions)"],
    "learning_points": [
      "CASPAR criteria for PsA (score ≥3): Current psoriasis (2 points), nail dystrophy (1), negative RF (1), dactylitis (1), juxta-articular new bone formation on X-ray (1); this patient scores 6/6",
      "The five clinical patterns of PsA (Moll and Wright): oligoarticular asymmetric (most common), polyarticular symmetric (RA-like), DIP-predominant, spondylitis/sacroiliitis, and arthritis mutilans; patterns may overlap and evolve",
      "Pencil-in-cup deformity on X-ray is characteristic of PsA (erosion of distal phalanx + proliferation of proximal phalanx at DIP joint) and distinguishes it from RA which typically involves MCP/PIP joints with periarticular osteopenia",
      "Psoriasis is a systemic inflammatory disease with metabolic comorbidities: metabolic syndrome, cardiovascular disease, NAFLD, diabetes, and depression must be actively screened for — this patient already shows dyslipidemia and impaired fasting glucose",
      "For moderate-to-severe psoriasis (PASI >10 or DLQI >10) with PsA, systemic therapy is indicated: methotrexate 15-25 mg/week is first-line (IADVL guideline); biologics (TNF inhibitors, IL-17 inhibitors, IL-23 inhibitors) are indicated if inadequate response to conventional DMARDs or for severe PsA"
    ],
    "india_context": "Psoriasis prevalence in India is estimated at 0.44-2.8%, with significant regional variation. The IADVL provides consensus guidelines on management stratified by severity. Methotrexate remains the backbone of systemic therapy in Indian settings due to cost-effectiveness (Rs 5-10/tablet). Biologics like secukinumab and adalimumab are increasingly available as biosimilars in India at significantly reduced costs (Rs 8,000-15,000/dose compared to >Rs 30,000 for originator brands), improving access. The 'psoriasis metabolic syndrome' is particularly relevant in urban Indian populations with changing dietary patterns. Stigma associated with visible skin disease is significant in Indian society, affecting marriage prospects and workplace participation. GRAPPA (Group for Research and Assessment of Psoriasis and Psoriatic Arthritis) treatment recommendations are adapted by Indian rheumatologists and dermatologists in joint clinics."
  },
  {
    "id": "DERM-005",
    "title": "Epidemic Dermatophytosis — Recalcitrant Tinea Corporis et Cruris",
    "specialty": "dermatology",
    "difficulty": "beginner",
    "source": "IADVL National Task Force on Dermatophytosis - Expert Consensus 2021",
    "demographics": {"age": 26, "gender": "Female", "location": "Patna, Bihar"},
    "chief_complaint": "Itchy ring-shaped rashes on groin, buttocks, and inner thighs for 8 months, not improving with creams",
    "presentation": "A 26-year-old married homemaker from Patna, Bihar presents with intensely pruritic, ring-shaped erythematous lesions on the groin, inner thighs, buttocks, and lower abdomen for 8 months. She has been using various over-the-counter combination creams containing clobetasol + miconazole + neomycin (purchased from local chemist on pharmacist's advice) for 6 months with initial improvement followed by worsening and spread. Her husband and mother-in-law have similar lesions. The itch is severe, worse at night, and disrupts sleep.",
    "vital_signs": {"bp": "110/70", "hr": 72, "rr": 16, "temp": 36.7, "spo2": 99},
    "history": "Lesions first appeared in the groin 8 months ago during the monsoon season as a small itchy red ring on the left inner thigh. Over-the-counter combination cream (containing potent topical steroid + antifungal) applied for 6 months — initial dramatic improvement followed by rebound worsening, spread, and change in morphology (loss of classical ring pattern). Now involves bilateral groins, inner thighs, buttocks, perianal area, and lower abdomen. New lesions on the waist (under the petticoat string). Severe pruritus — nocturnal, disrupts sleep. Husband has similar groin lesions for 4 months. Mother-in-law has tinea corporis on trunk. No diabetes. No immunosuppression. Regular menstrual cycles. No vaginal discharge. Shares towels with husband. Wears synthetic undergarments. Lives in a joint family with shared bathroom.",
    "physical_exam": "Skin: Bilateral extensive annular and polycyclic erythematous plaques with raised, scaly, and vesiculopustular active borders and relatively clear centers involving both inguinal folds, inner thighs, buttocks, perianal area, and lower abdomen. Some lesions show concentric rings (tinea imbricata-like pattern) due to steroid modification. Several lesions have lost the classical annular pattern and appear as diffuse erythematous scaly patches (tinea incognito due to prolonged topical steroid use). Satellite lesions present at the periphery. Striae noted in the inguinal folds (steroid-induced). Skin atrophy in areas of prolonged steroid application. Total involved BSA: ~8%. No nail involvement. No scalp involvement. Hair: No breakage. Mucosae: Normal.",
    "investigations": "KOH mount (10% KOH of skin scraping from active border): Multiple septate, branching hyphae — confirming dermatophyte infection. Fungal culture (Sabouraud dextrose agar): Growth at 3 weeks — white powdery colony with reddish-brown reverse. Microscopy: Numerous microconidia along hyphae. Identified as Trichophyton mentagrophytes (ITS region-based complex, now reclassified under T. mentagrophytes VIII genotype — the predominant strain in the Indian epidemic). Antifungal susceptibility testing (AFST): Elevated MIC for terbinafine (MIC 0.5 μg/mL, normal <0.01), susceptible to itraconazole (MIC 0.06 μg/mL) and voriconazole (MIC 0.03 μg/mL). CBC: Normal. Fasting glucose: 96 mg/dL. HbA1c: 5.4%. HIV: Non-reactive.",
    "diagnosis": "Chronic recalcitrant dermatophytosis — tinea corporis et cruris (steroid-modified / tinea incognito) caused by terbinafine-resistant Trichophyton mentagrophytes complex",
    "differentials": ["Erythema annulare centrifugum", "Nummular eczema", "Psoriasis (inverse/flexural)", "Candidal intertrigo", "Contact dermatitis"],
    "learning_points": [
      "India is experiencing an unprecedented epidemic of chronic, recalcitrant dermatophytosis since 2015 caused primarily by Trichophyton mentagrophytes/indotineae complex with reduced susceptibility to terbinafine; single-point mutations in the squalene epoxidase gene (Leu393Phe, Phe397Leu) confer resistance",
      "The 'epidemic triad' driving recalcitrance in India: (1) rampant OTC use of irrational combination creams containing potent topical steroids + antifungals (e.g., clobetasol + ketoconazole + neomycin), (2) terbinafine resistance in dermatophytes, and (3) hot-humid climate with shared living conditions",
      "Tinea incognito refers to dermatophyte infection modified by topical corticosteroid misuse — characterized by loss of the typical annular morphology, reduced scaling, and atypical appearance that mimics other dermatoses; always perform KOH in doubtful cases",
      "IADVL Task Force (2021) consensus for chronic/recalcitrant dermatophytosis: Itraconazole 200 mg/day (or 100 mg BD) for 8-12 weeks as preferred systemic antifungal; avoid terbinafine monotherapy in epidemic areas; add sertaconazole or luliconazole topically",
      "The DGCI (now CDSCO) banned fixed-dose combination topical preparations of corticosteroids with antifungals and antibiotics in September 2023 to curb this epidemic; patient education about avoiding OTC steroid creams is essential"
    ],
    "india_context": "The dermatophytosis epidemic in India is considered a public health crisis. An estimated 60-70% of dermatology OPD visits in North and East India are for tinea. The IADVL has constituted a special task force and published consensus statements (2018, 2021). Trichophyton indotineae (previously T. mentagrophytes genotype VIII), first identified in India, has now spread to other countries. The rampant sale of irrational FDC creams over-the-counter (estimated annual market >Rs 2,500 crore) has been a key driver. Despite the CDSCO ban on certain FDCs, enforcement remains challenging. Bihar, UP, West Bengal, and Jharkhand are the worst affected states. Shared living arrangements in joint families, common in Indian culture, facilitate household transmission. The ICMR has funded multicenter studies on antifungal resistance patterns. Patient counseling must address: stopping steroid creams, completing full antifungal course, washing clothes in hot water, not sharing towels, and treating household contacts simultaneously."
  },
  {
    "id": "DERM-006",
    "title": "Cutaneous Leishmaniasis (Delhi Boil / Oriental Sore)",
    "specialty": "dermatology",
    "difficulty": "intermediate",
    "source": "IJDVL - Kala-azar and Cutaneous Leishmaniasis in India",
    "demographics": {"age": 12, "gender": "Male", "location": "Bikaner, Rajasthan"},
    "chief_complaint": "Non-healing painless ulcer on the left cheek for 3 months",
    "presentation": "A 12-year-old boy from a semi-urban area of Bikaner, Rajasthan is brought by his parents with a non-healing, painless nodulo-ulcerative lesion on the left cheek that began as a small papule 3 months ago and has slowly enlarged. The lesion is not painful but is cosmetically disfiguring, causing the child distress at school. There is no fever, weight loss, or hepatosplenomegaly. The family lives in a kaccha (mud-walled) house near a sandy area. They have noticed increased sandfly activity in the evenings. No prior treatment sought except application of turmeric paste by grandmother.",
    "vital_signs": {"bp": "100/65", "hr": 82, "rr": 18, "temp": 36.8, "spo2": 99},
    "history": "A small, painless, erythematous papule noticed on the left cheek 3 months ago. Parents initially attributed it to an insect bite. Gradually enlarged over weeks to form a nodule, which then ulcerated centrally. Currently measures about 2.5 cm. No pain — mild occasional itching. No discharge initially but now has a serous crust. No satellite lesions. No similar lesions elsewhere. No fever, weight loss, loss of appetite, or abdominal distension (no features of visceral leishmaniasis). No history of travel to kala-azar endemic areas (Bihar, Jharkhand). Lives in Bikaner — an established endemic area for cutaneous leishmaniasis. Kaccha house near a desert fringe area with open drains. No bed net use. Older sister had a similar lesion on the arm 2 years ago that healed with scarring after treatment at a government hospital. Family keeps cattle (peridomestic cattle attract sandflies). Immunization: Complete as per NIS. No known immunodeficiency.",
    "physical_exam": "Well-nourished child, active, afebrile. Skin: A single, well-defined, oval, erythematous nodulo-ulcerative plaque (2.5 × 2 cm) on the left cheek. Central shallow ulceration with clean granulating base and adherent yellowish serous crust ('volcanic crater' or 'pizza-like' appearance). Borders are raised, indurated, and erythematous-violaceous. Surrounding skin shows mild erythema but no cellulitis. Non-tender on palpation. No lymphangitis. Left pre-auricular and submandibular lymph nodes: Mildly enlarged (1 cm), non-tender, mobile. No other skin lesions. No mucosal involvement. Abdomen: No hepatosplenomegaly. No pallor or wasting.",
    "investigations": "Slit-skin smear from the ulcer edge (Giemsa stain): Leishman-Donovan (LD) bodies identified — small (2-4 μm), round to oval amastigotes with a nucleus and kinetoplast seen within macrophages and extracellularly. Smear positive: Confirms diagnosis. Skin biopsy from the edge of the lesion: Dense dermal granulomatous infiltrate with epithelioid cells, Langhans giant cells, numerous plasma cells, and lymphocytes. Intracellular amastigotes seen within macrophages on Giemsa stain. No caseation necrosis. Consistent with cutaneous leishmaniasis. rK39 rapid immunochromatographic test: Negative (rules out visceral leishmaniasis). PCR (from biopsy tissue): Positive for Leishmania tropica. CBC: Hb 12.1 g/dL, WBC 8,300/μL, platelets 2,80,000/μL (normal — no pancytopenia to suggest VL). Peripheral smear: Normal. LFT, RFT: Normal.",
    "diagnosis": "Cutaneous leishmaniasis (Delhi boil / Oriental sore) caused by Leishmania tropica, localized form",
    "differentials": ["Lupus vulgaris (cutaneous tuberculosis)", "Squamous cell carcinoma", "Sporotrichosis (fixed cutaneous form)", "Keratoacanthoma", "Foreign body granuloma"],
    "learning_points": [
      "Cutaneous leishmaniasis (CL) in India is primarily caused by L. tropica (anthroponotic form) and is endemic in Rajasthan (Bikaner, Jodhpur, Jaisalmer, Barmer), with Phlebotomus sergenti as the principal vector; this is distinct from visceral leishmaniasis caused by L. donovani in Bihar",
      "The classic morphology of CL is a painless papule evolving into a nodule and then a 'volcano-like' ulcer with raised rolled borders and a clean granulating base; spontaneous healing occurs over 6-18 months but leaves a disfiguring scar",
      "Diagnosis is confirmed by demonstration of LD bodies (amastigotes with nucleus + bar-shaped kinetoplast) on Giemsa-stained slit-skin smear or biopsy; PCR is more sensitive for species identification",
      "Treatment options include intralesional sodium stibogluconate (SSG) 50-100 mg per session weekly for 6-8 sessions for small single lesions; cryotherapy with liquid nitrogen; systemic miltefosine (2.5 mg/kg/day for 28 days) or SSG for multiple or large lesions per NVBDCP guidelines",
      "Distinguishing CL from lupus vulgaris (cutaneous TB) is important in endemic areas: apple-jelly nodules on diascopy favor lupus vulgaris; LD bodies on smear confirm CL; PCR can differentiate"
    ],
    "india_context": "Cutaneous leishmaniasis is an established endemic disease in the Thar Desert region of Rajasthan with periodic outbreaks. Bikaner is a well-documented hotspot. CL is often referred to as 'Delhi boil' or 'Bikaner sore' in Indian literature. Under the NVBDCP (National Vector Borne Disease Control Programme), kala-azar elimination targets exist but CL receives comparatively less policy attention. Sandfly control measures (indoor residual spraying with DDT/synthetic pyrethroids, insecticide-treated bed nets) are recommended. Living in kaccha houses near desert terrain with peridomestic cattle increases risk. The ICMR recommends intralesional SSG as first-line for localized CL. Unlike kala-azar, CL is not a notifiable disease in most Indian states, leading to under-reporting. Cosmetic disfigurement is a significant concern especially for facial lesions in children, emphasizing the need for early treatment to minimize scarring."
  },
  {
    "id": "DERM-007",
    "title": "Erythema Nodosum Leprosum (Type 2 Lepra Reaction) During MDT",
    "specialty": "dermatology",
    "difficulty": "advanced",
    "source": "Indian Journal of Leprosy - Managing Lepra Reactions under NLEP",
    "demographics": {"age": 30, "gender": "Male", "location": "Raipur, Chhattisgarh"},
    "chief_complaint": "Painful red nodules all over the body with high fever and joint pain for 5 days, currently on leprosy treatment",
    "presentation": "A 30-year-old daily wage laborer from Raipur, Chhattisgarh presents with acute onset of multiple tender erythematous subcutaneous nodules on the face, arms, and legs for 5 days, accompanied by high-grade fever (39.5°C), severe malaise, painful swollen joints (knees and ankles), and painful swollen right testicle. He was diagnosed with lepromatous leprosy (LL) 4 months ago and has been on WHO MB-MDT. He reports that the nodules are extremely painful, preventing him from working, and some have developed superficial ulceration.",
    "vital_signs": {"bp": "110/70", "hr": 110, "rr": 22, "temp": 39.5, "spo2": 96},
    "history": "Diagnosed with lepromatous leprosy 4 months ago at the district hospital: multiple ill-defined shiny skin lesions, nodular thickening of earlobes, bilateral symmetrical glove-and-stocking anesthesia, bilateral ulnar and lateral popliteal nerve thickening, BI 4+. Started on WHO MB-MDT (rifampicin 600 mg monthly, clofazimine 300 mg monthly + 50 mg daily, dapsone 100 mg daily). Was compliant with treatment. Five days ago, developed acute onset of multiple painful red bumps on the face, forearms, and shins. Associated with high fever (39-40°C), rigors, severe joint pain (bilateral knees, ankles), and painful swelling of the right testicle. Malaise and anorexia. Some nodules have become ulcerated. No eye symptoms. No recent injury or infection. No history of ENL before starting MDT.",
    "physical_exam": "Febrile, toxic-appearing, in significant pain. Skin: Numerous (>30) tender, erythematous, subcutaneous nodules (1-3 cm) distributed over the face, extensor surfaces of forearms, anterior thighs, and shins. Several nodules show superficial pustulation and ulceration with purulent discharge (necrotizing ENL). The underlying lepromatous skin lesions (diffuse infiltration, nodules) are still present. Earlobes: Nodular thickening bilaterally. Nerves: Bilateral ulnar nerves thickened and tender (more tender than at baseline — suggesting neuritis component). Bilateral lateral popliteal nerves thickened. No new motor deficit compared to baseline. Joints: Bilateral knee effusions, tender swollen ankles, polyarthralgia. Testes: Right testis enlarged, tender, warm (acute orchitis). Left testis normal. Eyes: Mild bilateral conjunctival injection, no iridocyclitis on slit lamp (ophthalmology consulted). No lagophthalmos. Hands: Pre-existing bilateral partial claw hands (ulnar and median nerve palsy from leprosy). No new motor deficit. No trophic ulcers.",
    "investigations": "CBC: WBC 14,200/μL with neutrophilic leukocytosis, Hb 10.4 g/dL, platelets 3,80,000/μL. ESR: 92 mm/hr. CRP: 148 mg/L. LFT: AST 42, ALT 38, ALP 118, bilirubin 0.9 (normal — important to monitor with MDT). RFT: Creatinine 1.1 mg/dL, BUN 22 mg/dL. Urine: Trace protein (check for ENL-associated glomerulonephritis). Slit-skin smear (from an ENL nodule): BI 3+ with fragmented and granular bacilli (degenerating organisms). Skin biopsy from ENL nodule: Dense neutrophilic infiltrate in the dermis and subcutis with vasculitis (leukocytoclastic vasculitis), edema, and scattered foamy macrophages containing fragmented AFB. Panniculitis pattern. Consistent with ENL (Type 2 reaction). Direct immunofluorescence: Granular deposits of IgG, IgM, and C3 in dermal vessel walls — confirming immune complex-mediated vasculitis. Serum TNF-alpha: Markedly elevated. Testicular ultrasound: Right testis enlarged, heterogeneous echotexture, increased vascularity — orchitis. No abscess.",
    "diagnosis": "Erythema nodosum leprosum (Type 2 lepra reaction) with necrotizing ENL, acute orchitis, polyarthritis, and neuritis — occurring during MB-MDT for lepromatous leprosy",
    "differentials": ["Type 1 lepra reaction (reversal reaction)", "Sweet syndrome (acute febrile neutrophilic dermatosis)", "Polyarteritis nodosa", "Erythema nodosum (other causes: TB, sarcoidosis, drugs)", "Secondary syphilis"],
    "learning_points": [
      "ENL (Type 2 lepra reaction) occurs in BL/LL leprosy and is a systemic immune complex-mediated (Arthus-type / Type III hypersensitivity) vasculitis; it differs fundamentally from Type 1 reversal reaction which is a Type IV (delayed-type) hypersensitivity response occurring across the borderline spectrum",
      "Key features of ENL: crops of painful erythematous subcutaneous nodules, high fever, neutrophilic leukocytosis, and systemic involvement — iridocyclitis, orchitis/epididymitis, arthritis, nephritis (proteinuria), lymphadenitis, hepatitis, and neuritis; it is a medical emergency when severe",
      "Distinguishing Type 1 from Type 2 reaction is critical: Type 1 — existing lesions become erythematous, edematous, and tender with acute neuritis (upgrade/downgrade); Type 2 — new crops of nodules appear over 'normal' skin, with systemic features and neutrophilic infiltrate",
      "NLEP guidelines for severe ENL: Prednisolone 40-60 mg/day tapered over 12 weeks; thalidomide 100-300 mg/day is the most effective drug for ENL (dramatically reduces TNF-alpha) but is strictly contraindicated in women of childbearing age due to teratogenicity; clofazimine in anti-inflammatory doses (300 mg/day) can be used as a steroid-sparing agent",
      "MDT must NEVER be stopped during reactions — this is a common error; reactions are not drug side effects but immunological phenomena; stopping MDT worsens the prognosis",
      "Chronic/recurrent ENL (>6 months or >3 episodes) occurs in ~50% of LL patients and may require prolonged immunosuppression; apremilast and methotrexate are emerging alternatives in thalidomide-ineligible patients"
    ],
    "india_context": "India contributes ~60% of the global new leprosy cases, and ENL is encountered frequently in multibacillary patients in endemic states (Chhattisgarh, Bihar, Odisha, West Bengal, Maharashtra). Under NLEP, MDT is provided free at all government facilities, and health workers are trained to recognize reactions and refer promptly. Thalidomide, though highly effective for ENL, requires strict regulation due to teratogenicity — its use in India is restricted under the Thalidomide Protocol with mandatory pregnancy testing and contraception counseling. In practice, corticosteroids remain the mainstay due to thalidomide's limited availability. The key teaching point for NLEP field workers: never stop MDT during a reaction. ENL-related orchitis can lead to testicular atrophy and infertility if untreated — an important but under-discussed complication in young Indian males. IADVL and IAL (Indian Association of Leprologists) provide clinical practice guidelines for lepra reactions."
  },
  {
    "id": "DERM-008",
    "title": "DRESS Syndrome Secondary to Allopurinol",
    "specialty": "dermatology",
    "difficulty": "advanced",
    "source": "IJDVL - Drug Hypersensitivity Syndrome / DRESS in Indian Patients",
    "demographics": {"age": 55, "gender": "Male", "location": "Chennai, Tamil Nadu"},
    "chief_complaint": "High-grade fever, generalized rash, facial swelling, and dark-colored urine for 1 week",
    "presentation": "A 55-year-old retired bank employee from Chennai presents with high-grade fever (39-40°C) for 10 days, a progressive generalized morbilliform rash for 7 days, marked facial edema for 5 days, and dark-colored urine for 3 days. He was started on allopurinol 300 mg/day for hyperuricemia and gouty arthritis 5 weeks ago by an orthopedic surgeon. The rash began on the face and upper trunk and has spread to involve >80% of the body surface. He reports malaise, sore throat, and mild abdominal pain. He was initially treated as viral fever with paracetamol without improvement.",
    "vital_signs": {"bp": "105/68", "hr": 112, "rr": 24, "temp": 39.8, "spo2": 94},
    "history": "Started allopurinol 300 mg/day 5 weeks ago for recurrent gouty arthritis with serum uric acid 9.8 mg/dL and mildly elevated creatinine (1.4 mg/dL). No prior allopurinol or febuxostat use. Also takes amlodipine 5 mg for hypertension (stable for 5 years — unlikely causative). High-grade intermittent fever started 10 days ago, initially attributed to viral illness by local GP. Morbilliform rash appeared on the face and trunk 7 days ago and rapidly generalized. Marked facial edema (periorbital and lips) developed 5 days ago. Generalized lymph node swelling noticed 4 days ago. Dark urine (tea-colored) for 3 days. Mild right upper quadrant abdominal discomfort. No jaundice noticed by family. Mild sore throat, no dysphagia. No blisters or skin peeling (distinguishes from SJS/TEN). Known type 2 diabetes on metformin 500 mg BD (HbA1c 7.2%). Hypertension on amlodipine 5 mg. Chronic kidney disease stage 2 (creatinine 1.4 at baseline). No known drug allergies.",
    "physical_exam": "Ill-appearing, febrile, tachycardic. Marked facial edema with periorbital swelling (giving a leonine facies-like appearance). Skin: Confluent morbilliform (measles-like) erythematous eruption covering >80% BSA involving the face, trunk, upper and lower extremities. Follicular accentuation noted. Scattered purpuric macules on lower limbs. No target lesions. No blisters or epidermal detachment — Nikolsky sign negative (distinguishes from SJS/TEN). Mild desquamation on the trunk. No pustules. Lymphadenopathy: Generalized — bilateral cervical (2 cm), axillary (1.5 cm), inguinal (1.5 cm); rubbery, non-tender, mobile. Oral mucosa: Mild pharyngeal erythema, no erosions. Eyes: Mild periorbital edema, no conjunctivitis. Abdomen: Mild hepatomegaly (liver palpable 3 cm below costal margin), tender. No splenomegaly. No ascites. No pedal edema beyond baseline.",
    "investigations": "CBC: WBC 18,400/μL. Differential: Eosinophils 32% (absolute eosinophil count 5,888/μL — marked eosinophilia), atypical lymphocytes 8% on peripheral smear. Hb 12.6 g/dL, platelets 1,18,000/μL (mild thrombocytopenia). ESR: 68 mm/hr. CRP: 94 mg/L. LFT: AST 486 IU/L, ALT 512 IU/L (>10× ULN), ALP 312 IU/L, GGT 268 IU/L, total bilirubin 3.8 mg/dL, direct bilirubin 2.6 mg/dL — hepatitis pattern. RFT: Creatinine 2.4 mg/dL (up from baseline 1.4 — acute kidney injury), BUN 48 mg/dL. Urine: Protein 2+, RBC casts seen — nephritis. Serum electrolytes: Na+ 134, K+ 5.4. Procalcitonin: 0.8 ng/mL (mild elevation, may be from inflammation rather than bacterial sepsis). Blood cultures: No growth (rules out sepsis). HHV-6 PCR (serum): Positive — HHV-6 reactivation (commonly associated with DRESS). EBV/CMV serology: Negative for acute infection. Hepatitis A, B, C serology: Negative (rules out viral hepatitis). ANA: Negative. Skin biopsy: Interface dermatitis with perivascular lymphocytic infiltrate, scattered eosinophils, spongiosis, and mild keratinocyte necrosis. No full-thickness epidermal necrosis. Consistent with drug reaction. RegiSCAR scoring for DRESS: Hospitalization — yes; Fever >38.5°C — yes (+1); Enlarged lymph nodes ≥2 sites — yes (+1); Eosinophilia >1,500/μL — yes (+1); Atypical lymphocytes — yes (+1); Skin involvement >50% BSA — yes (+1); Skin rash suggesting DRESS — yes (+1); Organ involvement ≥1 (liver + kidney) — yes (+2). Score: 7 — Definite DRESS. HLA-B*58:01 testing: Sent (strongly associated with allopurinol hypersensitivity).",
    "diagnosis": "Drug Reaction with Eosinophilia and Systemic Symptoms (DRESS syndrome) secondary to allopurinol, with hepatitis, nephritis, and HHV-6 reactivation (RegiSCAR score: 7 — definite DRESS)",
    "differentials": ["Acute viral hepatitis with exanthem", "Hypereosinophilic syndrome", "Adult-onset Still disease", "Sezary syndrome (erythrodermic cutaneous T-cell lymphoma)", "Acute generalized exanthematous pustulosis (AGEP)"],
    "learning_points": [
      "DRESS syndrome (also called Drug Hypersensitivity Syndrome / DiHS) has a characteristically long latency period (2-8 weeks) after drug initiation, distinguishing it from other drug reactions; the classic triad is fever, skin eruption (morbilliform > exfoliative), and internal organ involvement (liver most common, followed by kidney, lung, heart, thyroid)",
      "RegiSCAR criteria provide a validated scoring system for DRESS diagnosis: probable (score 4-5) or definite (≥6); key features scored include eosinophilia >1,500/μL or atypical lymphocytes, generalized lymphadenopathy (≥2 sites), and organ involvement (≥1 organ)",
      "Herpesvirus reactivation (HHV-6 most common, also EBV, CMV, HHV-7) is a characteristic immunological feature of DRESS and may contribute to organ damage; HHV-6 reactivation typically occurs 2-3 weeks into the illness and differentiates DRESS from other drug reactions",
      "Allopurinol is the leading cause of DRESS worldwide and in India; HLA-B*58:01 is strongly associated with allopurinol hypersensitivity (DRESS, SJS/TEN) and has a prevalence of 6-8% in South Indian populations — IADVL recommends pre-prescription screening, especially in patients with CKD (reduced renal clearance of oxypurinol increases risk)",
      "Treatment involves immediate drug withdrawal, systemic corticosteroids (prednisolone 1-2 mg/kg/day with slow taper over 8-12 weeks — rapid taper causes relapse), and organ-specific supportive care; DRESS-associated autoimmune sequelae (thyroiditis, type 1 diabetes, autoimmune hemolytic anemia) can develop weeks to months after the acute episode and mandate long-term follow-up",
      "Mortality in DRESS is 5-10%, primarily from hepatic failure or multi-organ dysfunction; the two most important prognostic factors are the degree of hepatic involvement and the extent of renal injury"
    ],
    "india_context": "Allopurinol is widely prescribed in India for gout and hyperuricemia, often without dose adjustment for renal function. The prevalence of HLA-B*58:01 in Indian populations ranges from 6-8% (South India) to 3-4% (North India), making pharmacogenomic screening cost-effective. The IADVL and API (Association of Physicians of India) recommend HLA-B*58:01 testing before starting allopurinol, particularly in patients with CKD. In this case, the starting dose of 300 mg/day was too high for a patient with baseline creatinine of 1.4 — guidelines recommend starting at 100 mg/day (or 50 mg/day with CKD) and titrating gradually. Febuxostat (a non-purine xanthine oxidase inhibitor that does not cross-react) is a safer alternative in HLA-B*58:01 positive patients and is available in India. Awareness of DRESS syndrome among non-dermatologist prescribers (orthopedicians, general physicians) needs improvement, as delayed recognition increases mortality. PvPI (Pharmacovigilance Programme of India) data shows allopurinol among the top drugs implicated in severe cutaneous adverse reactions in India."
  }
]
