[
  {
    "id": "EM-001",
    "title": "Diabetic Ketoacidosis in Newly Diagnosed Type 1 DM",
    "specialty": "emergency",
    "difficulty": "intermediate",
    "source": "JAPI - DKA Management Protocol",
    "demographics": {"age": 16, "gender": "Male", "location": "Jaipur, Rajasthan"},
    "chief_complaint": "Vomiting, abdominal pain, and rapid breathing for 2 days",
    "presentation": "A 16-year-old boy is brought to the ER with vomiting, diffuse abdominal pain, rapid deep breathing, and drowsiness for 2 days. He has had polyuria, polydipsia, and 6 kg weight loss over the past month. His parents thought it was a stomach infection. He has a fruity odor on his breath.",
    "vital_signs": {"bp": "90/55", "hr": 125, "rr": 32, "temp": 37.0, "spo2": 98},
    "history": "Polyuria and polydipsia for 1 month. Weight loss 6 kg. Increased appetite initially, then anorexia for 1 week. Vomiting for 2 days (bilious). Diffuse abdominal pain (may mimic acute abdomen). Rapid deep breathing (Kussmaul). Progressively drowsy. Fruity breath odor. No prior DM diagnosis. No family history of T1DM. No recent illness or steroid use.",
    "physical_exam": "Drowsy (GCS 13). Severe dehydration (sunken eyes, dry mucous membranes, reduced skin turgor, CRT >3 seconds). Kussmaul breathing (deep, rapid, sighing). Fruity/acetone breath odor. Diffuse abdominal tenderness (DKA pseudo-abdomen). Tachycardic, hypotensive. No focal neurological deficit. BMI 16 (underweight).",
    "investigations": "Blood glucose: 480 mg/dL. ABG: pH 7.08, HCO3 6, PaCO2 18 (severe metabolic acidosis with respiratory compensation). Serum ketones: >6 mmol/L (strongly positive). Anion gap: 28 (elevated - anion gap metabolic acidosis). Na+: 128 (pseudohyponatremia - corrected Na+ 135), K+: 5.5 (elevated initially but total body K+ depleted), Creatinine: 1.5 (prerenal AKI). Urine: Ketones 4+, Glucose 4+. HbA1c: 13.5% (indicating weeks-months of uncontrolled DM). C-peptide: 0.1 ng/mL (very low - confirms T1DM). Anti-GAD antibodies: Positive. CBC: WBC 18,000 (stress leucocytosis). Lipase: 280 (mild elevation - DKA can cause pancreatitis).",
    "diagnosis": "Severe diabetic ketoacidosis (DKA) in newly diagnosed Type 1 Diabetes Mellitus",
    "differentials": ["DKA (new-onset T1DM)", "HHS (hyperosmolar hyperglycemic state)", "Alcoholic ketoacidosis", "Starvation ketoacidosis", "Salicylate poisoning", "Uremic acidosis"],
    "learning_points": [
      "DKA triad: Hyperglycemia (>250) + Ketosis + Metabolic acidosis (pH <7.3, HCO3 <18)",
      "Severity: Mild (pH 7.25-7.3), Moderate (7.0-7.24), Severe (<7.0)",
      "Fluid first: 0.9% NS 15-20 mL/kg/hr first hour, then adjust. Total deficit 5-10% body weight",
      "Insulin: IV regular insulin 0.1 U/kg/hr infusion - do NOT bolus in children (cerebral edema risk)",
      "Potassium: Replace if <5.3 mEq/L BEFORE starting insulin (total body K+ is depleted despite normal/high serum K+)",
      "Cerebral edema: Most feared complication in children - headache, bradycardia, altered GCS during treatment"
    ],
    "india_context": "T1DM prevalence in India is increasing. Many patients present in DKA at diagnosis due to delayed recognition. Rural areas often lack blood gas and ketone testing. RSSDI (Research Society for Study of Diabetes in India) publishes DKA management protocols adapted for Indian settings. Insulin is available free under NPCDCS program."
  },
  {
    "id": "EM-002",
    "title": "Sepsis with Multi-Organ Dysfunction - Urosepsis",
    "specialty": "emergency",
    "difficulty": "advanced",
    "source": "ISCCM Guidelines - Sepsis Management India",
    "demographics": {"age": 68, "gender": "Female", "location": "Pune, Maharashtra"},
    "chief_complaint": "High fever, confusion, and low blood pressure",
    "presentation": "A 68-year-old woman with poorly controlled diabetes presents with high fever, rigors, confusion, and hypotension for 24 hours. She has had urinary symptoms (dysuria, frequency) for 5 days which she ignored. She has a recent history of ureteric stent placement for urolithiasis.",
    "vital_signs": {"bp": "75/40", "hr": 128, "rr": 30, "temp": 39.8, "spo2": 90},
    "history": "Dysuria and frequency for 5 days, initially treated with norfloxacin by local doctor. Fever with rigors for 2 days, high-grade. Confusion since morning. Low urine output. Known T2DM for 15 years (HbA1c 10%). Ureteric stent placed 3 weeks ago for right ureteric calculus. Hypertension on amlodipine. Previous UTI 3 months ago (E. coli, fluoroquinolone-resistant). No allergies.",
    "physical_exam": "Confused (GCS 12), febrile, diaphoretic. Warm peripheries initially (warm shock). Tachycardic, hypotensive (MAP 52 mmHg). Suprapubic tenderness. Right renal angle tenderness. Costovertebral angle tenderness right. No meningism. Reduced urine output (100 mL in 12 hours). Mottled skin on knees.",
    "investigations": "qSOFA score: 3/3 (GCS <15, SBP <100, RR ≥22). SOFA score: 12. Blood cultures x 2: E. coli (ESBL-producing, fluoroquinolone-resistant, sensitive to meropenem). Urine culture: E. coli (same resistance pattern). CBC: WBC 22,000 (left shift, toxic granulations), Hb 10, Platelets 65,000 (DIC developing). CRP: 320. Procalcitonin: 45 ng/mL (severely elevated). Lactate: 6.5 mmol/L (>4 = septic shock). ABG: Metabolic acidosis, pH 7.22. Renal: Creatinine 3.5 (baseline 1.2), K+ 5.8. LFT: Bilirubin 3.5, AST 180 (shock liver). INR: 1.8, Fibrinogen low (DIC). RBS: 350. CT KUB: Right hydroureter with stent in situ, perinephric stranding (pyelonephritis), 8mm ureteric calculus.",
    "diagnosis": "Septic shock secondary to obstructive pyelonephritis/urosepsis (ESBL E. coli) with multi-organ dysfunction syndrome (AKI, DIC, metabolic acidosis)",
    "differentials": ["Urosepsis", "Biliary sepsis (cholangitis)", "Pneumonia with sepsis", "Infective endocarditis", "Intra-abdominal abscess", "Meningitis"],
    "learning_points": [
      "Sepsis-3 definition: Life-threatening organ dysfunction caused by dysregulated host response to infection (SOFA ≥2)",
      "Septic shock: Sepsis + vasopressor requirement to maintain MAP ≥65 + lactate >2 despite fluids",
      "Hour-1 bundle: Lactate, blood cultures, broad-spectrum antibiotics, 30 mL/kg crystalloid, vasopressors if needed",
      "ESBL E. coli: Meropenem is first-line for severe infections. Avoid cephalosporins and fluoroquinolones",
      "Source control is essential: Ureteric stent exchange/percutaneous nephrostomy for obstructed infected system",
      "India-specific: High ESBL rates (>70% of E. coli) mandate empiric carbapenem use in severe sepsis from urinary source"
    ],
    "india_context": "India faces a dual burden: high sepsis incidence and extreme antimicrobial resistance. ESBL E. coli exceeds 70% in Indian hospitals. CRE (carbapenem-resistant Enterobacteriaceae) is emerging. ISCCM (Indian Society of Critical Care Medicine) adapts Surviving Sepsis Campaign guidelines for Indian settings. Procalcitonin-guided antibiotic stewardship is recommended."
  },
  {
    "id": "EM-003",
    "title": "Anaphylaxis to Wasp Sting",
    "specialty": "emergency",
    "difficulty": "beginner",
    "source": "JAPI - Anaphylaxis Management",
    "demographics": {"age": 35, "gender": "Male", "location": "Coorg, Karnataka"},
    "chief_complaint": "Sudden breathlessness, rash, and dizziness after wasp sting",
    "presentation": "A 35-year-old coffee plantation worker from Coorg is brought to the rural health center 20 minutes after being stung by a wasp on his right arm. He developed rapid-onset generalized urticaria, facial and lip swelling, wheeze, and dizziness. He has a history of a similar but milder reaction to a bee sting 2 years ago.",
    "vital_signs": {"bp": "70/40", "hr": 135, "rr": 32, "temp": 37.0, "spo2": 86},
    "history": "Stung by wasp 20 minutes ago on right forearm. Within 5 minutes: Itching, generalized urticaria (hives). Within 10 minutes: Lip and tongue swelling, difficulty breathing, voice change (hoarse). Within 15 minutes: Dizziness, feeling faint, nausea. Previous mild reaction to bee sting 2 years ago (local swelling and mild hives only, resolved with antihistamines). No adrenaline auto-injector prescribed. No food allergies. No medications.",
    "physical_exam": "Anxious, tachycardic, hypotensive. Angioedema: Swollen lips, tongue, periorbital edema. Generalized urticaria (raised, erythematous, itchy wheals). Stridor (laryngeal edema). Bilateral wheeze (bronchospasm). Hypotensive with tachycardia. Right forearm: Sting site with local swelling.",
    "investigations": "Clinical diagnosis - no investigations needed before treatment. Serum tryptase: 48 ng/mL (elevated, confirms mast cell degranulation - send within 1-4 hours). IgE to wasp venom: To be done at follow-up (confirms specific allergy).",
    "diagnosis": "Anaphylaxis (Grade III, severe) to Hymenoptera (wasp) venom with anaphylactic shock",
    "differentials": ["Anaphylaxis", "Angioedema (hereditary or ACEi-related)", "Severe asthma", "Vasovagal syncope", "Carcinoid crisis", "Panic attack"],
    "learning_points": [
      "Anaphylaxis is a CLINICAL diagnosis - do NOT delay treatment for investigations",
      "IM Adrenaline (epinephrine) 0.5 mg (1:1000) mid-outer thigh is FIRST-LINE treatment - NOTHING else comes first",
      "Position: Lay flat with legs elevated (unless respiratory distress - then sit up)",
      "Repeat adrenaline every 5-15 minutes if no improvement (up to 3 doses)",
      "Adjuncts: IV fluids (1-2L NS), nebulized salbutamol, IV hydrocortisone, IV chlorpheniramine",
      "Biphasic reaction: Can recur 4-8 hours later - observe for minimum 6-12 hours"
    ],
    "india_context": "Anaphylaxis from Hymenoptera stings is common in plantation workers (coffee, rubber, tea) in South India. Adrenaline auto-injectors are not widely available or affordable in India. IM adrenaline from ampoules is the mainstay. Rural health centers may have limited resuscitation equipment. All patients with anaphylaxis should be referred for allergy testing and prescribed an adrenaline kit."
  },
  {
    "id": "EM-004",
    "title": "Snake Bite - Russell's Viper Envenomation",
    "specialty": "emergency",
    "difficulty": "intermediate",
    "source": "National Snakebite Protocol - India",
    "demographics": {"age": 30, "gender": "Male", "location": "Ramanagara, Karnataka"},
    "chief_complaint": "Snake bite on foot with progressive swelling and bleeding",
    "presentation": "A 30-year-old farmer is brought to the district hospital 2 hours after being bitten by a snake on his right foot while walking through paddy fields at dusk. The snake was identified as a Russell's viper (Daboia russelii) based on a photo taken by a bystander. He has progressive swelling of the right leg, bleeding from the bite site, and blood-stained urine.",
    "vital_signs": {"bp": "90/60", "hr": 110, "rr": 22, "temp": 37.0, "spo2": 95},
    "history": "Bitten 2 hours ago while walking barefoot through paddy field at dusk. Felt sharp pain on right foot. Saw the snake briefly - brown with chain-like pattern (Russell's viper). Applied tourniquet at home (should be removed). Progressive swelling from foot to mid-thigh. Bleeding from bite site and gums. Blood in urine since 30 minutes. Nausea, vomiting. Abdominal pain. No traditional healer treatment. No prior snake bite.",
    "physical_exam": "Anxious, in pain. Right foot: Two fang marks, significant local swelling extending to mid-thigh, ecchymosis, tender. Whole blood clotting test (20-minute WBCT): Non-clotting (positive - confirms coagulopathy). Bleeding from gums and IV sites. Hematuria (dark red urine). No ptosis (no neurotoxicity). No respiratory distress. Blood pressure low.",
    "investigations": "20-minute WBCT: Non-clotting (single most important bedside test in resource-limited settings). CBC: Hb 9.5 (blood loss + hemolysis), Platelets 45,000 (VICC - venom-induced consumption coagulopathy). Coagulation: PT >120 seconds, APTT >180 seconds, Fibrinogen <50 (DIC/VICC). D-dimer: >10,000. Peripheral smear: Schistocytes and spherocytes (microangiopathic hemolytic anemia). Renal: Creatinine 3.8 (AKI from direct nephrotoxicity + hemoglobinuria + myoglobinuria). LDH: 1200 (hemolysis). CPK: 5500 (rhabdomyolysis). Urine: Hemoglobinuria, myoglobinuria. CXR: Normal.",
    "diagnosis": "Russell's viper envenomation with venom-induced consumption coagulopathy (VICC), acute kidney injury, and rhabdomyolysis",
    "differentials": ["Russell's viper envenomation", "Saw-scaled viper (Echis) envenomation", "Hump-nosed pit viper envenomation", "DIC from other causes", "Thrombotic thrombocytopenic purpura", "Hemolytic uremic syndrome"],
    "learning_points": [
      "India's 'Big Four' venomous snakes: Russell's viper, Common cobra, Common krait, Saw-scaled viper",
      "20-minute WBCT: Place 2-5 mL blood in clean glass tube, leave undisturbed for 20 min - if non-clotting, confirms coagulopathy",
      "Anti-snake venom (ASV) polyvalent: 10 vials (100 mL) IV infusion over 1 hour - repeat if WBCT still non-clotting at 6 hours",
      "Russell's viper triad: Coagulopathy + AKI + Local swelling (can also cause neurotoxicity in some regions)",
      "Do NOT: Tourniquet, incision, suction, ice, traditional remedies - all harmful",
      "AKI in Russell's viper: Cortical necrosis, ATN from hemoglobin/myoglobin - may need dialysis"
    ],
    "india_context": "India accounts for ~50% of global snakebite deaths (~58,000/year). Rural farmers walking barefoot at dusk are highest risk. Polyvalent ASV is manufactured by government (Haffkine Institute) and private companies. Available free at PHCs/CHCs. National Snakebite Protocol (NSEP) recommends ASV for any sign of systemic envenomation. Many patients first visit traditional healers, causing delay."
  },
  {
    "id": "EM-005",
    "title": "Acute Poisoning - Aluminum Phosphide (Celphos)",
    "specialty": "emergency",
    "difficulty": "advanced",
    "source": "JAPI - Aluminum Phosphide Poisoning",
    "demographics": {"age": 22, "gender": "Female", "location": "Bathinda, Punjab"},
    "chief_complaint": "Ingested 'Celphos' tablet 2 hours ago",
    "presentation": "A 22-year-old woman from rural Punjab is brought to the ER 2 hours after ingesting one Celphos (aluminum phosphide) tablet with suicidal intent following a family dispute. She presents with vomiting, retrosternal burning, garlic odor on breath, and progressive hypotension. This is a medical emergency with very high mortality.",
    "vital_signs": {"bp": "70/40", "hr": 130, "rr": 28, "temp": 35.5, "spo2": 88},
    "history": "Ingested one Celphos (3g aluminum phosphide) tablet 2 hours ago. Suicidal intent after family dispute (dowry-related harassment by in-laws). Vomited immediately after ingestion (may have reduced absorption). Retrosternal and epigastric burning pain. Progressive dizziness and breathlessness. Family reports garlic-like odor on her breath and in vomitus. No other co-ingestants. Previously healthy. No psychiatric history.",
    "physical_exam": "Agitated, then becoming obtunded. Garlic/fish-like odor on breath. Profound hypotension (refractory to fluids). Tachycardic. Hypothermia (35.5°C). Cold peripheries. Abdomen: Epigastric tenderness. No hepatomegaly. Silver nitrate test on gastric aspirate: Positive (turns black - confirms phosphine gas).",
    "investigations": "Silver nitrate paper test: Positive (gastric aspirate/breath). ECG: Sinus tachycardia, ST-T changes diffuse, widened QRS, prolonged QTc. Serial ECGs show progressive conduction abnormalities. ABG: Severe metabolic acidosis pH 7.02, lactate 12 mmol/L. Blood glucose: 45 (hypoglycemia). Electrolytes: K+ 5.8, Mg2+ 1.0. Renal: Creatinine 2.5 (developing AKI). LFT: AST 500, ALT 400 (hepatic injury). Troponin: 2.5 (myocardial injury). CBC: Hb 14 (hemoconcentration). Methemoglobin: 8%. CXR: Pulmonary edema.",
    "diagnosis": "Acute aluminum phosphide (Celphos) poisoning with multi-organ failure (refractory shock, metabolic acidosis, hepatic and myocardial injury)",
    "differentials": ["Aluminum phosphide poisoning", "Zinc phosphide poisoning", "Organophosphate poisoning", "Acute MI", "Septic shock", "Methanol/ethylene glycol poisoning"],
    "learning_points": [
      "AlP releases phosphine gas (PH3) in stomach - inhibits cytochrome C oxidase (cellular respiration) → same mechanism as cyanide",
      "No specific antidote exists - mortality 40-80% despite best care",
      "Key management: IV NaHCO3 (correct acidosis), IV MgSO4 (membrane stabilizer, antiarrhythmic), aggressive fluid resuscitation, vasopressors (noradrenaline)",
      "Coconut oil/liquid paraffin via NG tube may reduce phosphine absorption (unproven but widely used in India)",
      "Do NOT induce vomiting or gastric lavage with KMnO4 (old practice) - use NaHCO3 lavage",
      "Refractory shock is the usual cause of death - may need VA-ECMO in select cases"
    ],
    "india_context": "AlP (sold as Celphos, Quickphos) is the most common cause of poisoning deaths in North India (Punjab, Haryana, Rajasthan, UP). Used as a grain preservative, freely available in agricultural shops. India's Supreme Court has recommended restricting sale. Punjab has the highest AlP poisoning rates. Dowry harassment and agricultural debt are common precipitants. MgSO4 protocol (Agra protocol) has improved survival."
  },
  {
    "id": "EM-006",
    "title": "Acute Myocardial Infarction with Cardiogenic Shock",
    "specialty": "emergency",
    "difficulty": "advanced",
    "source": "CSI Guidelines - STEMI Management India",
    "demographics": {"age": 55, "gender": "Male", "location": "Nagpur, Maharashtra"},
    "chief_complaint": "Crushing chest pain and collapse",
    "presentation": "A 55-year-old shopkeeper collapses in his shop with crushing chest pain, profuse sweating, and breathlessness. He is brought to the nearest hospital (non-PCI capable, 2 hours from PCI center). He has a history of diabetes and smoking. ECG shows extensive anterior STEMI.",
    "vital_signs": {"bp": "80/50", "hr": 115, "rr": 30, "temp": 36.5, "spo2": 88},
    "history": "Crushing retrosternal chest pain for 1.5 hours, radiating to left arm and jaw. Profuse sweating. Nausea, one episode of vomiting. Progressive breathlessness. Near-syncope. Known T2DM for 10 years (on metformin, glimepiride). Smokes 20 cigarettes/day for 30 years. Family history: Father MI at 50. Known hypertension (on telmisartan). Overweight.",
    "physical_exam": "Cold, clammy, diaphoretic. Altered sensorium (drowsy). Hypotensive, tachycardic. JVP elevated. S3 gallop. Bilateral basal crepitations up to mid-zones (Killip Class III). No murmur (rule out VSR, acute MR). Weak peripheral pulses.",
    "investigations": "ECG: ST elevation V1-V6, I, aVL (extensive anterior STEMI), ST depression II, III, aVF (reciprocal). Q waves developing. Troponin I: 25 ng/mL (markedly elevated). Bedside echo: Anterior and apical akinesis, LVEF 25%, no MR, no VSR, no pericardial effusion, no RV dilation. RBS: 350. Creatinine: 1.3. Lactate: 6 mmol/L.",
    "diagnosis": "Acute extensive anterior STEMI with cardiogenic shock (Killip Class III-IV)",
    "differentials": ["Acute STEMI with cardiogenic shock", "Massive pulmonary embolism", "Aortic dissection", "Tension pneumothorax", "Cardiac tamponade"],
    "learning_points": [
      "STEMI + cardiogenic shock: Primary PCI is the treatment of choice regardless of time delay",
      "If PCI not available within 120 minutes: Thrombolyse (tenecteplase weight-based bolus) and transfer (pharmaco-invasive strategy)",
      "Cardiogenic shock management: Vasopressors (norepinephrine first-line), inotropes (dobutamine), mechanical support (IABP/Impella)",
      "Do NOT give beta-blockers or morphine in cardiogenic shock",
      "Pharmaco-invasive strategy: Thrombolysis → Angiography within 3-24 hours at PCI center",
      "STEMI diagnosis: ST elevation ≥2mm in V1-V3, ≥1mm in other leads, or new LBBB"
    ],
    "india_context": "India has limited PCI-capable hospitals (~600 catheterization labs for 1.4 billion people). The STEMI India and Kerala ACS registry showed only 20-30% of STEMI patients receive timely reperfusion. Pharmaco-invasive strategy (thrombolysis + transfer) is the pragmatic approach for most Indian patients. Tenecteplase is available at district hospitals under NHM. Hub-and-spoke networks are being developed."
  },
  {
    "id": "EM-007",
    "title": "Heat Stroke during Heat Wave",
    "specialty": "emergency",
    "difficulty": "intermediate",
    "source": "NDMA Guidelines - Heat Wave Management",
    "demographics": {"age": 50, "gender": "Male", "location": "Nagpur, Maharashtra"},
    "chief_complaint": "Found unconscious in the street during extreme heat",
    "presentation": "A 50-year-old construction laborer is found unconscious on a road in Nagpur during a May heat wave (ambient temperature 47°C). He was working outdoors without shade or adequate water. Bystanders report he complained of headache and dizziness before collapsing. His skin is hot and dry (not sweating). Core temperature is 41.5°C.",
    "vital_signs": {"bp": "80/50", "hr": 140, "rr": 30, "temp": 41.5, "spo2": 90},
    "history": "Working on construction site since 8 AM under direct sun. No shade breaks. Drinking minimal water (financial constraints). Complained of severe headache, dizziness, and nausea at 2 PM. Collapsed at 2:30 PM. Found by bystanders who called ambulance. No prior heat illness. No medications. Takes no breaks due to daily wage pressure. Heat wave in Nagpur (47°C for past 5 days).",
    "physical_exam": "Unconscious (GCS 6). HOT, DRY skin (anhidrotic heat stroke - sweating has stopped). Core temperature 41.5°C (rectal). Tachycardic, hypotensive. Bilateral plantar extensors. Pupils equal, sluggishly reactive. No focal neurological deficit. No meningism. Skin: No rash. Dry mucous membranes.",
    "investigations": "Core temperature: 41.5°C. CBC: WBC 16,000, Hb 18 (hemoconcentration), Platelets 85,000 (DIC developing). Renal: Creatinine 3.2, K+ 5.8. CPK: 15,000 (severe rhabdomyolysis). LDH: 1200. LFT: AST 800, ALT 600 (heat-related hepatic injury). Coagulation: INR 2.5, Fibrinogen 80, D-dimer elevated (DIC). ABG: Metabolic acidosis, lactate 8. Urine: Dark brown (myoglobinuria). CT brain: No acute findings (rule out stroke/bleed).",
    "diagnosis": "Exertional heat stroke with multi-organ dysfunction (rhabdomyolysis, AKI, DIC, hepatic injury)",
    "differentials": ["Heat stroke", "Meningitis/encephalitis", "Cerebral malaria", "Thyroid storm", "NMS (neuroleptic malignant syndrome)", "Serotonin syndrome", "Status epilepticus"],
    "learning_points": [
      "Heat stroke: Core temperature >40°C + CNS dysfunction (confusion, seizures, coma)",
      "Classic (non-exertional) vs Exertional heat stroke - both are emergencies",
      "COOL FIRST, TRANSPORT SECOND - rapid cooling within 30 minutes saves lives",
      "Best cooling methods: Cold water immersion (gold standard), evaporative cooling (spray water + fan), ice packs to groin/axillae/neck",
      "Target: Reduce core temperature to 39°C within 30 minutes, then to 38.5°C",
      "Complications: Rhabdomyolysis, DIC, AKI, hepatic failure, ARDS, cerebral edema"
    ],
    "india_context": "India experiences devastating heat waves - 2015 Andhra/Telangana heat wave killed >2500 people. Nagpur, Rajasthan, UP, and Telangana are worst affected. Daily wage workers (construction, agriculture) cannot afford to stop working. NDMA has issued heat action plans for vulnerable cities. ICMR recommends: ORS availability at worksites, mandatory shade breaks, early morning work schedules."
  },
  {
    "id": "EM-008",
    "title": "Drowning with Near-Drowning Complications",
    "specialty": "emergency",
    "difficulty": "intermediate",
    "source": "JAPI - Drowning Management",
    "demographics": {"age": 8, "gender": "Male", "location": "Alappuzha, Kerala"},
    "chief_complaint": "Pulled out of backwater canal, not breathing",
    "presentation": "An 8-year-old boy is pulled from a backwater canal in Alappuzha, Kerala after an estimated 3-4 minute submersion. He was playing near the canal unsupervised. Bystanders initiated mouth-to-mouth breathing. On ambulance arrival, he has gasping respirations and is cyanotic.",
    "vital_signs": {"bp": "80/50", "hr": 50, "rr": 6, "temp": 34.5, "spo2": 60},
    "history": "Playing near backwater canal with friends. Fell in at approximately 4 PM. Estimated submersion time 3-4 minutes. Friends called for help. Neighbor pulled him out - not breathing, blue. Bystander initiated mouth-to-mouth breathing. Some water came out. Gasping respirations started. Ambulance arrived in 15 minutes. Freshwater drowning. No known medical conditions. Cannot swim. No seizure history.",
    "physical_exam": "Hypothermic (34.5°C). Cyanotic. Gasping/agonal respirations. Bradycardic (HR 50). GCS 4 (E1V1M2). Bilateral coarse crepitations (pulmonary edema from aspirated water). Frothy sputum from mouth. Distended abdomen (swallowed water). Pupils: Dilated bilaterally but reactive sluggishly.",
    "investigations": "ABG: pH 7.10, PaCO2 60, PaO2 35 (on NRM oxygen), HCO3 14 (mixed respiratory and metabolic acidosis). SpO2: 60% on room air → 82% on 100% NRM. CXR: Bilateral diffuse alveolar infiltrates (pulmonary edema/ARDS). Electrolytes: Na+ 130, K+ 5.2. Blood glucose: 55. Renal: Normal. CBC: Hb 10, WBC 12,000. Lactate: 7. Core temperature: 34.5°C.",
    "diagnosis": "Freshwater drowning with non-fatal submersion injury, pulmonary edema, hypothermia, and hypoxic encephalopathy risk",
    "differentials": ["Drowning (primary)", "Seizure leading to drowning", "Head/spine trauma during diving", "Long QT syndrome triggered by cold water", "Intentional submersion (NAI in children)"],
    "learning_points": [
      "Drowning is the 3rd leading cause of unintentional injury death globally",
      "Key pathology: Aspiration → surfactant washout → alveolar collapse → V/Q mismatch → hypoxemia → multi-organ injury",
      "Freshwater: Hypotonic → rapid alveolar absorption → pulmonary edema. Saltwater: Hypertonic → fluid drawn into alveoli",
      "Treatment: BLS first (rescue breaths are priority over compressions in drowning), then ARDS management protocol",
      "All drowning patients with any symptoms need 24-hour observation (delayed pulmonary edema)",
      "Hypothermia may be protective for brain ('nobody is dead until they are warm and dead')"
    ],
    "india_context": "India reports ~40,000 drowning deaths annually (2nd highest globally). Kerala backwaters, rivers during monsoon, and open wells are major hazards. Children are most vulnerable. ICMR recommends: Swimming training for children, fencing of water bodies, community CPR training. National guidelines for drowning prevention were released in 2021."
  },
  {
    "id": "EM-009",
    "title": "Acute Anaphylaxis from Insect Sting with Epinephrine Management",
    "specialty": "emergency",
    "difficulty": "intermediate",
    "source": "IAA Guidelines - Anaphylaxis Management in India",
    "demographics": {"age": 42, "gender": "Female", "location": "Wayanad, Kerala"},
    "chief_complaint": "Severe breathlessness, throat tightness, and collapse after bee sting",
    "presentation": "A 42-year-old woman who works on a rubber plantation in Wayanad is rushed to the primary health center 15 minutes after being stung by a honeybee on her neck. She rapidly developed throat tightness, generalized hives, wheezing, and collapsed. She reports a previous episode of lip swelling after a bee sting 3 years ago for which she did not seek medical attention. The PHC medical officer must manage the case with limited resources before arranging transfer.",
    "vital_signs": {"bp": "65/35", "hr": 145, "rr": 36, "temp": 36.8, "spo2": 82},
    "history": "Stung by honeybee on right side of neck while tapping rubber tree. Within 3 minutes: Intense pruritus at sting site spreading to entire body. Within 5 minutes: Generalized urticaria, sensation of throat closing, hoarse voice. Within 8 minutes: Severe wheeze, chest tightness, abdominal cramping, nausea. Within 12 minutes: Lightheaded, collapsed, near-syncope. Previous episode 3 years ago: Bee sting on hand caused lip swelling and mild urticaria, self-resolved in 2 hours, no medical care sought. No prescribed epinephrine auto-injector. No history of asthma. No drug allergies. Takes no regular medications. Non-smoker.",
    "physical_exam": "Collapsed, conscious but extremely anxious and distressed. Voice hoarse and barely audible. Generalized erythematous urticarial wheals covering trunk, limbs, and face. Angioedema: Marked periorbital swelling, swollen lips and tongue, uvular edema visible on throat examination. Inspiratory stridor audible without stethoscope. Bilateral diffuse expiratory wheeze. Tachycardic, severely hypotensive (MAP 45 mmHg). Capillary refill time >4 seconds. Right neck: Visible sting site with surrounding erythema and edema spreading down to right clavicle. Abdomen: Diffuse tenderness with hyperactive bowel sounds.",
    "investigations": "Clinical diagnosis - treatment initiated immediately without waiting for investigations. Post-stabilization: Serum tryptase (drawn 1 hour after onset): 85 ng/mL (markedly elevated; normal <11.4 ng/mL, confirms systemic mast cell degranulation). ABG (post first dose epinephrine): pH 7.28, PaCO2 32, PaO2 62, HCO3 18 (mixed metabolic acidosis with respiratory alkalosis). ECG: Sinus tachycardia 145 bpm, no ST changes (rule out Kounis syndrome - allergic acute coronary syndrome). CBC: WBC 14,000 (stress response), Hb 15.5 (hemoconcentration from capillary leak). Blood glucose: 180 (stress hyperglycemia). At follow-up (6 weeks): Specific IgE to honeybee venom (Apis mellifera): 35 kU/L (strongly positive, Class 4). Baseline tryptase: 5.2 ng/mL (normal - rules out mastocytosis).",
    "diagnosis": "Severe anaphylaxis (Grade IV - anaphylactic shock) secondary to Hymenoptera (honeybee) venom with cardiovascular collapse and upper airway compromise",
    "differentials": ["Anaphylaxis (Hymenoptera venom)", "Angioedema (hereditary - C1-esterase inhibitor deficiency)", "Severe acute asthma", "Vocal cord dysfunction", "Vasovagal syncope (but no urticaria/angioedema)", "Carcinoid syndrome", "Systemic mastocytosis with anaphylaxis", "Scombroid fish poisoning"],
    "learning_points": [
      "IM Epinephrine (adrenaline) 0.5 mg of 1:1000 (1 mg/mL) into mid-outer thigh is the FIRST and MOST IMPORTANT treatment - administer IMMEDIATELY upon recognition",
      "Repeat IM epinephrine every 5-15 minutes if no improvement - up to 3 doses. If still refractory, start IV epinephrine infusion (1 mg in 1000 mL NS at 1-10 mcg/min)",
      "Remove stinger by scraping (not squeezing) if visible - honeybee stingers have venom sacs that continue injecting",
      "Airway management is critical: If stridor/angioedema worsening despite epinephrine, prepare for emergency cricothyroidotomy as intubation may be impossible due to laryngeal edema",
      "Refractory anaphylaxis: IV glucagon 1-5 mg for patients on beta-blockers; consider IV methylene blue for vasoplegic shock unresponsive to catecholamines",
      "Biphasic reactions occur in 5-20% of cases (typically 4-12 hours) - mandatory observation period of minimum 12-24 hours for severe reactions",
      "Discharge plan must include: Epinephrine auto-injector prescription, written anaphylaxis action plan, allergy referral for venom immunotherapy (VIT), and medical alert identification"
    ],
    "india_context": "Hymenoptera stings are a leading cause of anaphylaxis in India, particularly among plantation workers (rubber, tea, coffee, coconut) in Kerala, Karnataka, and Tamil Nadu. Honeybee and wasp stings account for most cases. Epinephrine auto-injectors (EpiPen) are not widely available in India and cost Rs 3000-5000 when available, making them unaffordable for most rural workers. PHCs stock epinephrine ampoules (adrenaline 1:1000) at approximately Rs 5 per ampoule, which is the practical mainstay of treatment. The Indian Academy of Allergy (IAA) recommends that all PHCs and CHCs maintain anaphylaxis emergency kits. Venom immunotherapy (VIT) is available at select tertiary centers (CMC Vellore, AIIMS, NIMHANS) but access is limited. ICMR has identified anaphylaxis training for rural healthcare workers as a priority under the National Rural Health Mission."
  },
  {
    "id": "EM-010",
    "title": "Acute Myocardial Infarction in Rural Emergency with Thrombolysis Decision",
    "specialty": "emergency",
    "difficulty": "advanced",
    "source": "CSI-STEMI India Guidelines / Cardiological Society of India",
    "demographics": {"age": 52, "gender": "Male", "location": "Darbhanga, Bihar"},
    "chief_complaint": "Severe chest pain, sweating, and vomiting for 2 hours",
    "presentation": "A 52-year-old male tobacco farmer from a village near Darbhanga, Bihar, is brought to the district hospital emergency department by his family on a motorcycle after 2 hours of severe chest pain, profuse sweating, and repeated vomiting. The nearest PCI-capable center is 180 km away in Patna (estimated transfer time 4-5 hours by road ambulance). The district hospital has ECG, basic labs, and thrombolytic agents available. The emergency physician must decide on thrombolysis versus transfer for primary PCI.",
    "vital_signs": {"bp": "150/95", "hr": 105, "rr": 24, "temp": 36.8, "spo2": 94},
    "history": "Acute onset severe retrosternal crushing chest pain starting 2 hours ago while working in the field. Pain radiates to left arm, left shoulder, and jaw. Associated with profuse diaphoresis, nausea, and 3 episodes of vomiting. Progressive breathlessness. No relief with antacids taken at home. Smokes bidi (15-20/day for 30 years). Chews gutkha for 20 years. Known hypertension for 5 years - takes amlodipine 5 mg irregularly. Not known diabetic but never tested. Father died of 'heart attack' at age 55. Sedentary lifestyle. BMI 28. Diet high in saturated fats and salt. No prior cardiac evaluations. No prior hospitalizations. No history of GI bleeding, recent surgery, or stroke.",
    "physical_exam": "Anxious, diaphoretic, clutching chest. Mildly hypertensive (pain-related sympathetic surge). Tachycardic. JVP not elevated. Heart sounds: S4 gallop, no murmurs. Lungs: Bilateral basal fine crepitations (early Killip Class II). Abdomen: Soft, non-tender. Peripheral pulses: All present and equal (rules out aortic dissection with asymmetric pulses). No pedal edema. No signs of heart failure decompensation.",
    "investigations": "ECG: ST elevation in leads II, III, aVF (≥2 mm), ST elevation in V5-V6 (≥1 mm) - inferior and lateral STEMI. Reciprocal ST depression in I, aVL. No right ventricular involvement (V4R normal). No AV block. Right-sided ECG (V4R): No ST elevation (rules out RV infarction). Troponin I (qualitative rapid kit): Positive. Point-of-care blood glucose: 220 mg/dL (undiagnosed diabetes or stress hyperglycemia). Creatinine (rapid analyzer): 1.1 mg/dL (normal - relevant for contrast use if transferred for PCI). CBC: Hb 14.5, Platelets 2,10,000. Bedside echocardiography (performed by trained emergency physician): Inferior wall hypokinesis, LVEF approximately 40%, no pericardial effusion, no mechanical complications, mild MR. CXR (portable): Mild pulmonary venous congestion, no cardiomegaly.",
    "diagnosis": "Acute inferior and lateral STEMI (Killip Class II) with symptom onset 2 hours ago, presenting to a non-PCI-capable rural hospital requiring thrombolysis decision",
    "differentials": ["Acute STEMI (inferior-lateral)", "Acute aortic dissection (but symmetric pulses, no tearing pain, no mediastinal widening)", "Acute pericarditis (but ST elevation morphology is concave-up in pericarditis, not convex-up as here)", "Acute pulmonary embolism (but no RV strain pattern, no S1Q3T3)", "Boerhaave syndrome (esophageal rupture)", "Acute pancreatitis with referred chest pain"],
    "learning_points": [
      "STEMI time targets: Door-to-balloon (primary PCI) <90 min at PCI center, door-to-needle (thrombolysis) <30 min at non-PCI center. If PCI cannot be achieved within 120 minutes of first medical contact, thrombolyse immediately",
      "Pharmaco-invasive strategy: Thrombolysis at the presenting hospital followed by mandatory transfer to PCI center for angiography within 3-24 hours - this is the recommended strategy for most Indian STEMI patients",
      "Thrombolytic choice: Tenecteplase (weight-based single IV bolus) is preferred over streptokinase due to ease of administration and higher patency rates. Dose: <60 kg: 30 mg, 60-69 kg: 35 mg, 70-79 kg: 40 mg, 80-89 kg: 45 mg, ≥90 kg: 50 mg",
      "Adjunctive therapy with thrombolysis: Aspirin 325 mg chewed, Clopidogrel 300 mg (75 mg if >75 years), Enoxaparin (age-adjusted dosing), high-intensity statin (atorvastatin 80 mg)",
      "Signs of successful reperfusion (within 60-90 min of thrombolysis): >50% resolution of ST elevation, reperfusion arrhythmias (AIVR), chest pain relief, early peak of troponin",
      "Absolute contraindications to thrombolysis: Active bleeding, prior intracranial hemorrhage, ischemic stroke <3 months, cerebral vascular malformation, aortic dissection, significant head trauma <3 months",
      "Failed thrombolysis (<50% ST resolution at 60-90 min): Requires urgent rescue PCI - transfer immediately to PCI center"
    ],
    "india_context": "India faces a massive gap in STEMI care: over 70% of the population lives in rural areas with no access to primary PCI. Only ~600 catheterization labs exist for 1.4 billion people, and most are concentrated in urban centers. The STEMI India registry demonstrated that median symptom-to-door time exceeds 300 minutes due to delayed recognition, transport challenges, and financial barriers. Bihar has among the lowest catheterization lab density in the country. The CSI (Cardiological Society of India) strongly endorses the pharmaco-invasive strategy as the default approach for Indian STEMI patients presenting to non-PCI centers. Tenecteplase is available at district hospitals under the National Health Mission free drug scheme. The 'Mission STEMI India' initiative aims to build hub-and-spoke networks connecting district hospitals to PCI centers via telemedicine for real-time ECG interpretation and thrombolysis guidance. Key barriers include: lack of trained emergency physicians at district hospitals, unreliable ambulance networks (108/112 services vary by state), patient delay due to first contact with traditional healers, and out-of-pocket expenditure for PCI (Rs 1-3 lakhs even in government hospitals). ICMR data shows that tobacco (bidi and gutkha) use is a leading modifiable risk factor for premature MI in Indian men."
  }
]
