[
  {
    "id": "ENDO-001",
    "title": "Thyroid Storm in Graves Disease",
    "specialty": "endocrinology",
    "difficulty": "advanced",
    "source": "JAPI - Thyroid Emergencies",
    "demographics": {"age": 28, "gender": "Female", "location": "Chennai, Tamil Nadu"},
    "chief_complaint": "High fever, palpitations, agitation, and confusion",
    "presentation": "A 28-year-old woman with known but untreated Graves disease presents with sudden high fever (40°C), tachycardia (HR 160), agitation, confusion, and profuse sweating. She stopped her carbimazole 1 month ago on her own. She had a dental extraction 2 days ago (precipitating factor). Burch-Wartofsky score >45 (thyroid storm).",
    "vital_signs": {"bp": "160/70", "hr": 160, "rr": 28, "temp": 40.2, "spo2": 96},
    "history": "Known Graves disease for 1 year, on carbimazole 20mg. Stopped carbimazole 1 month ago (felt well, cost concerns). Dental extraction 2 days ago under local anesthesia. Since yesterday: high fever, palpitations, tremors, agitation, diarrhea (3 episodes). Today: confused, not recognizing family members. Weight loss 8 kg over 3 months. Prior history of exophthalmos.",
    "physical_exam": "Agitated, confused, diaphoretic. Temperature 40.2°C. Tachycardia (160/min, irregularly irregular — AF). Wide pulse pressure (160/70). Exophthalmos bilateral, lid lag, lid retraction. Diffuse non-tender goiter with bruit. Fine tremor. Warm moist skin. Hyperreflexia. Proximal muscle weakness.",
    "investigations": "TSH: <0.01 (suppressed). Free T4: 8.5 ng/dL (markedly elevated, normal 0.8-1.8). Free T3: 22 pg/mL (markedly elevated). TSH receptor antibodies (TRAb): Positive. ECG: Atrial fibrillation with rapid ventricular rate. CBC: WBC 14,000. LFT: AST 120, ALT 95, Bilirubin 2.5 (thyroid-related hepatic dysfunction). Calcium: 11.2 (hypercalcemia). RBS: 220 (hyperglycemia). Burch-Wartofsky score: 55 (>45 = thyroid storm).",
    "diagnosis": "Thyroid storm (thyrotoxic crisis) in Graves disease precipitated by surgery/infection",
    "differentials": ["Thyroid storm", "Sepsis", "Pheochromocytoma crisis", "Malignant hyperthermia", "Neuroleptic malignant syndrome", "Serotonin syndrome"],
    "learning_points": [
      "Thyroid storm is a clinical diagnosis — Burch-Wartofsky score >45 = highly suggestive",
      "Precipitants: Surgery, infection, trauma, iodine load, stopping antithyroid drugs, DKA",
      "Treatment ORDER matters: (1) PTU 200mg q4h (blocks synthesis + T4→T3 conversion), (2) Iodine (Lugol's/SSKI — 1 hour AFTER PTU to block release), (3) Beta-blocker (propranolol), (4) Steroids (hydrocortisone — blocks T4→T3), (5) Cooling + supportive",
      "PTU preferred over carbimazole in storm (blocks peripheral conversion)",
      "Iodine must be given AFTER antithyroid drug (otherwise drives more hormone synthesis — Wolff-Chaikoff escape)",
      "Mortality 10-30% even with treatment"
    ],
    "india_context": "Graves disease is the commonest cause of hyperthyroidism in India. Many patients stop antithyroid drugs prematurely due to cost or feeling well. Iodine excess (iodized salt in previously deficient areas) has increased thyrotoxicosis in some regions. Most district hospitals can manage thyroid storm with PTU + propranolol + steroids."
  },
  {
    "id": "ENDO-002",
    "title": "Myxedema Coma in Elderly",
    "specialty": "endocrinology",
    "difficulty": "advanced",
    "source": "JAPI - Hypothyroid Emergencies",
    "demographics": {"age": 70, "gender": "Female", "location": "Shimla, Himachal Pradesh"},
    "chief_complaint": "Found unresponsive at home during winter",
    "presentation": "A 70-year-old woman is found unresponsive at home by her daughter during a severe winter cold spell in Shimla (temperature -5°C). She has been on levothyroxine for hypothyroidism for 15 years but her daughter suspects she has not been taking her medications. She has hypothermia, bradycardia, and is minimally responsive.",
    "vital_signs": {"bp": "80/50", "hr": 42, "rr": 8, "temp": 33.5, "spo2": 82},
    "history": "Known primary hypothyroidism for 15 years, on levothyroxine 100mcg. Lives alone. Daughter visits weekly. Found unresponsive in unheated room. Daughter noticed she had been increasingly lethargic, constipated, and confused for 2 weeks. Multiple unused levothyroxine strips found (non-compliance for several weeks). Severe cold spell in Shimla (precipitating factor). Also has UTI symptoms (another precipitant).",
    "physical_exam": "Obtunded, GCS 7. Hypothermic (33.5°C). Bradycardic (42/min). Hypotensive (80/50). Puffy face, periorbital edema (non-pitting). Dry, coarse skin. Delayed ankle jerk relaxation (Woltman sign). Macroglossia. Non-pitting edema (myxedema). Hyporeflexia. Hypoventilation (RR 8). Distended abdomen (ileus).",
    "investigations": "TSH: >150 mIU/L (markedly elevated). Free T4: <0.1 ng/dL (undetectable). Free T3: Low. Cortisol: 3 μg/dL (low — check for coexistent adrenal insufficiency before giving thyroxine). CBC: Hb 9.0 (macrocytic anemia), WBC 3,500. Na+: 118 (severe hyponatremia — SIADH). Glucose: 45 (hypoglycemia). CPK: 2500 (hypothyroid myopathy). ABG: Respiratory acidosis, CO2 retention. ECG: Sinus bradycardia, low voltage, prolonged QT. CXR: Pericardial effusion. Urine: UTI (WBC casts, nitrite positive).",
    "diagnosis": "Myxedema coma precipitated by cold exposure, medication non-compliance, and urinary tract infection",
    "differentials": ["Myxedema coma", "Hypothermia (primary)", "Sepsis with hypothermia", "Adrenal crisis", "Opioid overdose", "Severe hyponatremia"],
    "learning_points": [
      "Myxedema coma: Hypothyroidism + altered mental status + precipitating factor = endocrine emergency",
      "Give IV hydrocortisone BEFORE thyroxine (to prevent adrenal crisis in coexistent adrenal insufficiency)",
      "IV levothyroxine loading: 200-300 μg IV bolus, then 50-100 μg/day IV (or via NG if IV not available)",
      "Passive external rewarming ONLY (active warming can cause vasodilation and cardiovascular collapse)",
      "Correct hyponatremia cautiously (risk of osmotic demyelination — max 10 mEq/L in 24 hours)",
      "Mortality 30-60% even with treatment; ICU care essential"
    ],
    "india_context": "Myxedema coma is seen during winter months in North India (Himachal, J&K, Uttarakhand). Elderly women living alone are most vulnerable. Medication non-compliance is common due to financial constraints, forgetfulness, or isolation. IV levothyroxine is not available at most Indian hospitals — NG tube administration of crushed tablets is a practical alternative."
  },
  {
    "id": "ENDO-003",
    "title": "Addisonian Crisis in a Young Woman",
    "specialty": "endocrinology",
    "difficulty": "advanced",
    "source": "Indian Journal of Endocrinology and Metabolism",
    "demographics": {"age": 25, "gender": "Female", "location": "Bengaluru, Karnataka"},
    "chief_complaint": "Severe weakness, vomiting, and collapse",
    "presentation": "A 25-year-old woman presents with acute onset severe weakness, intractable vomiting, abdominal pain, and collapse. She has had progressive fatigue, weight loss, skin darkening, and salt cravings for 6 months but never sought medical attention. She developed a viral gastroenteritis 2 days ago which precipitated this crisis.",
    "vital_signs": {"bp": "70/40", "hr": 120, "rr": 22, "temp": 37.8, "spo2": 94},
    "history": "Acute: Vomiting for 2 days (initially from gastroenteritis), progressive weakness, dizziness, near-syncope. Chronic (6 months): Progressive fatigue, weight loss 7 kg, generalized skin darkening (especially palms, knuckles, buccal mucosa), salt cravings, postural dizziness. Missed periods for 3 months (amenorrhea). No TB treatment history. No steroid use. Viral gastroenteritis in family members (precipitating factor).",
    "physical_exam": "Hypotensive (70/40), tachycardic, dehydrated. Generalized hyperpigmentation — palmar creases, knuckles, elbows, buccal mucosa (pathognomonic). No vitiligo. Axillary and pubic hair: Sparse (loss of adrenal androgens in women). Abdominal tenderness diffuse. No meningism.",
    "investigations": "8 AM cortisol: 1.2 μg/dL (severely low, normal >18). ACTH: 850 pg/mL (markedly elevated — primary adrenal insufficiency). Short Synacthen test: Cortisol fails to rise above 18 after ACTH stimulation. Na+: 118 (hyponatremia). K+: 6.2 (hyperkalemia). Glucose: 45 (hypoglycemia). Calcium: 11.0 (mild hypercalcemia). CBC: Eosinophilia 8%. TSH: 8.5 (may have coexistent autoimmune thyroiditis). Anti-21-hydroxylase antibodies: Positive (autoimmune adrenalitis). CT adrenals: Small bilateral adrenals (atrophied). CXR: Small heart (chronic volume depletion).",
    "diagnosis": "Addisonian crisis (acute adrenal insufficiency) due to autoimmune adrenalitis, precipitated by acute gastroenteritis",
    "differentials": ["Adrenal crisis", "Septic shock", "Anaphylaxis", "Hypovolemic shock (GI losses)", "Pheochromocytoma crisis (paradoxical hypotension)", "Adrenal hemorrhage (Waterhouse-Friderichsen)"],
    "learning_points": [
      "Addison disease electrolyte pattern: Hyponatremia + Hyperkalemia + Hypoglycemia + Hypercalcemia",
      "Hyperpigmentation (ACTH → MSH stimulation of melanocytes) = primary adrenal insufficiency, NOT secondary",
      "Treatment of crisis: IV hydrocortisone 100mg STAT then 50mg q6-8h + IV NS resuscitation + dextrose for hypoglycemia",
      "Do NOT wait for investigation results — treat empirically if clinical suspicion",
      "Maintenance: Hydrocortisone 15-20 mg/day (divided) + Fludrocortisone 0.05-0.1 mg/day",
      "Sick day rules: Double steroid dose during illness, IM hydrocortisone if vomiting, emergency injection training"
    ],
    "india_context": "Autoimmune adrenalitis is overtaking TB as the commonest cause of Addison's in urban India. In rural India, TB remains common. All Addison patients in India should have TB workup (CT adrenals for calcification, QuantiFERON). Steroid emergency cards and MedicAlert bracelets are underutilized in India."
  },
  {
    "id": "ENDO-004",
    "title": "Pheochromocytoma with Hypertensive Crisis",
    "specialty": "endocrinology",
    "difficulty": "advanced",
    "source": "JAPI - Secondary Hypertension",
    "demographics": {"age": 35, "gender": "Male", "location": "Pune, Maharashtra"},
    "chief_complaint": "Episodic headache, palpitations, and sweating with very high BP",
    "presentation": "A 35-year-old IT professional presents with recurrent episodes of severe headache, palpitations, profuse sweating, and anxiety lasting 15-30 minutes occurring 3-4 times per week for 6 months. During one such episode, his BP was found to be 240/140. Between episodes, he feels relatively normal. He was referred for evaluation of resistant hypertension.",
    "vital_signs": {"bp": "240/140", "hr": 130, "rr": 24, "temp": 37.8, "spo2": 97},
    "history": "Episodic symptoms for 6 months: Severe throbbing headache + palpitations + drenching sweats + pallor + anxiety (classic triad + pallor). Episodes triggered by exercise, bending, straining, abdominal palpation. Duration 15-30 minutes. Between episodes: BP 140/90 on 3 antihypertensives (including beta-blocker which worsened episodes). Weight loss 5 kg. Tremor during episodes. Family history: Father had thyroid surgery (? MEN2).",
    "physical_exam": "During episode: Extremely hypertensive (240/140), tachycardic, pale (NOT flushed — vasoconstriction), diaphoretic, tremulous. Pupils dilated. Abdomen: No palpable mass (but palpation can trigger paroxysm — examine carefully). No café-au-lait spots. No mucosal neuromas. Thyroid: Not enlarged.",
    "investigations": "24-hour urine metanephrines: Normetanephrine 5500 μg (markedly elevated, normal <900). Plasma free metanephrines: Markedly elevated. 24-hour urine catecholamines: Norepinephrine 1200 μg (elevated). CT abdomen: 5 cm right adrenal mass, heterogeneous, with central necrosis (classic). MIBG scan: Avid uptake in right adrenal mass, no extra-adrenal disease. Genetic testing: RET proto-oncogene negative (rules out MEN2). Calcium, PTH, calcitonin: Normal. CBC: Polycythemia (EPO effect).",
    "diagnosis": "Pheochromocytoma (right adrenal) with hypertensive crisis",
    "differentials": ["Pheochromocytoma", "Essential hypertension (resistant)", "Renovascular hypertension", "Cushing syndrome", "Hyperthyroidism", "Panic disorder", "Carcinoid syndrome"],
    "learning_points": [
      "Classic paroxysmal triad: Headache + Palpitations + Sweating (present in 90% of pheo)",
      "Pallor during episodes (NOT flushing) due to catecholamine-mediated vasoconstriction",
      "Plasma free metanephrines have highest sensitivity (96-100%) — best screening test",
      "Alpha-blocker (phenoxybenzamine) must be started 10-14 days BEFORE surgery",
      "NEVER give beta-blocker alone (unopposed alpha causes hypertensive crisis) — always alpha-block first",
      "Rule of 10s (outdated but educational): 10% bilateral, 10% extra-adrenal, 10% malignant, 10% familial"
    ],
    "india_context": "Pheochromocytoma accounts for 0.1-0.5% of hypertension in India but is important to identify as it's curable. Under-recognized in India — many patients undergo years of antihypertensive treatment before diagnosis. Phenoxybenzamine availability in India can be challenging (imported drug). Laparoscopic adrenalectomy is available at most tertiary centers."
  },
  {
    "id": "ENDO-005",
    "title": "Diabetic Foot with Charcot Neuroarthropathy",
    "specialty": "endocrinology",
    "difficulty": "intermediate",
    "source": "RSSDI Guidelines - Diabetic Foot",
    "demographics": {"age": 55, "gender": "Male", "location": "Lucknow, UP"},
    "chief_complaint": "Painless swollen red foot with deformity",
    "presentation": "A 55-year-old man with poorly controlled T2DM for 20 years presents with a swollen, red, warm left foot for 3 weeks. Remarkably, he has minimal pain despite the dramatic appearance. He has peripheral neuropathy (cannot feel monofilament). His foot has developed a 'rocker-bottom' deformity. He was initially treated for cellulitis with antibiotics without improvement.",
    "vital_signs": {"bp": "140/85", "hr": 80, "rr": 16, "temp": 37.5, "spo2": 98},
    "history": "Known T2DM for 20 years, HbA1c 10.5%. On insulin but irregular. Swollen, red, warm left foot for 3 weeks. Minimal pain (neuropathy). Initially treated as cellulitis — 2 courses of antibiotics, no improvement. No ulcer. No trauma recalled. Foot has 'changed shape'. Cannot feel temperature or pinprick on feet. History of plantar ulcer on right foot 2 years ago (healed). No claudication symptoms.",
    "physical_exam": "Left foot: Erythematous, edematous, warm (>2°C warmer than right foot by infrared thermometry). Rocker-bottom deformity (collapsed midfoot arch). Bony prominences palpable. No ulcer currently but skin thinned over prominences (at risk). Peripheral pulses: Present bilaterally (not ischemic). Neuropathy: 10g monofilament sensation absent bilateral feet, vibration absent at ankles, absent ankle reflexes.",
    "investigations": "X-ray left foot: Fractures and dislocations of tarsometatarsal joints, joint destruction, debris, subluxation (Charcot changes). MRI foot: Marrow edema, fractures, joint effusions, NO soft tissue abscess. HbA1c: 10.5%. WBC: 8,000 (normal — not infected). CRP: 30 (mild elevation — inflammation, not infection). Blood cultures: Negative. ABI (ankle-brachial index): 1.1 bilateral (normal — adequate blood supply). Monofilament test: Absent sensation at 4/10 sites bilateral.",
    "diagnosis": "Acute Charcot neuroarthropathy (Charcot foot) — neuropathic osteoarthropathy in diabetic peripheral neuropathy",
    "differentials": ["Charcot neuroarthropathy", "Cellulitis/soft tissue infection", "Osteomyelitis", "Gout/pseudogout", "Deep vein thrombosis", "Fracture (traumatic)"],
    "learning_points": [
      "Charcot foot: Hot, swollen, red foot + neuropathy + minimal pain = think Charcot, NOT cellulitis",
      "Key differentiator from infection: Temperature difference >2°C, normal WBC, no ulcer/sinus, blood cultures negative",
      "Pathogenesis: Neuropathy → unrecognized micro-trauma → inflammatory cascade → bone destruction → deformity",
      "Treatment: Total contact casting (TCC) or offloading boot — immobilization is essential to prevent deformity",
      "DO NOT operate on acute Charcot (worsens destruction) — wait for consolidation phase",
      "Prevention: Annual foot screening with monofilament, patient education, therapeutic footwear"
    ],
    "india_context": "India has 77 million diabetics and diabetic foot is the leading cause of non-traumatic amputation. 85% of amputations are preventable with early detection. Charcot foot is under-recognized — often misdiagnosed as cellulitis. RSSDI recommends annual foot examination for all diabetics. Therapeutic footwear is subsidized under some government programs."
  },
  {
    "id": "ENDO-006",
    "title": "Cushing Syndrome — Adrenal Adenoma",
    "specialty": "endocrinology",
    "difficulty": "advanced",
    "source": "Indian Journal of Endocrinology and Metabolism",
    "demographics": {"age": 38, "gender": "Female", "location": "Mumbai, Maharashtra"},
    "chief_complaint": "Weight gain, purple stretch marks, and easy bruising for 1 year",
    "presentation": "A 38-year-old bank manager presents with central obesity, moon facies, purple striae on abdomen, proximal muscle weakness, easy bruising, and newly diagnosed diabetes and hypertension over the past year. She has also developed acne, facial hair, and amenorrhea. She denies any steroid use.",
    "vital_signs": {"bp": "160/100", "hr": 80, "rr": 16, "temp": 37.0, "spo2": 98},
    "history": "Progressive weight gain (15 kg in 1 year) — predominantly truncal/central. Moon facies noticed by family. Wide purple striae on abdomen and thighs. Easy bruising from minor trauma. Proximal muscle weakness (difficulty climbing stairs, rising from chair). Acne and facial hair (hirsutism). Amenorrhea for 6 months. Newly diagnosed T2DM and hypertension. Mood changes: depression, insomnia. Back pain. No exogenous steroid use (most important question to ask). No ACTH-secreting pituitary symptoms.",
    "physical_exam": "Central obesity (BMI 32), thin extremities. Moon facies, plethora. Dorsocervical fat pad (buffalo hump). Supraclavicular fat pads. Wide (>1 cm) violaceous (purple) striae on abdomen, thighs. Easy bruisability. Hirsutism (Ferriman-Gallwey score 16). Acne. Proximal muscle weakness (grade 4/5). Thin fragile skin. Hypertension.",
    "investigations": "24-hour urine free cortisol: 680 μg (4x upper limit, normal <50). Late-night salivary cortisol: 1.2 μg/dL (elevated, normal <0.15). Overnight 1mg dexamethasone suppression test: Cortisol 18 μg/dL (not suppressed, normal <1.8). ACTH: <5 pg/mL (suppressed — ACTH-independent = adrenal source). High-dose dexamethasone suppression: Not suppressed (adrenal, not pituitary). CT adrenals: 3.5 cm left adrenal adenoma, smooth margins, lipid-rich (<10 HU). Contralateral adrenal: Atrophic. HbA1c: 8.2%. Lipids: Dyslipidemia. DEXA: Osteoporosis (lumbar T-score -3.2).",
    "diagnosis": "ACTH-independent Cushing syndrome due to left adrenal cortisol-secreting adenoma",
    "differentials": ["Adrenal adenoma (Cushing)", "Cushing disease (pituitary ACTH-secreting adenoma)", "Ectopic ACTH syndrome (lung carcinoid, SCLC)", "Adrenal carcinoma", "Pseudo-Cushing (depression, alcoholism, obesity)", "Exogenous steroid use (iatrogenic — most common cause overall)"],
    "learning_points": [
      "Step 1: Confirm Cushing (urine free cortisol, overnight DST, late-night salivary cortisol — need 2 positive)",
      "Step 2: ACTH level — Low (<5) = adrenal source; Normal/High = pituitary or ectopic",
      "Step 3: Imaging — CT adrenals for adrenal source; MRI pituitary for ACTH-dependent",
      "Purple striae >1 cm and proximal myopathy are highly specific for Cushing (not seen in simple obesity)",
      "Treatment for adrenal adenoma: Laparoscopic adrenalectomy (curative)",
      "Postoperative: Need steroid replacement (contralateral adrenal is suppressed/atrophied) — taper over months"
    ],
    "india_context": "Cushing syndrome is often diagnosed late in India — patients may be treated for diabetes, hypertension, and PCOS for years before the unifying diagnosis is made. Endogenous Cushing is rare (~2-3 per million/year). Iatrogenic Cushing from indiscriminate steroid use (especially depot injections from unqualified practitioners) is far more common in India."
  },
  {
    "id": "ENDO-007",
    "title": "Hyperosmolar Hyperglycemic State (HHS)",
    "specialty": "endocrinology",
    "difficulty": "intermediate",
    "source": "RSSDI Guidelines - Hyperglycemic Emergencies",
    "demographics": {"age": 68, "gender": "Male", "location": "Ahmedabad, Gujarat"},
    "chief_complaint": "Confusion, excessive thirst, and very high blood sugar",
    "presentation": "A 68-year-old man with known T2DM is brought in with progressive confusion, excessive thirst, and polyuria for 5 days. He had a UTI treated at home and became increasingly dehydrated. His blood glucose is 850 mg/dL but he has no ketoacidosis. He is severely dehydrated with altered sensorium.",
    "vital_signs": {"bp": "85/50", "hr": 115, "rr": 18, "temp": 38.5, "spo2": 95},
    "history": "Known T2DM for 15 years on metformin + glimepiride. UTI 1 week ago — treated with oral antibiotics. Progressively increased thirst and urination over 5 days. Reduced oral intake. Family noted confusion and drowsiness for 2 days. Unable to walk since yesterday. No vomiting. No abdominal pain. No fruity breath odor.",
    "physical_exam": "Severely dehydrated (dry mucous membranes, sunken eyes, poor skin turgor, CRT >4 seconds). Altered sensorium (GCS 10). Tachycardic, hypotensive. No Kussmaul breathing (unlike DKA). No fruity breath. Focal neurological signs: Left hemiparesis (stroke-mimic from hyperosmolarity). Seizure risk.",
    "investigations": "Blood glucose: 850 mg/dL. Serum osmolality: 380 mOsm/kg (>320 = severe hyperosmolarity). pH: 7.32 (no significant acidosis — pH >7.3). HCO3: 20 (>18 — no anion gap acidosis). Ketones: Trace (no significant ketonemia). Na+: 155 (corrected Na+ even higher). BUN: 85, Creatinine: 3.5 (prerenal AKI from severe dehydration). Urine: Glucose 4+, trace ketones. Urine culture: E. coli (UTI). Calculated free water deficit: ~9 liters.",
    "diagnosis": "Hyperosmolar Hyperglycemic State (HHS) precipitated by UTI with severe dehydration and hyperosmolarity",
    "differentials": ["HHS", "DKA", "Stroke (HHS can mimic stroke)", "Sepsis with hyperglycemia", "Hyperosmolar hyponatremia", "Non-ketotic hyperosmolar coma"],
    "learning_points": [
      "HHS: Glucose >600, Osmolality >320, pH >7.3, minimal ketones — distinct from DKA",
      "HHS has HIGHER mortality than DKA (5-20% vs 1-5%) due to older age and comorbidities",
      "Fluid deficit is massive (8-12 liters) — start with NS 1-2 L/hr first, then half-NS",
      "Insulin dose is LOWER than DKA (0.05 U/kg/hr) — fluid alone drops glucose significantly",
      "Focal neurological signs (hemiparesis, seizures) are common and resolve with correction — do NOT thrombolyse",
      "Precipitant must be identified and treated (infection is the commonest — UTI, pneumonia)"
    ],
    "india_context": "HHS is increasingly common in India's growing elderly diabetic population. Many patients present late due to delayed recognition. UTI is the most common precipitant. Mortality is high due to presentation in advanced state. RSSDI recommends HHS protocol availability at all hospitals managing diabetic emergencies."
  },
  {
    "id": "ENDO-008",
    "title": "Prolactinoma with Visual Field Defects",
    "specialty": "endocrinology",
    "difficulty": "intermediate",
    "source": "Indian Journal of Endocrinology",
    "demographics": {"age": 30, "gender": "Female", "location": "Hyderabad, Telangana"},
    "chief_complaint": "Amenorrhea, milky discharge from breasts, and headache",
    "presentation": "A 30-year-old married woman presents with amenorrhea for 18 months, bilateral milky nipple discharge (galactorrhea), headaches, and recent difficulty with peripheral vision. She has been evaluated for infertility. She is not on any medications known to cause hyperprolactinemia.",
    "vital_signs": {"bp": "110/70", "hr": 72, "rr": 16, "temp": 37.0, "spo2": 99},
    "history": "Amenorrhea for 18 months (previously regular). Bilateral milky nipple discharge for 1 year. Headaches for 6 months (bitemporal, worsening). Difficulty seeing objects on the sides (peripheral vision loss). Infertility: Married 3 years, trying to conceive, no success. Decreased libido. No medications (antipsychotics, metoclopramide, OCPs). No chest wall surgery. No hypothyroidism symptoms.",
    "physical_exam": "Bilateral galactorrhea (expressible milky discharge). Visual fields: Bitemporal hemianopia on confrontation testing. No papilledema. No acromegalic features. No Cushing features. Thyroid: Normal. No focal neurological deficit.",
    "investigations": "Prolactin: 850 ng/mL (markedly elevated; normal <25 in women. >200 is virtually diagnostic of macroprolactinoma). TSH: 3.5 (normal — rules out hypothyroidism). FSH/LH: Low (hypogonadotropic hypogonadism from hyperprolactinemia). Estradiol: Low. Pregnancy test: Negative. MRI pituitary with gadolinium: 2.5 cm pituitary macroadenoma (>10mm = macroadenoma), compressing optic chiasm (explains bitemporal hemianopia), extension into cavernous sinus. Formal perimetry: Bitemporal hemianopia confirmed. Other pituitary hormones: GH, ACTH, cortisol — normal.",
    "diagnosis": "Macroprolactinoma (pituitary macroadenoma secreting prolactin) with chiasmal compression and bitemporal hemianopia",
    "differentials": ["Prolactinoma", "Non-functioning pituitary adenoma with stalk effect", "Drug-induced hyperprolactinemia", "Hypothyroidism", "Pregnancy/lactation", "Craniopharyngioma"],
    "learning_points": [
      "Prolactin level correlates with tumor size: >200 = macroprolactinoma; 25-200 = microprolactinoma or stalk effect",
      "Stalk effect: Any sellar mass compressing the stalk raises prolactin to 25-150 (not >200) — important distinction",
      "Treatment: Cabergoline (first-line, even for macroadenomas) — NOT surgery. Shrinks tumor + normalizes prolactin",
      "Surgery only if: Drug intolerant, resistant, CSF leak, or apoplexy",
      "Bitemporal hemianopia: Optic chiasm compression — classic for pituitary tumors",
      "Fertility restoration: Prolactin normalization restores ovulation — pregnancy possible on cabergoline"
    ],
    "india_context": "Prolactinomas are the commonest functioning pituitary tumors. Often diagnosed during infertility workup in Indian women. Cabergoline is affordable (generic available). Many patients are unnecessarily referred for surgery when medical management is curative. MRI pituitary with thin cuts through sella should be the standard imaging."
  },
  {
    "id": "ENDO-009",
    "title": "Primary Hyperparathyroidism with Renal Stones",
    "specialty": "endocrinology",
    "difficulty": "intermediate",
    "source": "IJEM - Hyperparathyroidism in India",
    "demographics": {"age": 48, "gender": "Female", "location": "Delhi"},
    "chief_complaint": "Recurrent kidney stones, bone pains, and fatigue",
    "presentation": "A 48-year-old homemaker presents with recurrent calcium kidney stones (3 episodes in 2 years), diffuse bone pains, fatigue, constipation, and depression. Calcium was incidentally found elevated (12.5 mg/dL) on blood work. The classic mnemonic applies: 'Stones, bones, groans, and psychiatric moans.'",
    "vital_signs": {"bp": "135/85", "hr": 78, "rr": 16, "temp": 37.0, "spo2": 98},
    "history": "Recurrent renal colic: 3 episodes in 2 years, calcium stones. Diffuse bone pains (back, hips, knees). Proximal muscle weakness. Chronic constipation. Polyuria and polydipsia. Fatigue, poor concentration, depression. Discovered incidentally: Calcium 12.5 on routine blood work. No family history of MEN. No lithium use. No immobilization.",
    "physical_exam": "Mild bony tenderness (spine, pelvis). Proximal muscle weakness (grade 4/5). Mild dehydration. No neck mass. No abdominal mass. Band keratopathy (calcium deposits in cornea — slit lamp finding).",
    "investigations": "Calcium: 12.5 mg/dL (elevated). Phosphate: 1.8 mg/dL (low). iPTH: 285 pg/mL (elevated — inappropriately elevated for high calcium). Vitamin D: 18 ng/mL (low — correct before surgery). 24-hour urine calcium: 380 mg (elevated — rules out FHH). Creatinine: 1.0, eGFR 72. ALP: 180 (elevated — bony turnover). CT KUB: Right renal calculus 6mm. DEXA: Osteoporosis at distal radius (T-score -3.0) — cortical bone loss typical of PHPT. Sestamibi scan: Right inferior parathyroid adenoma (focal uptake). USG neck: 1.5 cm hypoechoic nodule posterior to right thyroid lobe.",
    "diagnosis": "Primary hyperparathyroidism due to parathyroid adenoma with nephrolithiasis and osteoporosis",
    "differentials": ["Primary hyperparathyroidism (adenoma)", "Familial hypocalciuric hypercalcemia (FHH)", "Malignancy-associated hypercalcemia (PTHrP)", "Vitamin D excess", "Sarcoidosis", "Multiple myeloma"],
    "learning_points": [
      "'Stones, bones, abdominal groans, and psychiatric moans' — classic PHPT mnemonic",
      "PTH elevated + Calcium elevated = primary hyperparathyroidism (PTH should be suppressed if calcium is high)",
      "24-hour urine calcium is essential to distinguish from FHH (low urine calcium in FHH)",
      "Surgery (parathyroidectomy) is curative — indicated if: symptomatic, Ca >1 above normal, osteoporosis, eGFR <60, age <50, stones",
      "Correct vitamin D deficiency BEFORE surgery (low vitamin D stimulates PTH, masking the adenoma)",
      "Single adenoma (85%) vs multigland hyperplasia (15%) vs carcinoma (<1%)"
    ],
    "india_context": "PHPT is increasingly diagnosed in India with wider availability of calcium and PTH testing. Indian PHPT patients present with more severe bone disease (osteitis fibrosa cystica) compared to Western patients. Vitamin D deficiency is rampant in India (70-90%) and may mask PHPT. Parathyroid surgery requires experienced surgeons — available at select tertiary centers."
  },
  {
    "id": "ENDO-010",
    "title": "Type 1 Diabetes — Honeymoon Phase Confusion",
    "specialty": "endocrinology",
    "difficulty": "beginner",
    "source": "RSSDI - Type 1 Diabetes India",
    "demographics": {"age": 14, "gender": "Female", "location": "Kochi, Kerala"},
    "chief_complaint": "Previously insulin-dependent, now having frequent hypoglycemia on same dose",
    "presentation": "A 14-year-old girl diagnosed with T1DM 3 months ago (presented in DKA, started on insulin) is now experiencing frequent hypoglycemic episodes despite being on the same insulin dose. Her parents are confused and wonder if the diabetes diagnosis was wrong. Her insulin requirement has dropped from 0.8 to 0.2 U/kg/day.",
    "vital_signs": {"bp": "100/60", "hr": 72, "rr": 16, "temp": 37.0, "spo2": 99},
    "history": "Diagnosed T1DM 3 months ago after DKA (GAD antibodies positive, C-peptide low). Started on basal-bolus insulin. Initial insulin dose: 0.8 U/kg/day. Over past month: frequent hypoglycemia (blood glucose 40-60 mg/dL, 3-4 times/week). Insulin reduced to 0.2 U/kg/day. HbA1c improved dramatically from 13% to 6.5%. Parents questioning diagnosis. No dietary changes. No excessive exercise.",
    "physical_exam": "Well-appearing, healthy. Growth chart: Normal. No signs of hypothyroidism or celiac disease (associated autoimmune conditions). No lipohypertrophy at injection sites. Injection technique verified — appropriate.",
    "investigations": "HbA1c: 6.5% (excellent). Fasting C-peptide: 1.2 ng/mL (DETECTABLE — was 0.1 at diagnosis). Fasting glucose: 95 mg/dL. GAD antibodies: Still positive (confirming T1DM diagnosis). IA-2 antibodies: Positive. Random glucose monitoring: Wide variability (40-200). Insulin requirement: 0.2 U/kg/day (reduced). TSH: Normal. tTG-IgA: Negative (rules out celiac).",
    "diagnosis": "Type 1 Diabetes Mellitus in honeymoon phase (partial remission) — NOT misdiagnosis",
    "differentials": ["T1DM honeymoon phase", "Misdiagnosed T2DM", "MODY (Maturity Onset Diabetes of the Young)", "Factitious hypoglycemia (exogenous insulin)", "Insulinoma", "Adrenal insufficiency causing hypoglycemia"],
    "learning_points": [
      "Honeymoon phase: Partial remission occurring weeks-months after T1DM diagnosis, lasting months to 1-2 years",
      "Residual beta-cell function recovers transiently after DKA treatment → less insulin needed",
      "Total insulin <0.5 U/kg/day AND HbA1c <7% = partial remission (IDAA criteria: HbA1c + 4×insulin dose <9)",
      "DO NOT stop insulin completely — even small doses preserve residual beta-cell function longer",
      "Parents must understand: This is temporary. Beta-cell destruction continues. Full insulin dependence will return",
      "Screen for associated autoimmune conditions: Thyroid (TSH annually), Celiac (tTG-IgA)"
    ],
    "india_context": "T1DM incidence in India is ~3-5 per 100,000/year (lower than West but rising). The honeymoon phase leads to diagnostic confusion — parents may stop insulin, leading to recurrent DKA. RSSDI recommends not stopping insulin during honeymoon. Continuous glucose monitoring (CGM) is becoming available but cost-prohibitive for most Indian families. Insulin is available free under NPCDCS."
  },
  {
    "id": "ENDO-011",
    "title": "Diabetic Ketoacidosis with 'Terrible Triad' and Seizures",
    "specialty": "endocrinology",
    "difficulty": "advanced",
    "source": "PMC 10500620 - DKA Complications Case Report 2023",
    "demographics": {"age": 17, "gender": "Male", "location": "Western India"},
    "chief_complaint": "Abdominal pain, headaches, lethargy, and Kussmaul breathing",
    "presentation": "A 17-year-old male from western India presents with severe abdominal pain, headaches for two days, progressive lethargy, and characteristic Kussmaul breathing (deep, rapid respiration). He was previously undiagnosed for diabetes and presents in severe diabetic ketoacidosis complicated by the 'terrible triad' of DKA, severe hypertriglyceridemia, and acute pancreatitis.",
    "vital_signs": {"bp": "not specified", "hr": "elevated", "rr": "Kussmaul pattern", "temp": "not specified", "spo2": "not specified"},
    "history": "Two days of progressively worsening abdominal pain and severe headaches. Increasing lethargy and decreased oral intake. No known prior diabetes diagnosis. Presenting in severe metabolic decompensation. No history of alcohol use. Family history not detailed. Rapid onset of symptoms suggesting first presentation of type 1 diabetes mellitus. Progressive neurological deterioration during initial management.",
    "physical_exam": "Severely ill appearance with Glasgow Coma Scale of 4 (E1M2V1) indicating profound encephalopathy. Kussmaul breathing pattern (deep, labored respiration attempting to compensate for metabolic acidosis). Signs of severe dehydration. Abdominal tenderness consistent with pancreatitis. Evidence of developing generalized seizures. Neurological examination showed diffuse dysfunction. Clinical evidence of multi-organ involvement.",
    "investigations": "Fingerstick glucose: >500 mg/dL. Arterial blood gas: pH 6.9 (severe metabolic acidosis), PaCO2 21 mmHg (compensatory respiratory alkalosis), Bicarbonate 4 mM/L (profound deficit). Serum triglycerides: 25,585 mg/dL (extremely elevated, >20 times normal). Serum amylase: 394 U/L (elevated, confirming pancreatitis). Serum acetone: 72 mmol/L (very high ketone levels). Creatinine: 1.8 mg/dL (acute kidney injury). Imaging: MRI brain showed small non-hemorrhagic midbrain infarct (likely embolic from severe hypertriglyceridemia). Lipid panel: Profoundly abnormal with milky serum appearance.",
    "diagnosis": "Type 1 Diabetes Mellitus presenting as severe diabetic ketoacidosis complicated by 'Terrible Triad' (DKA + hypertriglyceridemia + acute pancreatitis), generalized seizures, acute kidney injury, encephalopathy, and midbrain infarct",
    "differentials": ["DKA with pancreatitis", "Acute pancreatitis from other cause with secondary hyperglycemia", "Hyperosmolar hyperglycemic state", "Sepsis with metabolic acidosis", "Inborn errors of metabolism", "Toxic ingestion"],
    "learning_points": [
      "'Terrible Triad' = DKA + Severe Hypertriglyceridemia (>1000 mg/dL) + Acute Pancreatitis - rare but life-threatening",
      "Severe hypertriglyceridemia (>1000 mg/dL) is a cause of acute pancreatitis independent of DKA",
      "DKA can cause hypertriglyceridemia through insulin deficiency affecting lipoprotein lipase",
      "pH <7.0 indicates life-threatening acidosis requiring aggressive resuscitation",
      "Neurological complications in DKA: Cerebral edema (most common in children), seizures, stroke (from hyperviscosity)",
      "Treatment priorities: Fluid resuscitation, insulin therapy (lowers glucose AND triglycerides), electrolyte correction",
      "May require hemodialysis for refractory cases or triglyceride levels >5000 mg/dL with organ dysfunction",
      "Plasmapheresis can rapidly reduce triglycerides in extreme cases",
      "Close monitoring in ICU essential - high risk of cerebral edema, especially in young patients"
    ],
    "atypical_features": "Extremely elevated triglycerides (25,585 mg/dL), small midbrain infarct likely from hyperviscosity/thrombosis, severe encephalopathy (GCS 4), generalized seizures, 'terrible triad' is rare presentation",
    "india_context": "First presentation of T1DM in India often occurs as DKA due to delayed diagnosis. Severe hypertriglyceridemia complicating DKA is increasingly recognized. Requires ICU care with insulin infusion and aggressive fluid management. Patient required ventilator support and 4 cycles of hemodialysis. Good outcome with normalization of triglycerides and successful discharge after 21 days. Emphasizes importance of diabetes education and early recognition of symptoms in Indian youth where T1DM incidence is rising."
  }
]
