[
  {
    "id": "GI-001",
    "title": "Amoebic Liver Abscess",
    "specialty": "gastro",
    "difficulty": "intermediate",
    "source": "JAPI - Liver Abscess in India",
    "demographics": {"age": 38, "gender": "Male", "location": "Bhopal, MP"},
    "chief_complaint": "Right upper quadrant pain and fever for 10 days",
    "presentation": "A 38-year-old truck driver presents with right upper quadrant pain, high-grade fever with chills, and right shoulder tip pain for 10 days. He consumes alcohol (country liquor) regularly and has poor dietary hygiene. He was initially treated for pneumonia with no improvement.",
    "vital_signs": {"bp": "110/70", "hr": 100, "rr": 22, "temp": 39.5, "spo2": 96},
    "history": "Right upper quadrant pain for 10 days, dull aching, radiating to right shoulder. High-grade fever with rigors and chills. Anorexia, nausea. Dry cough (reactive from diaphragmatic irritation). No jaundice. No diarrhea currently (but had bloody diarrhea 3 months ago, self-treated). Truck driver, eats at roadside dhabas. Drinks country liquor regularly. Treated with ceftriaxone for 5 days (suspected pneumonia) - no improvement.",
    "physical_exam": "Febrile, appears toxic. Tender hepatomegaly (liver 6 cm below costal margin, smooth, tender). Intercostal tenderness right lower chest. Right basal crepitations (reactive effusion). No jaundice. No splenomegaly. No ascites. Positive punch sign (tenderness on fist percussion over liver).",
    "investigations": "USG abdomen: Large solitary abscess right lobe of liver (10 x 8 cm, hypoechoic with internal echoes, 'anchovy sauce' appearance). No biliary dilatation. Amoebic serology (IgG ELISA): Strongly positive. CBC: WBC 18,000 (neutrophilia), Hb 11, Platelets normal. LFT: ALP 350 (elevated), AST 65, ALT 55, Bilirubin 1.5. CXR: Right pleural effusion (reactive), elevated right hemidiaphragm. Stool: No cysts/trophozoites (negative in >50% of liver abscess). Blood culture: Negative (helps rule out pyogenic).",
    "diagnosis": "Amoebic liver abscess (Entamoeba histolytica)",
    "differentials": ["Amoebic liver abscess", "Pyogenic liver abscess", "Hydatid cyst (infected)", "Hepatocellular carcinoma with necrosis", "Hepatic hemangioma (atypical)", "Subdiaphragmatic abscess"],
    "learning_points": [
      "Amoebic vs Pyogenic liver abscess: Amoebic = young male, solitary, right lobe, positive serology. Pyogenic = elderly, multiple, may have biliary disease, blood culture positive",
      "Anchovy sauce/chocolate sauce pus is classic for amoebic abscess",
      "Stool examination is negative in >50% of amoebic liver abscess (intestinal phase may have resolved)",
      "Treatment: Metronidazole 750mg TID for 7-10 days + luminal agent (diloxanide furoate/paromomycin)",
      "Aspiration indications: >5 cm, left lobe (risk of rupture into pericardium), no response to drugs in 72 hours",
      "Complication: Rupture into peritoneum, pleura, or pericardium (left lobe abscess)"
    ],
    "india_context": "India has the highest global burden of amoebiasis. Poor sanitation, contaminated water, and food-handling practices drive transmission. Truck drivers are particularly vulnerable due to eating at unhygienic roadside eateries. Metronidazole is widely available and affordable. Image-guided aspiration is available at district hospitals."
  },
  {
    "id": "GI-002",
    "title": "Acute Pancreatitis - Alcohol-Related with Pseudocyst",
    "specialty": "gastro",
    "difficulty": "intermediate",
    "source": "Indian Journal of Gastroenterology",
    "demographics": {"age": 42, "gender": "Male", "location": "Trivandrum, Kerala"},
    "chief_complaint": "Severe epigastric pain radiating to back for 2 days",
    "presentation": "A 42-year-old fisherman from Kerala presents with severe boring epigastric pain radiating to the back for 2 days, worsened by eating and partially relieved by leaning forward. He has a history of heavy alcohol consumption (toddy and arrack). He has had 3 prior episodes of acute pancreatitis. He presents with vomiting, abdominal distension, and fever.",
    "vital_signs": {"bp": "90/55", "hr": 118, "rr": 26, "temp": 38.5, "spo2": 93},
    "history": "Severe epigastric pain for 2 days, boring quality, radiating straight to the back. Worse on eating, partially relieved by leaning forward (pancreatic position). Persistent vomiting. Abdominal distension. Stopped passing flatus (ileus). Heavy alcohol intake: toddy and arrack daily for 20 years, binge 3 days ago. 3 previous episodes of pancreatitis (twice hospitalized). No gallstone history. No recent medications (no steroids, azathioprine, valproate).",
    "physical_exam": "Dehydrated, tachycardic, hypotensive. Epigastric tenderness and guarding. Distended abdomen with absent bowel sounds (paralytic ileus). Cullen sign: Periumbilical ecchymosis. Grey-Turner sign: Flank ecchymosis (hemorrhagic pancreatitis). No jaundice. Reduced breath sounds bilateral bases (pleural effusions). Shifting dullness positive (ascites).",
    "investigations": "Serum amylase: 1800 U/L (>3x upper limit). Serum lipase: 2500 U/L. CT abdomen (contrast, after 72 hours): Bulky pancreas with peripancreatic fat stranding, peripancreatic fluid collections, 40% necrosis (necrotizing pancreatitis), left pleural effusion, ascites. 6 cm pseudocyst in lesser sac (from previous episode). CTSI (CT Severity Index): 8/10 (severe). CBC: WBC 19,000, Hb 14 (hemoconcentration). CRP: 280. Calcium: 6.8 mg/dL (hypocalcemia - Cullen sign). LFT: Mildly deranged. Renal: Creatinine 2.2 (AKI). BUN: 45. Triglycerides: Normal. APACHE II: 12 (severe).",
    "diagnosis": "Severe acute alcohol-related necrotizing pancreatitis with organ failure, pre-existing pseudocyst",
    "differentials": ["Acute pancreatitis (alcoholic)", "Gallstone pancreatitis", "Perforated peptic ulcer", "Mesenteric ischemia", "Ruptured aortic aneurysm", "Pancreatic carcinoma"],
    "learning_points": [
      "Revised Atlanta Classification: Mild (no organ failure), Moderately severe (transient organ failure <48h), Severe (persistent organ failure >48h)",
      "CTSI/Balthazar score predicts severity and necrosis extent",
      "Cullen and Grey-Turner signs indicate hemorrhagic pancreatitis (retroperitoneal hemorrhage)",
      "Management: Aggressive fluid resuscitation (Ringer lactate), pain control, NPO → early enteral nutrition (nasojejunal)",
      "Infected necrosis: Suspect if fever >7-10 days. Confirm with FNA + culture. Treat with step-up approach (PCD → endoscopic/minimally invasive necrosectomy → open surgery)",
      "Pseudocyst: Encapsulated fluid collection >4 weeks. Drain if symptomatic or >6 cm"
    ],
    "india_context": "Alcohol is the commonest cause of acute pancreatitis in South India (toddy/arrack consumption). Gallstones are the commonest cause in North India. Kerala has among the highest per-capita alcohol consumption in India. Step-up approach for infected necrosis has been adopted by most Indian GI centers (video-assisted retroperitoneal debridement - VARD)."
  },
  {
    "id": "GI-003",
    "title": "Hepatitis B - Chronic with Decompensated Cirrhosis",
    "specialty": "gastro",
    "difficulty": "advanced",
    "source": "INASL Guidelines - Hepatitis B",
    "demographics": {"age": 50, "gender": "Male", "location": "Aizawl, Mizoram"},
    "chief_complaint": "Abdominal distension, jaundice, and confusion for 1 week",
    "presentation": "A 50-year-old government employee from Mizoram presents with progressive abdominal distension for 3 months, deepening jaundice for 2 weeks, and confusion with altered sleep-wake cycle for 5 days. He was diagnosed with Hepatitis B 10 years ago but never followed up. Mizoram has the highest HBV prevalence in India (>5%).",
    "vital_signs": {"bp": "95/55", "hr": 100, "rr": 20, "temp": 38.2, "spo2": 95},
    "history": "Progressive abdominal distension for 3 months (ascites). Bilateral leg swelling for 2 months. Jaundice deepening for 2 weeks. Confusion, drowsiness, inverted sleep-wake cycle for 5 days. One episode of hematemesis (large volume) 2 days ago. Known HBsAg positive for 10 years, never treated, no follow-up. No alcohol. Lives in Aizawl, Mizoram (high HBV endemicity - vertical transmission common). Family: Mother died of 'liver cancer' at 55.",
    "physical_exam": "Deeply icteric, confused (Grade II hepatic encephalopathy). Asterixis present. Fetor hepaticus. Spider naevi on upper chest. Palmar erythema. Gynecomastia. Testicular atrophy. Tense ascites. Splenomegaly (portal hypertension). Caput medusae. Bilateral pedal edema. Shrunken liver (not palpable). Dilated veins on abdominal wall.",
    "investigations": "HBsAg: Positive. HBeAg: Negative. Anti-HBe: Positive. HBV DNA: 25,000 IU/mL (active replication). Anti-HCV: Negative. Anti-HDV: Negative. AFP: 450 ng/mL (suspicious for HCC). LFT: Bilirubin 12, AST 120, ALT 85, Albumin 1.8, INR 2.8. CBC: Hb 8.5, WBC 3,200, Platelets 55,000 (pancytopenia - hypersplenism). Renal: Creatinine 1.8, Na+ 125 (dilutional). Ascitic fluid: SAAG 2.1 (portal hypertension), protein 1.5, WBC 350 (PMN 280 - SBP). USG: Shrunken liver, coarse echotexture, splenomegaly, ascites, portal vein 14mm. 3 cm lesion in right lobe (? HCC). Triple-phase CT: Arterial enhancing lesion 3 cm in segment VII with washout (LIRADS-5, definite HCC). Child-Pugh Score: C (12 points). MELD: 28.",
    "diagnosis": "Chronic Hepatitis B with decompensated cirrhosis (Child-Pugh C), spontaneous bacterial peritonitis, hepatocellular carcinoma, and hepatic encephalopathy",
    "differentials": ["HBV cirrhosis decompensation", "Alcoholic liver disease", "HCV cirrhosis", "Wilson disease", "Autoimmune hepatitis", "Budd-Chiari syndrome"],
    "learning_points": [
      "HBV is the commonest cause of cirrhosis and HCC in Northeast India and Asia",
      "Screen all HBV cirrhotics for HCC: USG + AFP every 6 months",
      "SBP diagnosis: Ascitic fluid PMN >250 cells/mm³ - treat with IV ceftriaxone empirically",
      "Hepatic encephalopathy: Lactulose + rifaximin, identify and treat precipitants (SBP, GI bleed)",
      "Child-Pugh C with MELD >15: Liver transplant evaluation",
      "Antiviral: Tenofovir or Entecavir indefinitely in decompensated cirrhosis"
    ],
    "india_context": "India has ~40 million HBV carriers (3-4% prevalence). Northeast states (Mizoram, Arunachal, Nagaland) have >5% prevalence due to vertical transmission and cultural practices. Universal HBV vaccination in UIP since 2007 (birth dose). INASL recommends Tenofovir as first-line for HBV. Liver transplantation available at ~50 centers in India; living donor transplant is commonest (80%)."
  },
  {
    "id": "GI-004",
    "title": "Celiac Disease Presenting with Iron Deficiency Anemia",
    "specialty": "gastro",
    "difficulty": "intermediate",
    "source": "Indian Journal of Gastroenterology - Celiac Disease",
    "demographics": {"age": 22, "gender": "Female", "location": "Chandigarh, Punjab"},
    "chief_complaint": "Chronic diarrhea, fatigue, and severe anemia",
    "presentation": "A 22-year-old Punjabi college student presents with chronic loose stools for 2 years, progressive fatigue, and severe pallor. She has been treated with multiple courses of iron supplements without improvement. She has had recurrent aphthous ulcers and delayed menarche (first period at 16). She consumes a wheat-heavy Punjabi diet (roti with every meal).",
    "vital_signs": {"bp": "100/60", "hr": 96, "rr": 18, "temp": 37.0, "spo2": 98},
    "history": "Chronic loose stools for 2 years - 3-4 times/day, bulky, pale, foul-smelling, float on water (steatorrhea). Abdominal bloating after meals (especially roti/chapati). Progressive fatigue and weakness. Severe pallor. Multiple iron supplement courses - no response (refractory iron deficiency anemia). Recurrent aphthous ulcers. Delayed menarche (16 years). Short stature for family. Weight loss 5 kg. Diet: Heavy wheat consumption (roti with every meal - Punjabi diet). Younger brother also has chronic diarrhea.",
    "physical_exam": "Pale, thin. BMI 17. Angular cheilitis. Glossitis (smooth, beefy-red tongue). Multiple aphthous ulcers. Koilonychia. Dry, rough skin (dermatitis herpetiformis - itchy papulovesicular rash on elbows and knees). Mild abdominal distension, no tenderness. No hepatosplenomegaly. Short stature (150 cm, family average 162 cm).",
    "investigations": "Anti-tTG IgA: >200 U/mL (strongly positive, normal <20). Anti-endomysial antibodies (EMA): Positive. Total serum IgA: Normal (rules out IgA deficiency causing false-negative). HLA-DQ2: Positive. Upper GI endoscopy: Scalloping of duodenal folds, mosaic pattern, loss of villi. Duodenal biopsy: Marsh 3c (total villous atrophy, crypt hyperplasia, increased intraepithelial lymphocytes). CBC: Hb 6.5, MCV 68 (microcytic), Ferritin 3 (depleted). Iron studies: Low serum iron, high TIBC. Calcium: 7.8 (low). Vitamin D: 8 ng/mL (deficient). B12: Low-normal. Folate: Low. DEXA: Osteopenia. TSH: Normal. LFT: Mildly elevated transaminases.",
    "diagnosis": "Celiac disease with iron deficiency anemia (refractory to oral iron), steatorrhea, and metabolic bone disease",
    "differentials": ["Celiac disease", "Tropical sprue", "Crohn disease (small bowel)", "Whipple disease", "Small intestinal bacterial overgrowth (SIBO)", "Intestinal TB"],
    "learning_points": [
      "Celiac disease is increasingly recognized in North India (wheat belt) - prevalence ~1%",
      "Refractory iron deficiency anemia not responding to oral iron: Think celiac disease",
      "Anti-tTG IgA is the best screening test; biopsy remains gold standard",
      "Marsh classification: 0 (normal) to 3c (total villous atrophy)",
      "Treatment: Strict lifelong gluten-free diet (avoid wheat, barley, rye)",
      "Celiac diet in Punjab is challenging: Rice, corn (makki), millet (bajra) as wheat substitutes"
    ],
    "india_context": "Celiac disease prevalence in North India (Punjab, Haryana, Delhi, Rajasthan) is ~1% - comparable to Western countries. The 'wheat belt' of India has the highest prevalence. Previously thought rare in India, now increasingly diagnosed. ICMR recommends screening in: refractory IDA, type 1 DM, autoimmune thyroid disease, Down syndrome, first-degree relatives. Gluten-free products are increasingly available but expensive."
  },
  {
    "id": "GI-005",
    "title": "Acute Upper GI Bleed - Variceal",
    "specialty": "gastro",
    "difficulty": "intermediate",
    "source": "INASL Guidelines - Portal Hypertension",
    "demographics": {"age": 48, "gender": "Male", "location": "Vellore, Tamil Nadu"},
    "chief_complaint": "Vomiting large amounts of blood",
    "presentation": "A 48-year-old farmer presents with sudden onset massive hematemesis (bright red blood, estimated 500 mL) and melena for 6 hours. He has a known history of alcohol-related cirrhosis but has not been compliant with follow-up. He is hemodynamically unstable with altered sensorium.",
    "vital_signs": {"bp": "75/50", "hr": 130, "rr": 26, "temp": 36.5, "spo2": 92},
    "history": "Sudden massive hematemesis - 3 episodes of bright red blood (estimated 500 mL total). Melena (black tarry stools) for 6 hours. Known alcohol-related cirrhosis diagnosed 3 years ago (biopsy-proven). Was advised beta-blocker prophylaxis but not compliant. Heavy alcohol intake (arrack, 15 years). No recent NSAID or aspirin use. Previous endoscopy: Grade III esophageal varices (3 years ago, no banding done). Confused on arrival.",
    "physical_exam": "Pale, diaphoretic, altered sensorium (GCS 12). Icteric. Spider naevi. Palmar erythema. Ascites. Splenomegaly. Caput medusae. Bilateral pedal edema. PR: Melena on glove. No fresh blood in rectum.",
    "investigations": "CBC: Hb 5.5 (acute blood loss + chronic disease), WBC 8,000, Platelets 68,000. INR: 2.2. LFT: Bilirubin 5.5, Albumin 2.0, AST 85, ALT 55. Renal: Creatinine 1.8. Blood group: O+ve. Crossmatch sent for 4 units. Lactate: 5.5 mmol/L. Upper GI endoscopy (after resuscitation): Grade IV esophageal varices with active spurting (Baveno classification), red wale marks, cherry red spots. Successful band ligation of 3 varices. USG: Cirrhotic liver, portal vein 15 mm (portal hypertension), ascites, splenomegaly.",
    "diagnosis": "Acute variceal upper GI hemorrhage secondary to portal hypertension from alcohol-related cirrhosis",
    "differentials": ["Esophageal variceal bleed", "Gastric variceal bleed", "Peptic ulcer bleed (Forrest classification)", "Mallory-Weiss tear", "Portal hypertensive gastropathy", "Gastric antral vascular ectasia (GAVE)"],
    "learning_points": [
      "Acute variceal bleed management: Airway + Resuscitation + IV terlipressin/octreotide + IV antibiotics (ceftriaxone) + URGENT endoscopy (<12 hours)",
      "Endoscopic band ligation (EBL) is first-line for esophageal varices; cyanoacrylate glue for gastric varices",
      "Restrictive transfusion: Target Hb 7-8 g/dL (over-transfusion increases portal pressure)",
      "Antibiotics (ceftriaxone 1g IV/day x 7 days) reduce rebleeding and mortality",
      "TIPS (transjugular intrahepatic portosystemic shunt) for refractory bleeding",
      "Secondary prophylaxis: Beta-blocker (carvedilol) + repeat EBL sessions until variceal eradication"
    ],
    "india_context": "Alcohol-related cirrhosis is the commonest cause of portal hypertension in South and West India. Hepatitis B/C-related cirrhosis dominates in Northeast and North India. INASL recommends screening endoscopy for all cirrhotic patients. EBL is available at most medical college hospitals. TIPS availability is limited to select tertiary centers."
  },
  {
    "id": "GI-006",
    "title": "Intestinal Tuberculosis Mimicking Crohn's Disease",
    "specialty": "gastro",
    "difficulty": "advanced",
    "source": "IJMR - GI Tuberculosis",
    "demographics": {"age": 28, "gender": "Female", "location": "Kolkata, West Bengal"},
    "chief_complaint": "Chronic abdominal pain, diarrhea, and weight loss for 4 months",
    "presentation": "A 28-year-old schoolteacher from Kolkata presents with chronic right iliac fossa pain, alternating diarrhea and constipation, weight loss of 7 kg, and evening fevers for 4 months. Colonoscopy shows ileocecal ulceration. The critical diagnostic dilemma is: Is this intestinal TB or Crohn's disease? Starting the wrong treatment could be fatal.",
    "vital_signs": {"bp": "110/70", "hr": 84, "rr": 16, "temp": 37.8, "spo2": 98},
    "history": "Right iliac fossa pain for 4 months, colicky, postprandial. Alternating diarrhea and constipation. No blood in stools. Weight loss 7 kg. Evening low-grade fever. Night sweats. Anorexia. No joint pains, eye symptoms, skin lesions (no extraintestinal Crohn features). No perianal disease. No family history of IBD. Contact with TB patient (colleague). No prior TB treatment.",
    "physical_exam": "Thin, pale. Tender mass palpable in right iliac fossa (ileocecal thickening). No perianal disease (important - Crohn commonly has perianal fistulae). No oral ulcers. No erythema nodosum. No joint swelling. Mild ascites. No hepatosplenomegaly.",
    "investigations": "Colonoscopy: Circumferential ulcers in cecum and terminal ileum, nodularity, stricture at ileocecal valve. Biopsy: Granulomas with caseation (favoring TB). GeneXpert on biopsy tissue: MTB detected. AFB stain: Negative. CT abdomen: Ileocecal wall thickening (circumferential), mesenteric lymphadenopathy with necrotic centers (caseous), mild ascites. Ascitic fluid ADA: 40 U/L (elevated). CXR: Normal. Mantoux: 20 mm. CBC: Hb 9.5, ESR 60. CRP: 55. Albumin: 2.8. Fecal calprotectin: Elevated.",
    "diagnosis": "Intestinal (ileocecal) tuberculosis",
    "differentials": ["Intestinal tuberculosis", "Crohn disease (ileocecal)", "Ileocecal lymphoma", "Yersinia enterocolitis", "Cecal carcinoma", "Amebiasis"],
    "learning_points": [
      "TB vs Crohn's is the most important differential in Indian gastroenterology",
      "Features favoring TB: Circumferential ulcers, caseating granulomas, necrotic lymph nodes, ascites, positive GeneXpert, response to ATT",
      "Features favoring Crohn's: Longitudinal ulcers, non-caseating granulomas, skip lesions, perianal disease, cobblestoning, extraintestinal manifestations",
      "GeneXpert on tissue biopsy has 50-70% sensitivity for intestinal TB",
      "When in doubt in India: Empirical ATT trial for 8 weeks (if TB, dramatic improvement; if Crohn's, no response)",
      "NEVER start immunosuppression (steroids/biologics for Crohn's) without ruling out TB - can cause disseminated TB"
    ],
    "india_context": "The TB vs Crohn's dilemma is unique to TB-endemic countries like India. Incidence of both is rising. Starting anti-TNF biologics (infliximab) for misdiagnosed Crohn's in a TB patient can be fatal. ICMR and ISG recommend: In diagnostic doubt, treat for TB first. All patients planned for biologics must have TB screening (GeneXpert, IGRA, CXR)."
  },
  {
    "id": "GI-007",
    "title": "Acute Upper GI Bleed from Peptic Ulcer - Forrest Classification",
    "specialty": "gastro",
    "difficulty": "intermediate",
    "source": "ISG Guidelines - Non-Variceal Upper GI Bleed",
    "demographics": {"age": 55, "gender": "Male", "location": "Jaipur, Rajasthan"},
    "chief_complaint": "Hematemesis and black tarry stools for 1 day",
    "presentation": "A 55-year-old shopkeeper from Jaipur presents with two episodes of coffee-ground vomiting followed by one large episode of frank hematemesis (approximately 300 mL) and melena for 1 day. He has been taking over-the-counter diclofenac daily for knee osteoarthritis for 6 months without any gastroprotective agent. He also gives a history of epigastric burning pain for 3 months which was worsened by the NSAID but he continued the medication.",
    "vital_signs": {"bp": "88/58", "hr": 122, "rr": 24, "temp": 36.8, "spo2": 95},
    "history": "Two episodes of coffee-ground vomiting yesterday evening, followed by one episode of frank hematemesis (approximately 300 mL bright red blood with clots) this morning. Melena (black tarry stools) x 3 since yesterday. Epigastric burning pain for 3 months, worse on empty stomach, partially relieved by food. Daily diclofenac (50 mg TID) for 6 months for knee osteoarthritis - obtained over the counter without prescription. No PPI or H2 blocker co-prescribed. Occasional alcohol (country liquor on weekends). Smokes 10 bidis/day for 20 years. No prior endoscopy. No previous episodes of GI bleed. No anticoagulant or antiplatelet use. Dizziness and near-syncope on standing.",
    "physical_exam": "Pale, diaphoretic, anxious. Postural hypotension present (BP drops 25 mmHg on standing). Cold clammy extremities. Epigastric tenderness without guarding or rigidity. No peritoneal signs. No hepatosplenomegaly. No stigmata of chronic liver disease (no spider naevi, no palmar erythema, no ascites). PR: Black tarry stool on glove, strongly positive for occult blood. No abdominal masses.",
    "investigations": "CBC: Hb 7.2 g/dL (was 12.5 three months ago per old records), MCV 82, WBC 11,000, Platelets 2,20,000. INR: 1.1. BUN: 42 mg/dL (elevated - upper GI source, blood digestion). Creatinine: 1.1. LFT: Normal. Blood group: B+ve, crossmatch for 3 units PRBC. Glasgow-Blatchford Score: 14 (high risk, needs intervention). Rockall Score (pre-endoscopy): 5. Upper GI endoscopy (within 12 hours of admission after resuscitation): Duodenal ulcer (posterior wall of D1, 2 cm) with visible vessel and active oozing (Forrest Ib). No esophageal or gastric varices. Endoscopic therapy: Combination therapy with 1:10,000 adrenaline injection around ulcer + bipolar coagulation of visible vessel + 2 hemoclips applied. Hemostasis achieved. CLO test (rapid urease test) from antral biopsy: Positive for H. pylori. Serum gastrin: Not indicated (no suspicion of Zollinger-Ellison).",
    "diagnosis": "Acute upper GI hemorrhage from posterior duodenal ulcer (Forrest Ib - oozing hemorrhage), NSAID-induced, H. pylori co-infection",
    "differentials": ["Peptic ulcer bleed (duodenal/gastric)", "Esophageal variceal bleed", "Mallory-Weiss tear", "Erosive gastritis/duodenitis (NSAID)", "Dieulafoy lesion", "Gastric malignancy", "Aorto-enteric fistula"],
    "learning_points": [
      "Forrest Classification for peptic ulcer bleed: Ia (spurting arterial) - 90% rebleed risk, Ib (oozing) - 50%, IIa (visible vessel) - 43%, IIb (adherent clot) - 22%, IIc (flat pigmented spot) - 10%, III (clean base) - 5%",
      "Endoscopic therapy indicated for Forrest Ia, Ib, and IIa lesions. Combination therapy (injection + thermal/mechanical) is superior to monotherapy",
      "NSAID + H. pylori is synergistic risk: Both must be treated. Eradicate H. pylori + stop NSAID + high-dose PPI",
      "Glasgow-Blatchford Score (GBS): Best pre-endoscopy risk score. GBS 0 = can be discharged for outpatient endoscopy. GBS >=6 = high risk, needs urgent endoscopy",
      "Post-endoscopy: IV PPI infusion (pantoprazole 80 mg bolus + 8 mg/hr for 72 hours) for high-risk stigmata (Forrest Ia, Ib, IIa) to maintain gastric pH >6 and stabilize clot",
      "Posterior duodenal ulcers can erode into the gastroduodenal artery causing catastrophic hemorrhage. If endoscopy fails, angiographic embolization or surgery (under-running of GDA) needed"
    ],
    "india_context": "NSAID-induced peptic ulcer disease is extremely common in India due to widespread over-the-counter availability of diclofenac, ibuprofen, and aceclofenac without PPI co-prescription. H. pylori prevalence in India is 60-80%. ISG recommends H. pylori testing and eradication in all peptic ulcer patients. Endoscopy services are available at district hospital level in most states. IV pantoprazole is affordable and widely available. The combination of bidi smoking, NSAIDs, and H. pylori creates a high-risk population."
  },
  {
    "id": "GI-008",
    "title": "Hepatocellular Carcinoma on Hepatitis B Cirrhosis",
    "specialty": "gastro",
    "difficulty": "advanced",
    "source": "INASL Guidelines - Hepatocellular Carcinoma 2024",
    "demographics": {"age": 58, "gender": "Male", "location": "Imphal, Manipur"},
    "chief_complaint": "Right upper abdominal pain, weight loss, and worsening jaundice for 6 weeks",
    "presentation": "A 58-year-old retired army personnel from Imphal, Manipur presents with dull aching right upper abdominal pain, unintentional weight loss of 8 kg in 6 weeks, and progressive jaundice. He is a known chronic Hepatitis B carrier diagnosed 15 years ago during a routine army medical examination. He was on Tenofovir for 5 years but discontinued it 3 years ago after moving back to Manipur. He had been non-compliant with HCC surveillance. Manipur is a high HBV-endemic state in Northeast India.",
    "vital_signs": {"bp": "130/80", "hr": 88, "rr": 18, "temp": 37.2, "spo2": 97},
    "history": "Dull aching right upper quadrant pain for 6 weeks, progressive, not related to food. Unintentional weight loss of 8 kg in 6 weeks. Progressive jaundice for 4 weeks. Early satiety and abdominal fullness. Anorexia. Mild abdominal distension for 2 weeks. No hematemesis or melena. Known Hepatitis B (HBsAg positive) since 15 years - detected on army medical screening. Was on Tenofovir for 5 years, then discontinued 3 years ago (poor compliance after retirement, returned to Imphal). No HCC surveillance (no 6-monthly USG/AFP). No alcohol intake. Father died of liver disease age 60 (likely HBV-related). No IV drug use. Intravenous injections from unlicensed practitioner in past (possible transmission route).",
    "physical_exam": "Thin, icteric, temporal wasting. Hard, nodular hepatomegaly (liver 8 cm below costal margin, hard, irregular surface, non-tender). Hepatic bruit audible over right lobe (arterial vascularity of tumor). Mild ascites. Splenomegaly 3 cm. No encephalopathy. No peripheral edema. No Virchow node. No Sister Mary Joseph nodule. Performance status ECOG 1.",
    "investigations": "HBsAg: Positive. HBeAg: Negative. Anti-HBe: Positive. HBV DNA: 85,000 IU/mL (active replication off treatment). Anti-HCV: Negative. AFP: 8,500 ng/mL (markedly elevated, >400 is highly suggestive of HCC). AFP-L3%: 25% (elevated, favoring HCC). PIVKA-II (DCP): Elevated. LFT: Bilirubin 6.5, AST 110, ALT 78, Albumin 2.5, INR 1.8. CBC: Hb 10.5, WBC 5,500, Platelets 88,000 (hypersplenism). Renal: Normal. Triple-phase CT abdomen: Large 8 cm mass in right lobe (segments V, VI, VIII) with arterial phase hyperenhancement and portal venous phase washout - LIRADS-5 (definite HCC). Tumor thrombus in right branch of portal vein (PVTT - Vp3). Two satellite nodules (1.5 cm, 2 cm). Cirrhotic liver morphology. Splenomegaly. Mild ascites. No extrahepatic metastases. Chest CT: No pulmonary metastases. Bone scan: No skeletal metastases. BCLC Stage C (advanced - portal vein invasion). Child-Pugh Score: B (8 points). MELD: 18.",
    "diagnosis": "Hepatocellular carcinoma (BCLC Stage C) on chronic Hepatitis B cirrhosis with portal vein tumor thrombus",
    "differentials": ["Hepatocellular carcinoma", "Cholangiocarcinoma (intrahepatic)", "Metastatic liver disease", "Hepatic abscess (atypical)", "Focal nodular hyperplasia", "Hepatic adenoma"],
    "learning_points": [
      "HCC diagnosis can be made non-invasively by imaging (LIRADS-5: arterial hyperenhancement + portal venous washout in a cirrhotic liver) - biopsy NOT mandatory",
      "AFP >400 ng/mL in a cirrhotic patient with liver mass is highly suggestive of HCC. AFP-L3% and PIVKA-II improve diagnostic accuracy",
      "BCLC Staging: 0/A = curative (resection, ablation, transplant), B = intermediate (TACE), C = advanced (systemic - atezolizumab + bevacizumab or sorafenib/lenvatinib), D = terminal (BSC)",
      "Portal vein tumor thrombus (PVTT) makes the patient BCLC Stage C - systemic therapy is first-line, NOT TACE (risk of hepatic infarction)",
      "HCC surveillance: 6-monthly USG + AFP in ALL cirrhotic patients and HBV carriers (even without cirrhosis, HBV can cause HCC)",
      "Restart antiviral (Tenofovir/Entecavir) regardless of HCC stage - controls liver disease and improves outcomes"
    ],
    "india_context": "Northeast India (Manipur, Mizoram, Nagaland, Arunachal Pradesh) has the highest HBV prevalence in India (>5%), largely from vertical and horizontal transmission including traditional practices. HCC is rising in India with ~30,000-50,000 new cases/year. HBV accounts for 40-50% of HCC in India. Surveillance compliance is poor due to limited access in rural/tribal areas. Sorafenib is available but expensive (~Rs 1-1.5 lakh/month). Atezolizumab + bevacizumab is now preferred first-line but cost-prohibitive for many (~Rs 3-4 lakh/cycle). TACE is available at most tertiary centers. Liver transplant for HCC within Milan criteria is the best curative option (living donor transplant preferred in India)."
  },
  {
    "id": "GI-009",
    "title": "Celiac Disease in a Child with Growth Failure",
    "specialty": "gastro",
    "difficulty": "intermediate",
    "source": "IAP Guidelines - Celiac Disease in Children",
    "demographics": {"age": 6, "gender": "Female", "location": "Ludhiana, Punjab"},
    "chief_complaint": "Poor growth, chronic diarrhea, and abdominal distension for 2 years",
    "presentation": "A 6-year-old girl from a Punjabi farming family in Ludhiana is brought by her parents with failure to gain weight and height despite adequate food intake for 2 years. She has chronic loose bulky stools, prominent abdominal distension, and irritability. She was weaned onto wheat-based foods (suji/daliya) at 6 months of age. Her weight is below the 3rd percentile and height is below the 3rd percentile for age. She has been treated multiple times with deworming and iron tonics by local practitioners without improvement.",
    "vital_signs": {"bp": "85/55", "hr": 110, "rr": 22, "temp": 37.0, "spo2": 99},
    "history": "Poor weight gain for 2 years despite reportedly adequate caloric intake. Chronic diarrhea - 4-6 loose, bulky, pale, foul-smelling stools daily that are difficult to flush (steatorrhea). Prominent abdominal distension, progressive. Irritability and mood changes. Anorexia. Recurrent oral ulcers. No bloody stools. Weaned onto suji kheer (semolina), daliya (broken wheat porridge), and roti at 6 months of age. Wheat-heavy Punjabi diet (roti 4-5 times daily). Treated with albendazole, iron tonics, multivitamins, appetite stimulants multiple times - no improvement. Born full-term, normal delivery, birth weight 2.8 kg. Milestones: Gross motor mildly delayed (walked at 18 months). Elder brother (8 years) is healthy and thriving. No family history of celiac disease, type 1 DM, or autoimmune thyroid disease.",
    "physical_exam": "Wasted, irritable child. Weight 13 kg (<3rd percentile, expected ~20 kg). Height 98 cm (<3rd percentile, expected ~115 cm). BMI: 13.5 (severely wasted). Mid-upper arm circumference (MUAC): 12 cm (severe acute malnutrition). Prominent abdominal distension with visible bowel loops. Wasted buttocks (loss of subcutaneous fat - classic celiac habitus). Pallor. Angular cheilitis. Sparse, lusterless hair. Dental enamel hypoplasia (permanent teeth). Mild pedal edema (hypoalbuminemia). Rickets signs: Widening of wrists, rachitic rosary, frontal bossing. No hepatosplenomegaly. Skin: Dry, rough patches on extensor surfaces.",
    "investigations": "Anti-tTG IgA: >300 U/mL (strongly positive, normal <20). Total serum IgA: Normal (ruling out IgA deficiency). Anti-tTG IgA repeated (second sample): >300 U/mL (confirmed >10x ULN). HLA DQ2: Positive. As per ESPGHAN 2020 guidelines, biopsy can be avoided when anti-tTG IgA >10x ULN on two separate samples + positive HLA DQ2/DQ8 + symptomatic child. However, upper GI endoscopy was performed (parental request and teaching center protocol): Duodenal mucosa showing scalloping of folds, loss of villi, mosaic pattern. Biopsy: Marsh 3b (subtotal villous atrophy, crypt hyperplasia, >40 IELs/100 enterocytes). CBC: Hb 7.8 g/dL, MCV 68 (microcytic), WBC normal, Platelets 4,50,000 (reactive thrombocytosis). Iron studies: Ferritin 4, serum iron low, TIBC elevated. Calcium: 7.2 mg/dL. Phosphorus: 2.5. ALP: 850 (markedly elevated - rickets). Vitamin D (25-OH): 5 ng/mL (severe deficiency). Albumin: 2.2. Wrist X-ray: Cupping, fraying, and splaying of metaphyses (active rickets). Stool: No ova/cysts/parasites. Thyroid function: Normal. Random blood sugar: Normal (screening for Type 1 DM).",
    "diagnosis": "Celiac disease with severe malnutrition, nutritional rickets, iron deficiency anemia, and growth failure",
    "differentials": ["Celiac disease", "Tropical sprue", "Cow's milk protein allergy", "Cystic fibrosis", "Giardiasis", "Small intestinal bacterial overgrowth", "Protein-energy malnutrition (environmental)", "Inflammatory bowel disease"],
    "learning_points": [
      "Celiac disease is the commonest cause of chronic malabsorptive diarrhea with growth failure in North Indian children - prevalence ~1% in Punjab/Haryana wheat-belt region",
      "Classic pediatric celiac triad: Chronic diarrhea + abdominal distension + failure to thrive (wasted buttocks is a classic visual clue)",
      "ESPGHAN 2020 no-biopsy pathway for children: Anti-tTG IgA >10x ULN on TWO separate samples + positive HLA DQ2/DQ8 + symptomatic = celiac diagnosis without biopsy",
      "Celiac disease causes secondary rickets (calcium and vitamin D malabsorption), iron deficiency anemia (duodenal iron malabsorption), and dental enamel defects",
      "Treatment: Strict lifelong gluten-free diet (GFD). In India this means replacing wheat/roti with rice, corn (makki ki roti), bajra, jowar, ragi. Catch-up growth is dramatic after GFD",
      "Screen first-degree relatives, and screen celiac patients for Type 1 DM, autoimmune thyroid disease, and IgA nephropathy"
    ],
    "india_context": "Punjab and Haryana have the highest celiac prevalence in India due to early wheat weaning and heavy wheat consumption. IAP and ISG recommend screening children with unexplained growth failure, chronic diarrhea, refractory IDA, and type 1 DM. The ESPGHAN no-biopsy pathway is now accepted in India for children, reducing the need for endoscopy. Gluten-free diet is challenging in wheat-belt North India where roti is the staple. Makki ki roti (corn), bajra (pearl millet), jowar (sorghum), and rice are safe GF alternatives. Commercially available gluten-free products are expensive and not accessible in rural areas. IAP recommends dietician counseling and support groups for celiac families."
  },
  {
    "id": "GI-010",
    "title": "Acute Mesenteric Ischemia - Abdominal Emergency",
    "specialty": "gastro",
    "difficulty": "advanced",
    "source": "Indian Journal of Surgery - Mesenteric Ischemia",
    "demographics": {"age": 65, "gender": "Male", "location": "Lucknow, Uttar Pradesh"},
    "chief_complaint": "Sudden severe diffuse abdominal pain with vomiting and bloody diarrhea",
    "presentation": "A 65-year-old retired government officer from Lucknow presents with sudden onset of excruciating diffuse abdominal pain for 8 hours, initially periumbilical and now generalized. He has had multiple episodes of vomiting and two episodes of bloody diarrhea. He has a history of atrial fibrillation for which he was prescribed warfarin but has been non-compliant for several months. He also has rheumatic heart disease with mitral stenosis. The pain is dramatically out of proportion to the physical findings - a classic red flag.",
    "vital_signs": {"bp": "95/60", "hr": 130, "rr": 28, "temp": 38.5, "spo2": 93},
    "history": "Sudden excruciating periumbilical pain 8 hours ago - worst pain of his life, initially colicky, now constant and diffuse. Multiple episodes of vomiting. Two episodes of bloody diarrhea (maroon-colored). Pain out of proportion to examination (classic clue). Known rheumatic heart disease with mitral stenosis and atrial fibrillation for 15 years. Was prescribed warfarin but stopped taking it 6 months ago (non-compliance, no INR monitoring). History of prior embolic event: Left MCA stroke 3 years ago with mild residual weakness. Hypertension on amlodipine. Type 2 diabetes on metformin. No prior abdominal surgery. Smoker (20 bidi-years). Postprandial abdominal pain (intestinal angina) intermittently for 3 months prior (possible chronic mesenteric ischemia).",
    "physical_exam": "Distressed, writhing in pain, tachycardic, diaphoretic. Abdomen: Initially soft and minimally tender (PAIN OUT OF PROPORTION TO FINDINGS - hallmark of mesenteric ischemia). On re-examination 3 hours later: Abdomen now distended, diffusely tender, guarding and rigidity present (peritonitis - bowel infarction has occurred). Absent bowel sounds. No visible peristalsis. PR: Maroon-colored bloody stool. Cardiac: Irregularly irregular rhythm (AF), loud S1, mid-diastolic murmur at apex (mitral stenosis). Mild left-sided hemiparesis (old stroke).",
    "investigations": "CBC: WBC 24,000 (marked leukocytosis with left shift), Hb 14.5 (hemoconcentration), Platelets 3,10,000. ABG: pH 7.22, pCO2 28, HCO3 12, Lactate 8.5 mmol/L (severe lactic acidosis - bowel ischemia/infarction). LDH: 850 (markedly elevated - tissue necrosis). Serum amylase: 350 (mildly elevated - can occur in mesenteric ischemia). D-dimer: >5000 ng/mL (elevated). CRP: 180. INR: 1.1 (sub-therapeutic - patient off warfarin). Renal: Creatinine 2.0 (pre-renal AKI). Phosphate: 6.5 (elevated - bowel infarction releases intracellular phosphate). CT angiography abdomen (GOLD STANDARD): Filling defect (thrombus/embolus) in superior mesenteric artery (SMA) at 3-5 cm from origin (typical embolic location - past the origin of middle colic artery). Diffusely dilated small bowel loops with paper-thin walls. Pneumatosis intestinalis (gas in bowel wall - transmural infarction). Mesenteric venous gas. No portal venous gas yet. Free fluid in abdomen. ECG: Atrial fibrillation with rapid ventricular rate (135 bpm). No acute ST changes. 2D Echo: Mitral stenosis (valve area 1.2 cm2), left atrial enlargement (5.2 cm), left atrial thrombus suspected.",
    "diagnosis": "Acute mesenteric ischemia (arterial embolism to SMA) secondary to atrial fibrillation with rheumatic mitral stenosis, with bowel infarction and peritonitis",
    "differentials": ["Acute mesenteric ischemia (arterial embolism)", "Acute mesenteric ischemia (arterial thrombosis)", "Mesenteric venous thrombosis", "Non-occlusive mesenteric ischemia (NOMI)", "Perforated peptic ulcer", "Acute pancreatitis", "Strangulated intestinal obstruction", "Ruptured abdominal aortic aneurysm"],
    "learning_points": [
      "Pain out of proportion to physical findings is the hallmark of acute mesenteric ischemia - must have high index of suspicion in elderly with AF, valvular heart disease, or atherosclerosis",
      "SMA embolism (50% of cases): Emboli lodge 3-5 cm from SMA origin (distal to middle colic artery origin), sparing proximal jejunum and colon. Source: AF, valvular disease, LV thrombus",
      "SMA thrombosis (25%): Occurs at SMA origin (atherosclerotic), often preceded by chronic mesenteric ischemia (intestinal angina - postprandial pain, food fear, weight loss)",
      "CT angiography is the gold standard (sensitivity >95%). Key findings: SMA filling defect, bowel wall non-enhancement, pneumatosis intestinalis, mesenteric/portal venous gas",
      "Elevated serum lactate, LDH, phosphate, and metabolic acidosis indicate bowel infarction - mandate emergent surgery",
      "Management: Emergent laparotomy with resection of gangrenous bowel + embolectomy/thrombectomy. If no peritonitis: consider endovascular intervention (catheter-directed thrombolysis/thrombectomy). Second-look laparotomy at 24-48 hours to assess bowel viability"
    ],
    "india_context": "Rheumatic heart disease remains common in India (prevalence 2-3/1000) and is a significant source of cardioembolism. Poor warfarin compliance is a major problem due to need for regular INR monitoring (limited lab access in rural UP). Acute mesenteric ischemia has high mortality (60-80%) due to delayed diagnosis - high index of suspicion is critical. CT angiography is now available at most tertiary centers in India. Vascular surgery/interventional radiology capability is limited to major teaching hospitals. In India, the combination of RHD, AF, and poor anticoagulation compliance creates a high-risk population for SMA embolism."
  }
]
