[
  {
    "id": "HEM-001",
    "title": "Severe Iron Deficiency Anemia in a Young Woman with Menorrhagia",
    "specialty": "hematology",
    "difficulty": "beginner",
    "source": "JAPI Case Reports - Iron Deficiency Anemia in Indian Women",
    "demographics": {"age": 22, "gender": "Female", "location": "Lucknow, Uttar Pradesh"},
    "chief_complaint": "Progressive fatigue, breathlessness on exertion, and pica for 4 months",
    "presentation": "A 22-year-old unmarried college student from Lucknow presents with progressive fatigue, exertional dyspnea, and palpitations for 4 months. She reports cravings for ice and raw rice (pica) for the past 2 months. She has heavy menstrual bleeding lasting 8-10 days per cycle with passage of clots, soaking through 6-8 pads per day. She is a strict vegetarian and has poor dietary intake due to academic stress. She noticed brittle nails and hair loss over the past 3 months.",
    "vital_signs": {"bp": "100/60", "hr": 112, "rr": 22, "temp": 36.8, "spo2": 97},
    "history": "Menorrhagia since menarche at age 13, worsened over the past year with cycles lasting 8-10 days and passage of large clots. No intermenstrual bleeding. Progressive fatigue limiting her ability to attend college. Exertional dyspnea on climbing one flight of stairs (previously could climb three). Pica - craving for ice (pagophagia) and raw rice for 2 months. Hair fall and brittle, spoon-shaped nails noted. Strict lacto-vegetarian diet with minimal green leafy vegetables. No history of bleeding from other sites. No worm infestation symptoms. Family history: mother also anemic and treated with iron tablets intermittently. No blood transfusion history.",
    "physical_exam": "Severe pallor of conjunctivae, nail beds, palms, and tongue. Koilonychia (spoon-shaped nails) in both hands. Angular stomatitis and glossitis (smooth, depapillated tongue). Mild atrophic changes of oral mucosa. Hair thin and brittle. No icterus. No lymphadenopathy. No hepatosplenomegaly. Cardiovascular: Tachycardia, hyperdynamic precordium, ejection systolic flow murmur grade 3/6 at left sternal border, venous hum in the neck. Respiratory: Clear. Abdomen: Soft, non-tender, no organomegaly. No pedal edema.",
    "investigations": "CBC: Hb 4.8 g/dL, MCV 62 fL, MCH 18 pg, MCHC 26 g/dL, RDW 22%, WBC 6800/cumm, Platelets 4.5 lakh/cumm (reactive thrombocytosis). Peripheral smear: Severe microcytic hypochromic anemia with anisopoikilocytosis, pencil cells, target cells, occasional elliptocytes. Iron studies: Serum iron 12 mcg/dL (low), TIBC 480 mcg/dL (high), transferrin saturation 2.5% (very low), serum ferritin 3 ng/mL (severely depleted). Reticulocyte count: 0.5% (low for degree of anemia). Stool occult blood: Negative. Thyroid profile: Normal. Pelvic ultrasound: Bulky uterus, no fibroids or polyps. Uterine artery Doppler: Normal. Coagulation profile: PT, aPTT, bleeding time - all normal.",
    "diagnosis": "Severe iron deficiency anemia secondary to menorrhagia and poor dietary iron intake",
    "differentials": ["Iron deficiency anemia", "Thalassemia trait (beta-thalassemia minor)", "Anemia of chronic disease", "Sideroblastic anemia", "Combined deficiency anemia (iron + B12/folate)"],
    "learning_points": [
      "India has the highest prevalence of iron deficiency anemia globally; NFHS-5 reports 57% of women aged 15-49 are anemic",
      "Pica (pagophagia, geophagia) is a specific symptom of iron deficiency and resolves with iron supplementation",
      "Koilonychia, angular stomatitis, glossitis, and Plummer-Vinson syndrome (esophageal webs) are classic findings of severe iron deficiency",
      "Iron studies interpretation: low ferritin (<15 ng/mL) is the most sensitive and specific test for iron deficiency; transferrin saturation <16% confirms iron-deficient erythropoiesis",
      "Severe anemia (Hb <5 g/dL) with hemodynamic compromise warrants packed RBC transfusion; parenteral iron (IV ferric carboxymaltose) allows rapid repletion",
      "FOGSI guidelines recommend screening all Indian women for anemia at first gynecological visit and managing menorrhagia to prevent chronic iron depletion"
    ],
    "india_context": "Iron deficiency anemia is the most prevalent nutritional deficiency in India, disproportionately affecting women of reproductive age. Vegetarian dietary patterns, low bioavailability of non-heme iron, high phytate content in Indian diets, and cultural stigma around discussing menstrual health contribute to delayed diagnosis. The Government of India's Anemia Mukt Bharat programme provides weekly iron-folic acid supplementation to adolescent girls and women. NFHS-5 (2019-21) data shows anemia prevalence remains alarmingly high despite multiple national programs."
  },
  {
    "id": "HEM-002",
    "title": "Sickle Cell Disease with Vaso-Occlusive Crisis in a Tribal Adolescent",
    "specialty": "hematology",
    "difficulty": "intermediate",
    "source": "Indian Journal of Hematology and Blood Transfusion - Sickle Cell Disease in Central India",
    "demographics": {"age": 16, "gender": "Male", "location": "Nagpur, Maharashtra"},
    "chief_complaint": "Severe bone pain in both legs and lower back with fever for 2 days",
    "presentation": "A 16-year-old tribal (Gond community) boy from Gadchiroli district, Maharashtra, is brought to the emergency department at a tertiary hospital in Nagpur with severe bilateral leg pain, lower back pain, and fever for 2 days. He is known to have sickle cell disease (HbSS) diagnosed at age 6 during a community screening camp. He has had multiple prior vaso-occlusive crises (4-5 per year) and one episode of acute chest syndrome at age 12. He was on hydroxyurea 15 mg/kg/day but has been non-compliant for the past 3 months after supplies ran out at the local PHC. The current crisis was precipitated by a recent upper respiratory tract infection and dehydration during agricultural work in the fields.",
    "vital_signs": {"bp": "105/70", "hr": 120, "rr": 24, "temp": 38.8, "spo2": 93},
    "history": "Sickle cell disease (HbSS) diagnosed at age 6 through a tribal screening programme. Multiple hospitalizations for vaso-occlusive crises since childhood, approximately 4-5 per year. Previous episodes have involved long bones, back, and one episode of dactylitis at age 3. Acute chest syndrome at age 12 requiring blood transfusion and antibiotics. Hydroxyurea started at age 10 (15 mg/kg/day) but non-compliant for 3 months. No history of stroke or avascular necrosis. Currently experiencing severe pain (10/10) in bilateral tibiae, femora, and lumbar spine. Fever for 2 days, preceded by cough and rhinorrhea. Was working in fields in hot weather, drank less water. No hematuria. No priapism. Family history: mother is sickle cell trait (HbAS), father is sickle cell trait (HbAS), elder sister is HbSS and also on hydroxyurea.",
    "physical_exam": "Ill-appearing, writhing in pain. Icteric sclera. Moderate pallor. No cyanosis. Tenderness over bilateral tibial shafts, bilateral femora, and lumbar vertebrae without swelling or erythema. No joint effusions. Cardiovascular: Tachycardia, systolic flow murmur grade 2/6. Respiratory: Bilateral air entry equal, no crepitations (no acute chest syndrome currently). Abdomen: Splenomegaly absent (autosplenectomy - spleen was enlarged previously, last documented as non-palpable at age 11). Liver palpable 3 cm below costal margin. No ascites. Chronic leg ulcer (2x2 cm, clean) over left medial malleolus. Growth: Short stature (below 3rd centile), delayed puberty (Tanner stage 2).",
    "investigations": "CBC: Hb 6.2 g/dL (baseline Hb 7.5), WBC 18500/cumm (neutrophilic leukocytosis), Platelets 4.2 lakh. Reticulocyte count: 12% (appropriate for hemolysis). Peripheral smear: Sickle cells, target cells, Howell-Jolly bodies (functional asplenia), polychromasia, nucleated RBCs. LDH: 580 U/L (elevated). Indirect bilirubin: 4.2 mg/dL. Haptoglobin: Undetectable. Hb electrophoresis (prior): HbS 82%, HbF 8%, HbA2 3.5%, HbA 0%. Blood culture: Sent (pending). CRP: 68 mg/L. CXR: No infiltrates (rules out acute chest syndrome currently). Renal function: Creatinine 0.8, urine specific gravity 1.005 (hyposthenuria from renal medullary damage). Urine: No RBCs. Ferritin: 280 ng/mL (iron loaded from transfusions). Transcranial Doppler (prior report): Normal velocities.",
    "diagnosis": "Sickle cell disease (HbSS) with acute vaso-occlusive crisis precipitated by infection and dehydration",
    "differentials": ["Vaso-occlusive crisis of sickle cell disease", "Acute osteomyelitis (Salmonella or Staphylococcus)", "Acute chest syndrome (evolving)", "Splenic sequestration crisis", "Aplastic crisis (parvovirus B19)"],
    "learning_points": [
      "Sickle cell disease is highly prevalent in tribal populations of central India (Maharashtra, Chhattisgarh, Madhya Pradesh, Odisha, Jharkhand) with HbS gene frequency of 5-35% in some tribal groups",
      "Vaso-occlusive crisis management: aggressive IV hydration, multimodal analgesia (NSAIDs + opioids as per WHO pain ladder), oxygen if SpO2 <95%, treat precipitating infection, and incentive spirometry to prevent acute chest syndrome",
      "Hydroxyurea is the mainstay of disease-modifying therapy in SCD - it increases HbF production, reduces crisis frequency by 50%, and decreases mortality; ICMR recommends starting at >9 months of age in HbSS",
      "Howell-Jolly bodies on peripheral smear indicate functional asplenia; these patients require vaccination against encapsulated organisms (Pneumococcus, Meningococcus, H. influenzae) and daily penicillin prophylaxis",
      "Hyposthenuria (inability to concentrate urine) is one of the earliest organ complications of SCD due to sickling in the renal medullary vasa recta",
      "The Government of India and several state governments (Maharashtra, Chhattisgarh, MP) have launched sickle cell screening and management programmes; the National Sickle Cell Anemia Elimination Mission was launched in 2023"
    ],
    "india_context": "India has the second-highest burden of sickle cell disease globally after Sub-Saharan Africa. The disease is concentrated among tribal (Scheduled Tribe) and certain Scheduled Caste populations in central India. The HbS gene is believed to have been selected due to malaria endemicity in these regions. In 2023, the Government of India launched the National Sickle Cell Anemia Elimination Mission targeting universal screening in tribal areas, early diagnosis through newborn screening, and access to hydroxyurea. State-level programs in Maharashtra and Chhattisgarh have established sickle cell clinics at district hospitals. Challenges include limited access to hydroxyurea at PHC level, poor compliance due to distance from health facilities, and limited availability of matched blood for transfusion in remote tribal areas."
  },
  {
    "id": "HEM-003",
    "title": "Immune Thrombocytopenic Purpura (ITP) in a Child Presenting with Purpura and Mucosal Bleeding",
    "specialty": "hematology",
    "difficulty": "beginner",
    "source": "Indian Pediatrics - Management of ITP in Indian Children",
    "demographics": {"age": 5, "gender": "Female", "location": "Jaipur, Rajasthan"},
    "chief_complaint": "Sudden onset of bruising all over body and bleeding from gums for 3 days",
    "presentation": "A 5-year-old girl from Jaipur is brought by her parents with sudden onset of purpuric spots and bruises over the entire body for 3 days. Her mother noticed red-purple spots first appearing on the legs, then spreading to the trunk and arms. She had bleeding from gums while brushing teeth and one episode of epistaxis (self-limiting). She had a viral upper respiratory tract infection 2 weeks ago that resolved spontaneously. She is otherwise an active, playful child with no prior bleeding history. No family history of bleeding disorders.",
    "vital_signs": {"bp": "95/60", "hr": 98, "rr": 20, "temp": 37.1, "spo2": 99},
    "history": "Previously healthy child with normal developmental milestones. Viral URTI (runny nose, low-grade fever, cough) 2 weeks ago, lasted 5 days, no antibiotics given. Three days ago, mother noticed multiple purplish spots on both legs after the child was playing. Over the next 2 days, new spots appeared on trunk and arms. Gum bleeding noticed while brushing. One episode of epistaxis lasting 5 minutes, stopped with pressure. No hematemesis, melena, or hematuria. No blood in stools. No joint swelling or bone pain. Immunizations: Up to date as per UIP schedule. No recent vaccination in last 4 weeks. Diet: Normal, adequate. No exposure to drugs, chemicals, or toxins. No weight loss or night sweats. No family history of bleeding disorders, autoimmune diseases, or malignancies.",
    "physical_exam": "Active, playful child, not in distress. Multiple petechiae and purpuric macules scattered over bilateral lower extremities, trunk, and upper extremities. Several ecchymoses (2-5 cm) over shins and forearms. Wet purpura: Blood-filled blisters on buccal mucosa (hemorrhagic bullae). No pallor (Hb adequate). No icterus. No lymphadenopathy. No hepatomegaly. No splenomegaly (important - spleen NOT palpable). No joint swelling or tenderness. No signs of chronic illness. No skeletal abnormalities. Fundoscopy: No retinal hemorrhages.",
    "investigations": "CBC: Hb 11.8 g/dL, WBC 8200/cumm (normal differential), Platelets 8000/cumm (severely low, isolated thrombocytopenia). Peripheral smear: Markedly reduced platelet count, platelets that are present are large (megathrombocytes indicating peripheral destruction), RBC and WBC morphology completely normal, no blasts, no fragmented RBCs. PT: 13 seconds (normal), aPTT: 30 seconds (normal), fibrinogen: 280 mg/dL (normal). Reticulocyte count: 1.2% (normal). Blood group and crossmatch: Done. CRP: 4 mg/L (normal). LFT: Normal. Renal function: Normal. ANA: Negative. Direct Coombs test: Negative. HIV and HCV serology: Negative. Bone marrow aspiration (performed to rule out leukemia given severe thrombocytopenia): Megakaryocytes increased in number with normal morphology, no abnormal cells or blasts, erythroid and myeloid series normal.",
    "diagnosis": "Acute immune thrombocytopenic purpura (ITP) - newly diagnosed, severe",
    "differentials": ["Immune thrombocytopenic purpura (ITP)", "Acute lymphoblastic leukemia (ALL)", "Aplastic anemia", "Dengue fever with thrombocytopenia", "Hemolytic uremic syndrome (HUS)"],
    "learning_points": [
      "ITP in children is typically acute, self-limiting (80% resolve within 6 months), and often follows a viral infection; it is the most common cause of isolated thrombocytopenia in an otherwise well child",
      "Isolated thrombocytopenia with normal Hb, WBC, and peripheral smear morphology is the hallmark of ITP; presence of blasts, abnormal WBC, anemia, or splenomegaly should prompt evaluation for leukemia",
      "Bone marrow examination is not routinely required in typical childhood ITP per ASH 2019 and IAP guidelines, but should be considered before starting steroids, in atypical presentations, or when leukemia cannot be excluded clinically",
      "Treatment of severe ITP (platelets <20,000 with significant mucosal bleeding): first-line is IV methylprednisolone (2 mg/kg/day for 3-5 days) or IVIG (0.8-1 g/kg single dose); IVIG causes a faster platelet rise",
      "Wet purpura (hemorrhagic bullae in the oral cavity) indicates higher bleeding risk and is an indication for treatment even in otherwise watch-and-wait scenarios",
      "In the Indian context, dengue must always be excluded in a child with acute thrombocytopenia, especially during monsoon season; dengue NS1 antigen and IgM should be sent"
    ],
    "india_context": "In India, the evaluation of acute thrombocytopenia in children must always include exclusion of dengue fever, which is endemic in most Indian cities and can present with isolated severe thrombocytopenia. The Indian Academy of Pediatrics (IAP) hematology-oncology chapter has published guidelines for ITP management adapted to Indian settings. Bone marrow examination is more commonly performed in Indian practice than in Western settings, partly due to higher prevalence of acute leukemia in the differential and medico-legal considerations. Access to IVIG is limited in many government hospitals due to cost; hence, corticosteroids remain the first-line therapy in most Indian centers. Anti-D immunoglobulin is an alternative in Rh-positive, non-splenectomized patients."
  },
  {
    "id": "HEM-004",
    "title": "Disseminated Intravascular Coagulation Complicating Gram-Negative Sepsis",
    "specialty": "hematology",
    "difficulty": "advanced",
    "source": "Indian Journal of Critical Care Medicine - DIC in Sepsis",
    "demographics": {"age": 55, "gender": "Male", "location": "Kolkata, West Bengal"},
    "chief_complaint": "High-grade fever, altered sensorium, and bleeding from IV sites for 1 day",
    "presentation": "A 55-year-old diabetic man from Kolkata is referred from a nursing home to the ICU of a tertiary hospital with high-grade fever, rigors, altered sensorium, and oozing of blood from peripheral IV cannula sites and urinary catheter for 1 day. He had undergone a transurethral resection of the prostate (TURP) 3 days ago at the nursing home. Post-operatively, he developed fever on day 2, which was initially managed with empirical antibiotics (ceftriaxone). Over the next 24 hours, he became progressively drowsy, hypotensive, and developed bleeding from multiple sites. He has a 15-year history of type 2 diabetes mellitus on metformin and glimepiride with poor glycemic control (last HbA1c 9.2%).",
    "vital_signs": {"bp": "75/40", "hr": 136, "rr": 32, "temp": 39.6, "spo2": 89},
    "history": "Type 2 diabetes mellitus for 15 years, poorly controlled (HbA1c 9.2%), on metformin 1g BD and glimepiride 2mg OD. Hypertension for 8 years on amlodipine 5mg. Benign prostatic hyperplasia with urinary retention - underwent TURP 3 days ago at a private nursing home. Post-op day 1 was uneventful. Day 2: Developed high-grade fever (39.5 C) with rigors, started on ceftriaxone 2g IV. Day 3: Became drowsy, blood pressure dropped to 80/50, developed oozing from IV sites, around the urinary catheter, and a large ecchymosis at the surgical site. Referred to tertiary care. No prior bleeding disorder. No liver disease. No anticoagulant or antiplatelet drugs.",
    "physical_exam": "Critically ill, drowsy (GCS 10 - E3V3M4), febrile, diaphoretic. Skin: Multiple ecchymoses over trunk and extremities, petechiae on chest wall, oozing from all peripheral IV cannula sites. Purpura over fingertips bilaterally (acral purpura suggesting microvascular thrombosis). Mottled skin over knees. Cardiovascular: Tachycardia, low-volume pulse, cold peripheries, CRT >4 seconds. Respiratory: Tachypneic, bilateral basal crepitations. Abdomen: Soft, mild distension, no guarding. Urinary catheter draining frankly bloody urine. Surgical site (perineum): Oozing. No meningeal signs.",
    "investigations": "CBC: Hb 8.2 g/dL (was 12.5 pre-op), WBC 22000/cumm (neutrophils 88%, toxic granulations, band forms 15%), Platelets 28000/cumm (was 2.1 lakh pre-op). Coagulation: PT 28 seconds (control 13), INR 2.4, aPTT 62 seconds (control 32), thrombin time 24 seconds (control 15). Fibrinogen: 80 mg/dL (severely low, normal 200-400). D-dimer: >10,000 ng/mL FEU (markedly elevated). Peripheral smear: Schistocytes (fragmented RBCs - 4-5 per HPF), polychromasia, thrombocytopenia, left shift with toxic changes. ISTH DIC score: 7 (overt DIC - score >=5). Blood cultures (x2): Sent - subsequently grew Escherichia coli (ESBL-producing). Urine culture: E. coli (same sensitivity). Procalcitonin: 38 ng/mL (markedly elevated). Lactate: 5.8 mmol/L (severe). RBS: 380 mg/dL. ABG: pH 7.22, pCO2 28, HCO3 12, base deficit -14 (severe metabolic acidosis). Creatinine: 3.4 mg/dL (AKI stage 2). LFT: Bilirubin 4.5, AST 220, ALT 180 (shock liver). LDH: 850 U/L.",
    "diagnosis": "Disseminated intravascular coagulation secondary to Gram-negative (E. coli) urosepsis with septic shock and multi-organ dysfunction",
    "differentials": ["DIC secondary to sepsis", "Thrombotic thrombocytopenic purpura (TTP)", "Heparin-induced thrombocytopenia (HIT)", "Severe liver dysfunction with coagulopathy", "Major hemorrhage with consumptive coagulopathy"],
    "learning_points": [
      "DIC is always secondary to an underlying condition; sepsis (especially Gram-negative) is the most common cause, followed by obstetric complications, malignancy, and trauma",
      "ISTH DIC scoring system: Platelets (<50 = 2 points), D-dimer (strong increase = 3 points), prolonged PT (3-6 sec = 1, >6 sec = 2 points), fibrinogen (<1 g/L = 1 point); score >=5 = overt DIC",
      "Schistocytes on peripheral smear are a hallmark of DIC, resulting from mechanical shearing of RBCs through fibrin strands in the microvasculature (microangiopathic hemolytic anemia)",
      "Management of DIC: treat the underlying cause (antibiotics and source control for sepsis), replacement therapy (FFP for coagulation factors, cryoprecipitate for fibrinogen <1.5 g/L, platelet transfusion if <20,000 or actively bleeding), and supportive care",
      "Anticoagulation with heparin is NOT indicated in sepsis-associated DIC with active bleeding; it may be considered in DIC with predominantly thrombotic manifestations (acral ischemia, purpura fulminans)",
      "In India, ESBL-producing Gram-negative organisms are extremely common; initial empiric coverage with carbapenems (meropenem) is often necessary in hospital-acquired severe sepsis"
    ],
    "india_context": "Sepsis-associated DIC is commonly encountered in Indian ICUs, particularly following surgical procedures with poor infection control. ESBL-producing E. coli and Klebsiella are alarmingly prevalent in Indian hospitals, contributing to India's high antimicrobial resistance burden. The Indian Society of Critical Care Medicine (ISCCM) guidelines for sepsis management emphasize early goal-directed therapy and rational antibiotic use. Post-TURP urosepsis is a recognized complication, especially in diabetic patients. Availability of blood products (FFP, cryoprecipitate, platelets) can be challenging in smaller centers, necessitating timely referral. The ICMR antimicrobial resistance surveillance network (AMR) data guides empiric antibiotic choices across Indian hospitals."
  },
  {
    "id": "HEM-005",
    "title": "Megaloblastic Anemia Due to Vitamin B12 Deficiency in a Vegetarian",
    "specialty": "hematology",
    "difficulty": "intermediate",
    "source": "JAPI - Vitamin B12 Deficiency in Indian Vegetarians",
    "demographics": {"age": 45, "gender": "Male", "location": "Ahmedabad, Gujarat"},
    "chief_complaint": "Progressive weakness, tingling and numbness in both feet, and difficulty walking for 6 months",
    "presentation": "A 45-year-old Jain businessman from Ahmedabad presents with progressive generalized weakness for 6 months and tingling and numbness (paresthesia) in both feet ascending to the knees for 4 months. He has noticed difficulty walking in the dark and has had two falls in the past month. His wife reports that he has become increasingly forgetful and irritable over the past 3 months. He is a strict vegan (Jain dietary practices - no eggs, no root vegetables, no meat or fish). He has mild intermittent diarrhea. He also reports his tongue being sore intermittently. He denies alcohol intake.",
    "vital_signs": {"bp": "130/80", "hr": 88, "rr": 18, "temp": 37.0, "spo2": 98},
    "history": "Strict Jain vegan diet for his entire life - no meat, fish, eggs, and limited dairy. Progressive fatigue and weakness for 6 months, impacting his business activities. Paresthesia (tingling, burning, pins-and-needles) in bilateral feet for 4 months, gradually ascending to knees. Difficulty walking, especially in the dark - unsteady gait, has had falls. Forgetfulness: difficulty remembering names, recent events, and business appointments. Irritability and mood changes noticed by family. Intermittent glossitis (sore, painful tongue). Mild diarrhea (2-3 loose stools/day, no blood or mucus). No significant weight loss. No jaundice noticed. No gastric surgery or ileal resection. No medication use (no metformin, PPIs, or H2 blockers). No symptoms suggestive of hypothyroidism. Family history: Non-contributory. No history of autoimmune diseases.",
    "physical_exam": "Mild pallor with a distinct lemon-yellow tinge to the skin (combination of pallor and mild icterus). Glossitis: Smooth, beefy-red tongue with loss of papillae (Hunter glossitis). Mild icterus in sclera. No lymphadenopathy. No hepatosplenomegaly. Neurological examination: Higher functions - MMSE 24/30 (mild cognitive impairment, deficits in recall and attention). Cranial nerves: Normal. Motor: Tone normal, power 4/5 in both lower limbs, normal in upper limbs. Sensory: Impaired vibration sense and joint position sense in bilateral lower limbs up to the knees, impaired light touch below knees. Romberg test: Positive. Gait: Sensory ataxia (wide-based, stamping gait, worse with eyes closed). Deep tendon reflexes: Ankle jerks absent, knee jerks diminished, plantar response extensor bilaterally (upper motor neuron sign). This combination of absent ankle jerks (peripheral neuropathy) with extensor plantars (posterior and lateral column involvement) is classic for subacute combined degeneration of the cord.",
    "investigations": "CBC: Hb 7.4 g/dL, MCV 118 fL (markedly macrocytic), MCH 38 pg, WBC 3200/cumm (mild leukopenia), Platelets 1.1 lakh (mild thrombocytopenia - pancytopenia). Peripheral smear: Oval macrocytes, hypersegmented neutrophils (>5% with 5 lobes or any with 6 lobes), anisopoikilocytosis, Howell-Jolly bodies, Cabot rings, basophilic stippling. Reticulocyte count: 0.8% (inappropriately low). Serum Vitamin B12: 52 pg/mL (severely low; normal 200-900). Serum folate: 8.2 ng/mL (normal). Serum homocysteine: 68 micromol/L (markedly elevated; normal <15). Serum methylmalonic acid: 3200 nmol/L (markedly elevated; normal <400). LDH: 1850 U/L (markedly elevated - ineffective erythropoiesis). Indirect bilirubin: 2.8 mg/dL (intramedullary hemolysis). Iron studies: Normal. Anti-intrinsic factor antibodies: Negative. Anti-parietal cell antibodies: Negative. Upper GI endoscopy: Normal gastric mucosa, no atrophy. MRI spine: Hyperintense signal in the posterior columns of the cervical and thoracic spinal cord on T2-weighted images (inverted V sign), consistent with subacute combined degeneration. Nerve conduction study: Sensorimotor axonal polyneuropathy in both lower limbs.",
    "diagnosis": "Megaloblastic anemia with subacute combined degeneration of the spinal cord due to dietary Vitamin B12 deficiency",
    "differentials": ["Vitamin B12 deficiency (dietary)", "Pernicious anemia (autoimmune B12 deficiency)", "Folate deficiency megaloblastic anemia", "Myelodysplastic syndrome", "Copper deficiency myelopathy"],
    "learning_points": [
      "Vitamin B12 deficiency is extremely common in India due to the high prevalence of vegetarianism; studies report 47-75% of Indian vegetarians have low B12 levels",
      "The neurological manifestations of B12 deficiency can occur without significant anemia; classic subacute combined degeneration (SACD) involves posterior columns (loss of vibration and position sense), lateral corticospinal tracts (UMN signs), and peripheral nerves (absent ankle jerks)",
      "The combination of absent ankle jerks (LMN - peripheral neuropathy) with extensor plantars (UMN - corticospinal tract involvement) is a classic exam finding in SACD and a frequently tested NEET-PG question",
      "Hypersegmented neutrophils (>=5 lobes in >5% of neutrophils or any with >=6 lobes) on peripheral smear are the earliest and most specific finding of megaloblastic anemia",
      "Both homocysteine and methylmalonic acid are elevated in B12 deficiency; in folate deficiency, only homocysteine is elevated (MMA is normal) - this distinction is high-yield for NEET-PG",
      "Treatment: IM hydroxocobalamin or cyanocobalamin 1000 mcg daily for 7 days, then weekly for 4 weeks, then monthly lifelong; neurological recovery depends on duration of symptoms - treat early"
    ],
    "india_context": "India has one of the world's highest rates of Vitamin B12 deficiency, driven by the large vegetarian population. Jain, Brahmin, and Vaishnav communities following strict vegetarian or vegan diets are particularly affected. A landmark study from Pune (JAPI 2012) showed 75% prevalence of B12 deficiency in vegetarian Indians. B12 is found naturally only in animal-source foods (meat, fish, eggs, dairy). Fortification of staple foods with B12 has been recommended by ICMR but is not yet widely implemented. Many Indian patients present late with neuropsychiatric complications because the symptoms are attributed to aging, diabetes, or stress. ICMR-NIN dietary guidelines for Indians recommend B12 supplementation for strict vegetarians."
  },
  {
    "id": "HEM-006",
    "title": "Chronic Myeloid Leukemia Presenting with Massive Splenomegaly",
    "specialty": "hematology",
    "difficulty": "advanced",
    "source": "Indian Journal of Medical and Paediatric Oncology - CML in India",
    "demographics": {"age": 38, "gender": "Male", "location": "Chennai, Tamil Nadu"},
    "chief_complaint": "Dragging sensation in the left abdomen, early satiety, and weight loss for 3 months",
    "presentation": "A 38-year-old auto-rickshaw driver from Chennai presents with a progressively increasing dragging heaviness in the left upper abdomen for 3 months. He reports early satiety after eating small meals, unintentional weight loss of 8 kg over 3 months, drenching night sweats, and low-grade evening rise of temperature. He noticed his abdomen getting progressively distended. He also reports easy fatigue and exertional dyspnea. He was incidentally found to have a markedly elevated WBC count (1.8 lakh/cumm) when he visited a local clinic for fever. He was referred to a tertiary cancer center for further evaluation.",
    "vital_signs": {"bp": "120/75", "hr": 92, "rr": 20, "temp": 37.8, "spo2": 97},
    "history": "Dragging heaviness in the left abdomen for 3 months, progressively worsening. Early satiety - can only eat half his usual meal. Weight loss of 8 kg in 3 months (from 68 to 60 kg). Night sweats (drenching, requiring change of clothes) for 2 months. Low-grade fever (evening rise) for 2 months, no rigors. Progressive fatigue and reduced exercise tolerance. No bleeding manifestations. No bone pain. No headache or visual disturbance. No lymph node swelling. Visited local clinic for fever workup - found to have WBC 1.8 lakh, referred for further evaluation. No significant past medical history. No family history of cancer. Smokes 5 beedis/day for 15 years. Occasional alcohol (toddy).",
    "physical_exam": "Thin built, mild pallor, no icterus. No significant lymphadenopathy. Sternal tenderness present on palpation (marrow expansion). Abdomen: Massively enlarged spleen - palpable 18 cm below the left costal margin, firm, non-tender, crossing the midline and extending into the right iliac fossa, splenic notch palpable. Liver palpable 4 cm below the right costal margin, firm, smooth. No ascites. Cardiovascular: Normal. Respiratory: Clear. No skin infiltration or chloromas. Fundoscopy: Dilated retinal veins, no papilledema (hyperviscosity not clinically significant yet).",
    "investigations": "CBC: Hb 9.2 g/dL, WBC 1,82,000/cumm, Platelets 5.8 lakh (thrombocytosis). WBC differential: Myelocytes 18%, metamyelocytes 12%, band forms 8%, neutrophils 40%, basophils 6%, eosinophils 4%, monocytes 2%, blasts 2%, lymphocytes 8% (entire spectrum of granulocytic maturation - myelocyte bulge). Peripheral smear: Marked leukocytosis with the full spectrum of myeloid maturation, basophilia, occasional nucleated RBCs. LAP (Leukocyte Alkaline Phosphatase) score: 10 (markedly low; normal 30-150) - classic finding in CML. Bone marrow aspiration: Markedly hypercellular with granulocytic hyperplasia, myeloid:erythroid ratio 15:1, basophilia, blasts 3% (chronic phase). Bone marrow trephine biopsy: 100% cellularity, marked granulocytic hyperplasia, increased reticulin. Cytogenetics (bone marrow karyotyping): 46,XY,t(9;22)(q34;q11.2) - Philadelphia chromosome positive in 100% of metaphases. FISH: BCR-ABL1 fusion positive in 96% of cells. RT-qPCR for BCR-ABL1 (p210, e13a2/b2a2 transcript): Positive, 85% IS (International Scale). Serum uric acid: 9.8 mg/dL (elevated due to high cell turnover). LDH: 620 U/L. B12 level: 1800 pg/mL (elevated - due to transcobalamin from granulocytes). Sokal score: 1.2 (high risk). EUTOS long-term survival score: High risk.",
    "diagnosis": "Chronic myeloid leukemia, chronic phase, Philadelphia chromosome positive (BCR-ABL1 positive) with massive splenomegaly - Sokal high risk",
    "differentials": ["Chronic myeloid leukemia (CML)", "Chronic myelomonocytic leukemia (CMML)", "Myelofibrosis with myeloid metaplasia", "Leukemoid reaction (infection/inflammation)", "Chronic neutrophilic leukemia"],
    "learning_points": [
      "CML is characterized by the Philadelphia chromosome t(9;22) resulting in the BCR-ABL1 fusion gene (p210 protein); this is present in >95% of CML cases and is the diagnostic hallmark",
      "Peripheral smear in CML shows the entire spectrum of myeloid maturation (blast to mature neutrophil) with a myelocyte bulge and basophilia; LAP score is characteristically LOW (vs. leukemoid reaction where LAP is HIGH)",
      "Massive splenomegaly (>20 cm below costal margin or crossing midline) differential: CML, myelofibrosis, chronic malaria, kala-azar, thalassemia major, Gaucher disease - a high-yield NEET-PG topic",
      "Imatinib mesylate (400 mg/day) is the first-line TKI for chronic phase CML; second-generation TKIs (dasatinib, nilotinib) are used for imatinib resistance/intolerance or upfront in high-risk patients",
      "Treatment response monitoring is done by RT-qPCR for BCR-ABL1 on the International Scale (IS): major molecular response (MMR) = BCR-ABL1 <=0.1% IS at 12 months is the key milestone",
      "CML phases: Chronic (<10% blasts), Accelerated (10-19% blasts, basophils >20%, persistent thrombocytopenia, clonal evolution), Blast crisis (>=20% blasts) - each carries different prognosis"
    ],
    "india_context": "CML accounts for approximately 30-40% of adult leukemias in India, a higher proportion than in Western countries. Indian CML patients tend to present at a younger age (median 38-40 years vs. 55-60 in the West) and with higher Sokal risk scores and larger spleens, likely due to delayed diagnosis. Generic imatinib mesylate is available in India at significantly reduced cost (through the Glivec International Patient Assistance Program and Indian generics), revolutionizing CML survival. However, adherence to lifelong TKI therapy, regular molecular monitoring (RT-qPCR availability limited to major centers), and management of treatment resistance remain challenges. Indian CML Study Group data shows that outcomes are comparable to global benchmarks when adherence is maintained."
  },
  {
    "id": "HEM-007",
    "title": "Hemophilia A Presenting with Acute Hemarthrosis of the Knee",
    "specialty": "hematology",
    "difficulty": "intermediate",
    "source": "Hemophilia Federation of India - Clinical Management Guidelines",
    "demographics": {"age": 12, "gender": "Male", "location": "Delhi, NCR"},
    "chief_complaint": "Sudden painful swelling of the right knee after minor fall during play",
    "presentation": "A 12-year-old boy from South Delhi presents to the emergency department with acute painful swelling of the right knee that started 4 hours ago after a minor fall while playing cricket. He is a known case of severe Hemophilia A (Factor VIII level <1%) diagnosed at age 2 when he had prolonged bleeding after circumcision. He is registered at the Hemophilia Treatment Centre (HTC) at AIIMS Delhi. He has had multiple prior hemarthroses involving both knees, right ankle, and left elbow. His right knee shows signs of chronic hemophilic arthropathy from recurrent bleeds. He is not currently on prophylactic factor replacement due to intermittent supply issues. His mother is a known carrier.",
    "vital_signs": {"bp": "110/70", "hr": 100, "rr": 20, "temp": 37.2, "spo2": 99},
    "history": "Known severe Hemophilia A (FVIII <1%) diagnosed at age 2 after prolonged post-circumcision bleeding. Family history: Maternal uncle died of intracranial hemorrhage at age 22 (suspected hemophilia, never diagnosed). Mother is an obligate carrier. One younger brother (age 8) also has severe Hemophilia A. Bleed history: First hemarthrosis at age 3 (left knee). Multiple recurrent hemarthroses since - estimated 30-40 joint bleeds. Target joints: Right knee (most frequent, approximately 15 bleeds), left elbow (8 bleeds), right ankle (6 bleeds). Previous intramuscular hematomas: iliopsoas (age 9) requiring hospitalization. No ICH (intracranial hemorrhage) to date. No inhibitor history (last tested 6 months ago - negative). Currently on episodic (on-demand) factor replacement only. Was on prophylaxis (25 IU/kg FVIII three times weekly) for 1 year (age 9-10) through a government-funded program, but supply became inconsistent. Currently receives factor only during acute bleeds. Current episode: Minor fall while playing cricket 4 hours ago. Right knee became progressively swollen and painful. Unable to bear weight. No open wound.",
    "physical_exam": "Well-nourished boy in moderate distress due to knee pain. No pallor. No jaundice. Right knee: Markedly swollen, tense, warm, held in 20 degrees of flexion (pain-free position). Ballotable effusion positive. Range of motion severely restricted due to pain (cannot extend beyond 20 degrees or flex beyond 40 degrees). Chronic changes in right knee: Fixed flexion deformity of 10 degrees (from prior bleeds), quadriceps wasting, crepitus on passive movement (hemophilic arthropathy). Left knee: Mild chronic changes, no acute bleed. Left elbow: Reduced range of motion (flexion 30-120 degrees vs. normal 0-150). Right ankle: Mild restriction of dorsiflexion. No acute bleeds in other joints. No mucosal bleeding. No intramuscular hematomas currently. Petechiae are ABSENT (hemophilia causes coagulation-type bleeding, not platelet-type bleeding).",
    "investigations": "CBC: Hb 11.0 g/dL, WBC 8400/cumm, Platelets 2.8 lakh (normal - platelet count is normal in hemophilia). Coagulation profile: PT 13 seconds (normal), INR 1.0 (normal), aPTT 78 seconds (markedly prolonged; normal 28-34), bleeding time 4 minutes (normal - BT tests primary hemostasis/platelet function which is intact). Mixing study: aPTT corrects to normal on mixing with normal pooled plasma (rules out inhibitor). Factor VIII activity: <1% (severe). Factor IX activity: 85% (normal). vWF antigen and activity: Normal (rules out von Willebrand disease type 3). Bethesda assay for FVIII inhibitors: 0 BU (no inhibitor). Right knee X-ray: Joint effusion, widened intercondylar notch, squaring of inferior patellar pole, periarticular osteopenia, early joint space narrowing (Pettersson score: 6/13 - moderate hemophilic arthropathy). Ultrasound right knee: Large hemarthrosis with synovial hypertrophy. Hepatitis B surface antigen: Negative. Anti-HCV: Negative. HIV: Negative (important to screen due to historical risk from blood products).",
    "diagnosis": "Severe Hemophilia A with acute hemarthrosis of the right knee and chronic hemophilic arthropathy",
    "differentials": ["Hemophilia A with hemarthrosis", "Hemophilia B (Christmas disease)", "Von Willebrand disease type 3 (severe)", "Acquired hemophilia (factor VIII inhibitor)", "Septic arthritis of the knee"],
    "learning_points": [
      "Hemophilia A (Factor VIII deficiency) is X-linked recessive; affects males, females are carriers; presents with deep tissue bleeding (hemarthroses, muscle hematomas, post-surgical bleeding) NOT petechiae or mucosal bleeding",
      "aPTT is prolonged in hemophilia while PT, bleeding time, and platelet count are NORMAL - this is a classic NEET-PG coagulation profile pattern; aPTT correction on mixing study rules out inhibitors",
      "Hemophilia severity classification: Severe (<1% factor activity, spontaneous bleeds), Moderate (1-5%, bleeds with minor trauma), Mild (5-40%, bleeds with significant trauma or surgery)",
      "Acute hemarthrosis management: immediate factor replacement (FVIII 40-50 IU/kg to raise level to 80-100%), RICE (rest, ice, compression, elevation), avoid aspiration unless tense hemarthrosis with neurovascular compromise, avoid NSAIDs (use COX-2 inhibitors or paracetamol)",
      "Prophylactic factor replacement (25-40 IU/kg of FVIII three times weekly) prevents hemarthrosis and arthropathy - WHO and WFH recommend primary prophylaxis starting before age 3 or after first joint bleed",
      "Emicizumab (bispecific antibody mimicking FVIII cofactor function) is a game-changer for hemophilia A prophylaxis, given subcutaneously every 1-4 weeks, effective even in patients with inhibitors"
    ],
    "india_context": "India has an estimated 100,000-200,000 persons with hemophilia, but only about 20,000 are registered with the Hemophilia Federation of India (HFI). Underdiagnosis and delayed diagnosis are major issues, especially in rural areas. The Government of India provides free factor concentrates through Hemophilia Treatment Centres (HTCs) at government hospitals, but supply is often inconsistent, forcing most patients to rely on episodic treatment rather than prophylaxis. This leads to progressive arthropathy and disability. The National Health Mission includes hemophilia treatment support in some states. Access to newer therapies like emicizumab remains extremely limited due to cost. Blood-borne virus screening (HIV, HCV, HBV) is essential as older patients may have been exposed through unscreened blood products."
  },
  {
    "id": "HEM-008",
    "title": "Aplastic Anemia in a Young Farmer with Pancytopenia",
    "specialty": "hematology",
    "difficulty": "advanced",
    "source": "Indian Journal of Hematology and Blood Transfusion - Aplastic Anemia in India",
    "demographics": {"age": 28, "gender": "Male", "location": "Vellore, Tamil Nadu"},
    "chief_complaint": "Progressive weakness, recurrent fever, and bleeding from gums for 2 months",
    "presentation": "A 28-year-old male paddy farmer from a village near Vellore, Tamil Nadu, presents with progressive weakness and fatigue for 2 months, recurrent high-grade fever with no specific focus for 6 weeks, and spontaneous bleeding from gums and multiple bruises over the body for 3 weeks. He has also noticed small red spots (petechiae) appearing on his legs. He reports heavy pesticide exposure during recent agricultural work (organophosphates and other agrochemicals) without protective equipment. He also used some unspecified herbal medications (Siddha preparations containing potentially toxic metals) for joint pains 3 months ago. He has no significant prior medical history.",
    "vital_signs": {"bp": "100/65", "hr": 110, "rr": 22, "temp": 39.2, "spo2": 96},
    "history": "Previously healthy farmer. Progressive fatigue and weakness for 2 months, limiting his ability to work in the fields. Recurrent high-grade fever (39-40 C) for 6 weeks, often with rigors, partially responding to paracetamol but recurring. Multiple courses of empirical antibiotics at the local PHC (amoxicillin, azithromycin) with no lasting improvement. Spontaneous gum bleeding for 3 weeks, especially while eating. Multiple bruises appearing with minimal or no trauma. Petechiae over lower limbs. No hematuria or melena. Occupational history: Paddy farmer, heavy exposure to organophosphate pesticides and other agrochemicals for 5 years, sprays pesticides without mask or gloves. Three months ago, took Siddha medications (herbal preparations) for knee pain from a traditional practitioner for 6 weeks - exact composition unknown (may contain heavy metals like arsenic, mercury). No prior radiation exposure. No history of hepatitis. No family history of hematological disorders. No history of recurrent infections in childhood (rules out Fanconi anemia phenotype).",
    "physical_exam": "Pallor marked. Multiple petechiae over bilateral lower extremities and trunk. Ecchymoses over forearms and thighs. Gum hypertrophy absent (rules out AML M4/M5). Gums oozing blood. Oral cavity: Multiple aphthous ulcers. Febrile with no obvious focus of infection. No lymphadenopathy (important - absence helps distinguish from leukemia/lymphoma). No hepatomegaly. No splenomegaly (important - absence of splenomegaly is characteristic of aplastic anemia). No bony tenderness. No skeletal abnormalities, short stature, or cafe-au-lait spots (rules out Fanconi anemia clinically). Fundoscopy: Bilateral retinal hemorrhages (Roth spots). Per rectum: No perianal abscess (important to check in neutropenic patients).",
    "investigations": "CBC: Hb 4.8 g/dL, WBC 1200/cumm (ANC 300 - severe neutropenia), Platelets 8000/cumm (severe thrombocytopenia). Reticulocyte count: 0.2% (corrected reticulocyte count: 0.06% - severely low, indicating marrow failure). Peripheral smear: Pancytopenia, normocytic normochromic RBCs, no abnormal cells, no blasts, no teardrop cells, no fragmented cells. ESR: 85 mm/hr. Bone marrow aspiration: Markedly hypocellular with predominance of fat spaces and lymphocytes, scattered residual hematopoietic cells, no blasts, no dysplastic features, no abnormal infiltration. Bone marrow trephine biopsy: Cellularity <10% (severely hypocellular), fat spaces replacing hematopoietic tissue, no fibrosis, no granulomas, no abnormal infiltrates. Cytogenetics (bone marrow): Normal karyotype 46,XY (no clonal abnormalities - important to rule out MDS). Flow cytometry: No aberrant blast population. PNH screen (flow cytometry for GPI-anchored proteins - CD55, CD59): Small PNH clone detected (2.5% granulocytes deficient in CD55/CD59). Chromosomal breakage study (DEB/MMC test): Negative (rules out Fanconi anemia). Viral serology: Hepatitis A IgM negative, HBsAg negative, Anti-HCV negative, HIV negative, Parvovirus B19 IgM negative, EBV and CMV IgM negative. LFT: Normal. LDH: 180 U/L (not significantly elevated). ANA: Negative. Heavy metal screen (blood): Arsenic 48 mcg/L (mildly elevated; normal <10). Serum ferritin: 1200 ng/mL (elevated - from transfusions and ineffective erythropoiesis). HLA typing: Sent for potential matched sibling donor transplant (brother is being evaluated).",
    "diagnosis": "Severe aplastic anemia (likely acquired, possibly related to environmental toxin and heavy metal exposure) with small PNH clone",
    "differentials": ["Aplastic anemia (acquired)", "Myelodysplastic syndrome (hypoplastic MDS)", "Aleukemic leukemia (acute leukemia with hypocellular marrow)", "Fanconi anemia (inherited aplastic anemia)", "Bone marrow infiltration (lymphoma, metastasis, granulomatous disease)"],
    "learning_points": [
      "Aplastic anemia is defined by pancytopenia with a hypocellular bone marrow; severe aplastic anemia (SAA) criteria require at least two of: ANC <500, platelets <20,000, reticulocyte count <20,000/cumm (or corrected <1%)",
      "In India, the incidence of aplastic anemia is 2-3 times higher than in the West; environmental factors (pesticide exposure, benzene, heavy metals in traditional medications, chloramphenicol use) are important etiological factors",
      "PNH clone is found in 40-50% of aplastic anemia patients and indicates an immune-mediated pathogenesis; it is detected by flow cytometry (loss of GPI-anchored proteins CD55 and CD59) and does not necessarily mean clinical PNH",
      "Definitive treatment for SAA in patients <40 years with a matched sibling donor is allogeneic hematopoietic stem cell transplant (HSCT); for those without a donor, first-line is immunosuppressive therapy with horse ATG + cyclosporine (IST)",
      "Fanconi anemia must be excluded in all young patients with aplastic anemia using chromosomal breakage analysis (DEB or mitomycin C test), as it requires modified conditioning for transplant and has cancer predisposition",
      "Supportive care in aplastic anemia: irradiated and leukodepleted blood products (to prevent transfusion-associated GVHD and alloimmunization), broad-spectrum antibiotics for febrile neutropenia, antifungal prophylaxis, and iron chelation for transfusional iron overload"
    ],
    "india_context": "Aplastic anemia has a higher incidence in India (4-7 per million) compared to the West (2 per million), potentially related to greater environmental toxin exposure. Agricultural workers exposed to organophosphates, benzene, and other chemicals are at increased risk. Traditional and alternative medicines (Ayurvedic, Siddha, Unani) have been implicated in some cases due to heavy metal contamination (arsenic, mercury, lead). Christian Medical College (CMC) Vellore has one of the largest aplastic anemia registries in Asia and has pioneered post-transplant cyclophosphamide-based haploidentical transplants, expanding donor options for Indian patients who lack matched sibling donors. The cost of HSCT in India (15-25 lakh INR) remains a barrier, though government schemes like Ayushman Bharat provide partial coverage. Horse ATG availability and cost are also challenges for IST in India."
  },
  {
    "id": "HEM-009",
    "title": "Thrombotic Thrombocytopenic Purpura (TTP) Presenting with the Classic Pentad",
    "specialty": "hematology",
    "difficulty": "advanced",
    "source": "Indian Journal of Hematology and Blood Transfusion - TTP Diagnosis and Management in India",
    "demographics": {"age": 32, "gender": "Female", "location": "Hyderabad, Telangana"},
    "chief_complaint": "High fever, confusion, bleeding from gums, jaundice, and decreased urine output for 3 days",
    "presentation": "A 32-year-old married woman, a software engineer from Hyderabad, presents to the emergency department with a 3-day history of high-grade fever, progressive confusion and disorientation, bleeding from gums and petechiae over both lower limbs, yellowish discoloration of eyes, and decreased urine output. She was previously healthy with no significant medical history. Five days ago she experienced malaise, myalgia, and low-grade fever attributed to a viral illness. Over the next 2 days she developed worsening confusion, her family noticed she was speaking incoherently and was unable to recognize familiar people. She also developed gum bleeding, scattered red spots on her legs, and her eyes turned yellow. Her urine has been dark and scanty for the past 24 hours.",
    "vital_signs": {"bp": "150/95", "hr": 118, "rr": 24, "temp": 39.2, "spo2": 96},
    "history": "Previously healthy 32-year-old woman with no chronic illnesses. No prior hematological disorders. No recent medications, no oral contraceptive use. Five days ago developed malaise, body aches, and low-grade fever. Over the next 3 days, progressive confusion and disorientation developed  initially forgetfulness, then inability to recognize family members, and now intermittent incoherent speech. Gum bleeding noticed 3 days ago while brushing teeth, followed by petechiae on both legs. Yellow discoloration of eyes noticed 2 days ago. Decreased urine output for 24 hours  dark tea-colored urine, estimated <300 mL in the last 24 hours. No diarrhea (rules out HUS-associated STEC infection). No bloody stools. No recent pregnancy or delivery. No history of autoimmune disease. No family history of thrombotic disorders. No history of HIV. Married for 5 years, one child aged 3 years, no recent pregnancy.",
    "physical_exam": "Confused, disoriented to time, place, and person (GCS 12  E3V4M5). Febrile. Icteric sclera. Moderate pallor with a lemon-yellow tinge (pallor + jaundice suggesting hemolysis). Petechiae scattered over bilateral lower extremities and trunk. Ecchymoses over forearms. Gum bleeding on examination. No lymphadenopathy. No hepatosplenomegaly. Cardiovascular: Tachycardia, flow murmur grade 2/6. Respiratory: Clear. Abdomen: Soft, non-tender, no organomegaly. Neurological: Fluctuating mental status, disoriented, no focal motor deficits, no meningeal signs, plantars flexor bilaterally, deep tendon reflexes normal. Fundoscopy: Scattered retinal hemorrhages. Urine: Dark, tea-colored via catheter, 50 mL collected in last 2 hours.",
    "investigations": "CBC: Hb 6.8 g/dL (was 12.5 six months ago at routine check-up), MCV 98 fL (normocytic), WBC 12,400/cumm, Platelets 18,000/cumm (severely low). Reticulocyte count: 9.5% (elevated, indicating marrow response to hemolysis). Peripheral smear: Numerous schistocytes (fragmented RBCs, >5 per HPF), polychromasia, few spherocytes, nucleated RBCs, thrombocytopenia  classic microangiopathic hemolytic anemia (MAHA) picture. LDH: 1,850 U/L (markedly elevated). Indirect bilirubin: 5.8 mg/dL. Haptoglobin: Undetectable (<10 mg/dL). Direct Coombs test: Negative (rules out autoimmune hemolytic anemia). Coagulation: PT 13.5 seconds (normal), aPTT 31 seconds (normal), fibrinogen 320 mg/dL (normal), D-dimer mildly elevated  coagulation profile is normal, distinguishing TTP from DIC. Creatinine: 2.8 mg/dL (AKI). BUN: 58 mg/dL. Urine: Hemoglobinuria, proteinuria 2+. ADAMTS13 activity: <5% (severely deficient, normal >67%)  confirmatory. ADAMTS13 inhibitor (anti-ADAMTS13 IgG antibody): Positive, titer 48 BU (confirming acquired autoimmune TTP). Blood group: A positive. Stool for STEC/Shiga toxin: Negative (rules out typical HUS). HIV ELISA: Negative. ANA: Weakly positive (1:80). Pregnancy test: Negative. CT brain: No acute infarct or hemorrhage.",
    "diagnosis": "Acquired thrombotic thrombocytopenic purpura (TTP) with the classic pentad  microangiopathic hemolytic anemia, thrombocytopenia, neurological dysfunction, renal impairment, and fever  secondary to anti-ADAMTS13 autoantibodies",
    "differentials": ["Thrombotic thrombocytopenic purpura (TTP)", "Hemolytic uremic syndrome (HUS  typical/atypical)", "Disseminated intravascular coagulation (DIC)", "Evans syndrome (autoimmune hemolytic anemia + ITP)", "HELLP syndrome (excluded  not pregnant)", "Malignant hypertension with MAHA"],
    "learning_points": [
      "The classic pentad of TTP  MAHA, thrombocytopenia, neurological symptoms, renal impairment, and fever  is present in only 5-10% of cases at diagnosis; the dyad of MAHA (schistocytes on smear) + thrombocytopenia without another identifiable cause should prompt immediate consideration of TTP",
      "ADAMTS13 is a metalloprotease that cleaves ultra-large von Willebrand factor (UL-vWF) multimers; deficiency (<10% activity) leads to accumulation of UL-vWF strings on endothelium causing platelet aggregation, microthrombi, and end-organ ischemia  acquired TTP is caused by autoantibodies against ADAMTS13",
      "TTP is distinguished from DIC by a NORMAL coagulation profile (PT, aPTT, fibrinogen)  in DIC these are deranged; schistocytes are present in both but the mechanism differs (microvascular platelet thrombi in TTP vs. fibrin strand shearing in DIC)",
      "TTP is a hematological emergency with >90% mortality if untreated; treatment is immediate therapeutic plasma exchange (TPE) which removes anti-ADAMTS13 antibodies and UL-vWF while replenishing ADAMTS13; corticosteroids (methylprednisolone 1 g/day IV for 3 days) are given concurrently",
      "Caplacizumab (anti-vWF nanobody) is an emerging targeted therapy that blocks vWF-platelet interaction and accelerates platelet recovery; rituximab is used for relapsing or refractory TTP to deplete B-cells producing anti-ADAMTS13 antibodies",
      "Platelet transfusion is CONTRAINDICATED in TTP as it can worsen microvascular thrombosis and precipitate fatal end-organ damage  this is a critical teaching point and frequently tested in examinations"
    ],
    "india_context": "TTP is increasingly recognized in India with growing awareness and availability of ADAMTS13 testing at major tertiary centers (AIIMS Delhi, CMC Vellore, Nizam's Institute Hyderabad, TMH Mumbai). However, ADAMTS13 assay turnaround time is often 5-7 days, so treatment must be initiated empirically based on clinical and laboratory findings (MAHA + thrombocytopenia). Therapeutic plasma exchange (TPE) is available at most large teaching hospitals but may not be available at district hospitals, necessitating urgent transfer. The cost of daily TPE (Rs 8,000-15,000 per session using FFP as replacement fluid) is a significant financial burden. Caplacizumab is not yet widely available or affordable in India. The PLASMIC score (a validated clinical prediction tool for severe ADAMTS13 deficiency) can help prioritize patients for empiric TPE while awaiting ADAMTS13 results. Indian hematologists have advocated for establishing TTP registries and increasing ADAMTS13 testing capacity under the umbrella of the Indian Society of Hematology and Blood Transfusion (ISHBT)."
  },
  {
    "id": "HEM-010",
    "title": "Von Willebrand Disease Type 1 Presenting with Menorrhagia and Post-Extraction Bleeding",
    "specialty": "hematology",
    "difficulty": "intermediate",
    "source": "Indian Journal of Hematology and Blood Transfusion - Inherited Bleeding Disorders in Indian Women",
    "demographics": {"age": 19, "gender": "Female", "location": "Chandigarh, Punjab"},
    "chief_complaint": "Heavy menstrual bleeding since menarche and prolonged bleeding after a recent dental extraction",
    "presentation": "A 19-year-old college student from Chandigarh presents to the hematology outpatient clinic referred by her gynecologist for evaluation of lifelong heavy menstrual periods and a recent episode of prolonged bleeding following extraction of a wisdom tooth. She has had heavy periods since menarche at age 12, soaking through 10-12 pads per day during the first 3 days of each cycle, with periods lasting 8-9 days and passage of large clots. She has required oral iron supplementation repeatedly for anemia. Three weeks ago, she underwent extraction of a lower right wisdom tooth at a dental clinic. Bleeding from the extraction site continued for 48 hours despite local measures, and she required emergency hospital admission for packing and tranexamic acid. She also reports easy bruising since childhood and occasional epistaxis lasting 15-20 minutes. Her mother has a similar history of heavy periods.",
    "vital_signs": {"bp": "108/68", "hr": 88, "rr": 16, "temp": 36.9, "spo2": 99},
    "history": "Menorrhagia since menarche at age 12: cycles regular (28-30 days) but heavy flow lasting 8-9 days, soaking 10-12 pads/day on heavy days with passage of clots >2 cm. Pictorial blood loss assessment chart (PBAC) score: 280 (>100 indicates menorrhagia). Required oral iron supplementation 3-4 times, last Hb was 9.2 g/dL six months ago. Three weeks ago: Prolonged bleeding after wisdom tooth extraction lasting 48 hours; required hospital admission, local hemostatic packing, IV tranexamic acid, and one unit of packed RBC transfusion. Lifelong easy bruising  bruises appear with minimal trauma on arms and legs, often without remembered injury. Epistaxis: Approximately once a month, lasts 15-20 minutes, stops with nasal pressure. No hemarthroses or deep muscle bleeds (distinguishes from hemophilia). No GI bleeding, no hematuria. Maternal history: Mother also has heavy periods and easy bruising (never evaluated). No consanguinity. One elder brother: no bleeding symptoms. No history of liver disease, renal disease, or medications affecting coagulation (no aspirin, NSAIDs, or anticoagulants). No history of connective tissue disorder symptoms.",
    "physical_exam": "Well-nourished young woman, mild pallor. Multiple ecchymoses (1-4 cm) of varying ages on bilateral upper arms, forearms, and shins  some with no recalled trauma. No petechiae (platelet count is normal). No joint swelling or deformity (no hemarthroses). Oral cavity: Healing extraction socket in the right lower third molar region, no active bleeding, no mucosal petechiae. No lymphadenopathy. No hepatosplenomegaly. Cardiovascular: Normal. Respiratory: Clear. Abdomen: Soft, non-tender. No signs of connective tissue laxity (rules out Ehlers-Danlos).",
    "investigations": "CBC: Hb 10.2 g/dL (mild anemia, improved from 9.2 after recent iron), MCV 78 fL (microcytic from chronic iron deficiency), WBC 7,600/cumm, Platelets 2.6 lakh (normal). Peripheral smear: Microcytic hypochromic anemia, no schistocytes, no abnormal cells. Iron studies: Serum ferritin 14 ng/mL (low), transferrin saturation 12% (low). Coagulation: PT 13 seconds (normal), aPTT 38 seconds (mildly prolonged, normal <34). Bleeding time (Ivy method): 12 minutes (prolonged, normal 2-9 minutes). PFA-100 (Platelet Function Analyzer): Closure time prolonged with both collagen/ADP and collagen/epinephrine cartridges. Von Willebrand studies: vWF antigen (vWF:Ag): 22 IU/dL (low, normal 50-150). vWF ristocetin cofactor activity (vWF:RCo): 18 IU/dL (low, normal 50-150). Factor VIII activity: 35% (mildly reduced  vWF is the carrier protein for FVIII). vWF:RCo/vWF:Ag ratio: 0.82 (>0.7, consistent with Type 1 VWD  concordant reduction). vWF multimer analysis: All multimer sizes present in reduced quantity (normal multimer pattern  confirms Type 1). Ristocetin-induced platelet aggregation (RIPA): Reduced aggregation at standard concentration (1.25 mg/mL), normal at high concentration (rules out Type 2B). Blood group: O positive (relevant as Type O individuals have 25-30% lower vWF levels). ISTH-BAT (Bleeding Assessment Tool) score: 8 (significant  score >6 in adult women is abnormal and warrants investigation). Pelvic ultrasound: Normal uterus and ovaries, no fibroids or polyps.",
    "diagnosis": "Von Willebrand disease Type 1 (most common inherited bleeding disorder) presenting with menorrhagia, mucocutaneous bleeding, and post-procedural hemorrhage",
    "differentials": ["Von Willebrand disease (Type 1, 2, or 3)", "Platelet function disorder (Glanzmann thrombasthenia, Bernard-Soulier syndrome)", "Mild hemophilia A carrier state (symptomatic carrier)", "Acquired von Willebrand syndrome", "Dysfunctional uterine bleeding (diagnosis of exclusion)", "Ehlers-Danlos syndrome (connective tissue fragility)"],
    "learning_points": [
      "Von Willebrand disease (VWD) is the most common inherited bleeding disorder worldwide, affecting approximately 1% of the population; Type 1 (partial quantitative deficiency of vWF) accounts for 70-80% of cases and follows an autosomal dominant inheritance pattern",
      "VWF has dual hemostatic functions: (1) mediates platelet adhesion to injured subendothelium (primary hemostasis) and (2) serves as the carrier protein for Factor VIII, protecting it from proteolytic degradation  deficiency therefore causes both platelet-type (mucocutaneous) and coagulation-type bleeding",
      "VWD classification: Type 1 (partial quantitative deficiency, all multimers present), Type 2A (loss of large multimers, reduced function), Type 2B (gain-of-function with spontaneous platelet binding, thrombocytopenia), Type 2M (decreased function, normal multimers), Type 2N (decreased FVIII binding, mimics mild hemophilia A), Type 3 (complete absence, severe bleeding)",
      "Blood group O individuals have 25-30% lower baseline vWF levels; diagnosis of Type 1 VWD in blood group O patients can be challenging as levels may overlap with the lower end of normal  repeat testing and clinical correlation (ISTH-BAT score) are essential",
      "Treatment of VWD Type 1: Desmopressin (DDAVP) 0.3 mcg/kg IV is first-line  it releases stored vWF and FVIII from endothelial Weibel-Palade bodies, typically raising levels 3-5 fold; a DDAVP trial should be performed to confirm responsiveness; for major surgery or DDAVP-unresponsive patients, vWF-containing FVIII concentrates (Humate-P) are used",
      "Tranexamic acid (antifibrinolytic) is an effective adjunct for mucosal bleeding and menorrhagia in VWD; combined oral contraceptive pills increase vWF levels and are used to manage menorrhagia in women with VWD  a combined hematology-gynecology approach is ideal"
    ],
    "india_context": "VWD is significantly underdiagnosed in India, particularly in women where menorrhagia is often normalized or attributed to iron deficiency without investigating the underlying cause. The ICMR-funded multicenter study on inherited bleeding disorders estimated that only 5-10% of VWD patients in India are diagnosed. Specialized coagulation laboratories capable of performing vWF antigen, activity, multimer analysis, and RIPA are limited to major tertiary centers (AIIMS Delhi, CMC Vellore, PGIMER Chandigarh, KEM Mumbai, SGPGI Lucknow). Desmopressin (DDAVP) is available and affordable in India and is the mainstay of treatment for Type 1 VWD. VWF-containing factor concentrates (Humate-P, Wilate) are available but expensive and not stocked at most government hospitals. The Hemophilia Federation of India (HFI) has expanded its mandate to include VWD awareness and registration. Indian gynecologists are increasingly being trained to screen for bleeding disorders in women with menorrhagia, as recommended by FOGSI guidelines. Adolescent girls with heavy periods since menarche should be screened with a bleeding assessment tool and basic coagulation tests before being labeled as having dysfunctional uterine bleeding."
  }
]