[
  {
    "id": "INF-001",
    "title": "Complicated Falciparum Malaria with Cerebral Involvement",
    "specialty": "infectious",
    "difficulty": "advanced",
    "source": "IJMR - Malaria Epidemiology India",
    "demographics": {"age": 28, "gender": "Male", "location": "Rourkela, Odisha"},
    "chief_complaint": "High fever with altered sensorium for 2 days",
    "presentation": "A 28-year-old construction worker from Rourkela, Odisha (malaria-endemic zone) presents with high-grade fever for 5 days and altered consciousness for 2 days. He works near forested areas and does not use bed nets. He was initially treated with paracetamol by a local quack. His GCS has progressively dropped to 8/15.",
    "vital_signs": {"bp": "90/60", "hr": 120, "rr": 28, "temp": 40.2, "spo2": 92},
    "history": "Fever for 5 days - initially intermittent, became continuous. Rigors, chills, profuse sweating. Headache, body aches. Vomiting for 3 days. Altered consciousness for 2 days - initially confused, now unresponsive to verbal commands. No seizures witnessed. Works at a dam construction site in forested area. No bed net use. No chemoprophylaxis. No prior malaria episodes. No travel outside Odisha.",
    "physical_exam": "GCS 8/15 (E2V2M4). Febrile (40.2°C). Jaundiced. Severe pallor. Tachycardic, hypotensive. Hepatosplenomegaly. Bilateral plantar extensors. No neck stiffness. No focal neurological deficit. No papilledema. Petechiae on trunk. Respiratory: Bilateral crepitations (ARDS). Dark cola-colored urine in catheter bag.",
    "investigations": "Peripheral smear: Plasmodium falciparum - ring forms with high parasitemia (12%). Rapid antigen test (PfHRP2): Strongly positive. CBC: Hb 5.2 g/dL, WBC 14,000, Platelets 22,000 (severe thrombocytopenia). LFT: Bilirubin 8.5 (conjugated + unconjugated), AST 250, ALT 180. Renal: Creatinine 4.2, BUN 65 (AKI). Blood glucose: 40 mg/dL (hypoglycemia). Lactate: 8 mmol/L (>5 = severe). ABG: Metabolic acidosis pH 7.18, HCO3 10. Coagulation: PT prolonged, DIC screen positive. Urine: Hemoglobinuria. CXR: Bilateral infiltrates (ARDS).",
    "diagnosis": "Severe falciparum malaria with cerebral malaria, ARDS, AKI, severe anemia, DIC, and hypoglycemia",
    "differentials": ["Cerebral malaria", "Bacterial meningitis", "Viral encephalitis (Japanese encephalitis)", "Scrub typhus with MODS", "Leptospirosis (Weil disease)", "Enteric encephalopathy"],
    "learning_points": [
      "WHO criteria for severe malaria: Cerebral (GCS <11), severe anemia (<5g/dL), parasitemia >10%, AKI, ARDS, hypoglycemia, acidosis, DIC",
      "IV artesunate is the drug of choice for severe malaria (NOT quinine) - 2.4 mg/kg at 0, 12, 24h then daily",
      "Hypoglycemia is common in severe malaria (parasite glucose consumption + quinine-induced insulin release)",
      "Exchange transfusion considered if parasitemia >30% with organ dysfunction",
      "Blackwater fever: hemoglobinuria from massive intravascular hemolysis",
      "Odisha, Chhattisgarh, Jharkhand, and NE states contribute 90% of India's malaria deaths"
    ],
    "india_context": "India reported 5.6 million malaria cases in 2022. P. falciparum dominates in eastern and northeastern India. NVBDCP (now NCVBDC) runs the National Malaria Elimination Programme targeting elimination by 2030. ACT (artesunate + sulfadoxine-pyrimethamine or artemether-lumefantrine) is the national first-line for Pf malaria."
  },
  {
    "id": "INF-002",
    "title": "Enteric Fever with Intestinal Perforation",
    "specialty": "infectious",
    "difficulty": "intermediate",
    "source": "JAPI - Enteric Fever Complications",
    "demographics": {"age": 22, "gender": "Male", "location": "Lucknow, UP"},
    "chief_complaint": "High fever for 12 days with sudden severe abdominal pain",
    "presentation": "A 22-year-old engineering student from Lucknow presents with step-ladder pattern fever for 12 days, initially treated with azithromycin by a local doctor with no improvement. He now presents with sudden onset severe diffuse abdominal pain and distension since 6 hours. He has had constipation followed by diarrhea. He consumed street food regularly near his hostel.",
    "vital_signs": {"bp": "80/50", "hr": 130, "rr": 30, "temp": 39.5, "spo2": 94},
    "history": "Fever for 12 days - step-ladder pattern (rising daily). Initially 100°F, now 103-104°F. Headache, anorexia, malaise. Constipation first week, then pea-soup diarrhea. Vague abdominal discomfort. 6 hours ago: sudden severe generalized abdominal pain. No vomiting initially, now bilious. No passage of flatus. Treated with azithromycin 500mg x 5 days - no improvement (? resistant strain). Eats regularly from street food stalls. Drinks unfiltered water. Not vaccinated for typhoid.",
    "physical_exam": "Toxic, febrile, dehydrated. Coated tongue. Relative bradycardia absent now (tachycardic due to perforation). Rose spots on abdomen (fading salmon-colored macules). Abdomen: Board-like rigidity, diffuse tenderness, rebound tenderness positive, absent bowel sounds. Hepatosplenomegaly (palpated earlier, now obscured by guarding). Obliteration of liver dullness (pneumoperitoneum). Digital rectal exam: Empty rectum, tenderness.",
    "investigations": "Blood culture: Salmonella typhi (fluoroquinolone-resistant, MIC ciprofloxacin >1). Widal test: O titer 1:320, H titer 1:640. CBC: WBC 3,800 (leucopenia), Hb 11, Platelets 110,000. CRP: 180. LFT: AST 95, ALT 78 (hepatitis). X-ray abdomen erect: Free gas under diaphragm (pneumoperitoneum). USG abdomen: Free fluid in pelvis and paracolic gutters. Creatinine: 1.1.",
    "diagnosis": "Enteric fever (typhoid) complicated by ileal perforation with peritonitis - surgical emergency",
    "differentials": ["Typhoid perforation", "Appendicular perforation", "Peptic ulcer perforation", "Intestinal TB perforation", "Mesenteric ischemia", "Perforated Meckel's diverticulum"],
    "learning_points": [
      "Typhoid perforation typically occurs in 3rd week at terminal ileum (Peyer's patches)",
      "Leucopenia (not leucocytosis) is typical in typhoid - leucocytosis suggests complication",
      "Fluoroquinolone resistance in S. typhi is >80% in India - ceftriaxone or azithromycin preferred",
      "Blood culture is gold standard (positive in 40-60%) - bone marrow culture has highest yield (80%)",
      "Widal test: single titer not reliable; rising titers (4-fold) more significant",
      "Surgical management: Primary closure with omentopexy or resection-anastomosis depending on perforation size"
    ],
    "india_context": "India has the highest typhoid burden globally (~11 million cases/year). Multi-drug resistant and extensively drug-resistant (XDR) strains are emerging. TCV (Typhoid Conjugate Vaccine) has been introduced in the Universal Immunization Programme in 2023. Fluoroquinolone resistance exceeds 80% in most Indian cities."
  },
  {
    "id": "INF-003",
    "title": "Scrub Typhus with Multi-Organ Dysfunction",
    "specialty": "infectious",
    "difficulty": "advanced",
    "source": "IJMR - Scrub Typhus Resurgence in India",
    "demographics": {"age": 40, "gender": "Female", "location": "Shimla, Himachal Pradesh"},
    "chief_complaint": "Fever, headache, and a black scab on the leg for 1 week",
    "presentation": "A 40-year-old apple farmer from rural Shimla district presents with high-grade fever, severe headache, and myalgia for 7 days. She noticed a painless black scab (eschar) on her left shin 3 days before fever onset. She works barefoot in apple orchards. She has now developed jaundice, reduced urine output, and breathlessness.",
    "vital_signs": {"bp": "85/55", "hr": 118, "rr": 28, "temp": 40.0, "spo2": 89},
    "history": "Painless dark scab noticed on left shin 10 days ago - thought it was an insect bite. High-grade continuous fever for 7 days with rigors. Severe headache. Generalized myalgia. Maculopapular rash on trunk for 3 days. Jaundice for 2 days. Reduced urine output for 1 day. Breathlessness for 1 day. Works in apple orchards barefoot during harvest season (September-November). No prior similar illness. Endemic area for scrub typhus.",
    "physical_exam": "Febrile, icteric, tachypneic. Eschar: 1.5 cm painless black necrotic lesion with erythematous halo on left shin (pathognomonic). Maculopapular rash on trunk and extremities. Generalized lymphadenopathy. Hepatosplenomegaly. Bilateral crepitations (ARDS). Mild neck stiffness. GCS 13/15 (confused). Bilateral pedal edema.",
    "investigations": "Scrub typhus IgM ELISA: Positive (>1:128). Weil-Felix test: OX-K positive (1:320). CBC: WBC 15,000, Platelets 35,000, Hb 10.5. LFT: Bilirubin 6.2, AST 320, ALT 280, ALP 350. Renal: Creatinine 3.8, K+ 5.5 (AKI). CXR: Bilateral diffuse infiltrates (ARDS). ABG: PaO2/FiO2 ratio 180 (moderate ARDS). CSF (if done): Lymphocytic pleocytosis, elevated protein (meningoencephalitis). Coagulation: DIC screen positive.",
    "diagnosis": "Scrub typhus (Orientia tsutsugamushi) with multi-organ dysfunction syndrome (ARDS, AKI, hepatitis, meningoencephalitis, DIC)",
    "differentials": ["Scrub typhus", "Murine typhus", "Leptospirosis", "Dengue with severe complications", "Meningococcal sepsis", "Hantavirus", "Indian tick typhus"],
    "learning_points": [
      "Eschar is pathognomonic for scrub typhus but found in only 10-50% of Indian cases",
      "Doxycycline 100mg BD is the drug of choice - start empirically, do not wait for serology",
      "Dramatic response to doxycycline within 24-48 hours ('therapeutic test')",
      "Untreated mortality 30-45%, with treatment <5%",
      "Scrub typhus can cause MODS: ARDS, AKI, hepatitis, meningoencephalitis, myocarditis, DIC",
      "Weil-Felix test (OX-K) is less sensitive/specific than IgM ELISA but widely available"
    ],
    "india_context": "Scrub typhus has re-emerged as a major cause of acute undifferentiated fever in India, particularly in hilly and forested regions (Himachal, Uttarakhand, Rajasthan, Tamil Nadu, Meghalaya). ICMR has made scrub typhus IgM testing available at district hospitals. Transmission peaks during cooler months (Sep-Nov) when mite activity increases."
  },
  {
    "id": "INF-004",
    "title": "Leptospirosis with Weil Disease",
    "specialty": "infectious",
    "difficulty": "intermediate",
    "source": "JAPI - Leptospirosis in Coastal India",
    "demographics": {"age": 35, "gender": "Male", "location": "Udupi, Karnataka"},
    "chief_complaint": "Fever, jaundice, and reduced urine for 5 days",
    "presentation": "A 35-year-old rice paddy farmer from coastal Karnataka presents with acute onset high fever, severe calf muscle tenderness, jaundice, and oliguria for 5 days. He wades through flooded paddy fields daily without protective footwear. Heavy monsoon rains preceded his illness by 1 week. He has also noticed conjunctival suffusion (red eyes without discharge).",
    "vital_signs": {"bp": "95/60", "hr": 110, "rr": 24, "temp": 39.5, "spo2": 93},
    "history": "Acute onset fever 5 days ago with rigors. Severe headache (retro-orbital). Intense myalgia, especially calves (can barely walk). Jaundice appeared day 3. Reduced urine output since day 4. Conjunctival redness bilaterally without discharge. No diarrhea. Exposure: wades daily in flooded rice paddies, bare feet. Had cuts on feet from paddy stubble. Heavy rains 1 week prior. No prior similar episode. Neighborhood: 2 others also febrile.",
    "physical_exam": "Icteric, conjunctival suffusion bilateral (pathognomonic - injected conjunctivae without purulent discharge). Severe calf muscle tenderness bilaterally. Hepatomegaly (4 cm, tender). Mild splenomegaly. Skin: Petechiae, purpuric patches. No meningism. Lungs: Bilateral crepitations. Urine: Dark colored, reduced output (200ml in 12 hours).",
    "investigations": "Leptospira IgM ELISA: Positive. MAT (Microscopic Agglutination Test): Titer 1:800 (serovar icterohaemorrhagiae). CBC: WBC 16,000 (neutrophilic), Platelets 45,000, Hb 10.5. LFT: Bilirubin 18 mg/dL (conjugated >50%), AST 120, ALT 85, ALP 250 (disproportionate hyperbilirubinemia with mildly elevated transaminases). Renal: Creatinine 5.5, BUN 80, K+ 5.8 (non-oliguric AKI → oliguric). Urine: Pyuria, proteinuria. CXR: Bilateral patchy infiltrates (pulmonary hemorrhage). CPK: 1200 (rhabdomyolysis). Coagulation: Mildly prolonged PT.",
    "diagnosis": "Leptospirosis with Weil disease (icteric leptospirosis with hepatorenal dysfunction and pulmonary hemorrhage)",
    "differentials": ["Leptospirosis (Weil disease)", "Dengue hemorrhagic fever", "Hantavirus pulmonary syndrome", "Scrub typhus", "Viral hepatitis with AKI", "Malaria with hepatorenal dysfunction"],
    "learning_points": [
      "Weil disease triad: Jaundice + Renal failure + Hemorrhage (severe leptospirosis, 5-10% of cases)",
      "Conjunctival suffusion is an early and highly suggestive sign (red eyes without exudate)",
      "Disproportionate hyperbilirubinemia with only mild transaminase elevation is characteristic",
      "Calf muscle tenderness is a classic feature distinguishing from dengue/typhoid",
      "Treatment: IV penicillin G or ceftriaxone for severe; doxycycline for mild/prophylaxis",
      "Pulmonary hemorrhage (LPHS) is the leading cause of death in leptospirosis"
    ],
    "india_context": "Leptospirosis is endemic in coastal Karnataka, Kerala, Tamil Nadu, Andaman Islands, and Gujarat. Outbreaks peak during and after monsoon season. Rice paddy workers and sewage workers are high-risk. ICMR has established sentinel surveillance sites. Doxycycline 200mg weekly is recommended as chemoprophylaxis for high-risk populations during outbreaks."
  },
  {
    "id": "INF-005",
    "title": "Disseminated Tuberculosis with TB Meningitis",
    "specialty": "infectious",
    "difficulty": "advanced",
    "source": "IJMR - TB Meningitis in India",
    "demographics": {"age": 25, "gender": "Female", "location": "Nagpur, Maharashtra"},
    "chief_complaint": "Headache, fever, and altered behavior for 2 weeks",
    "presentation": "A 25-year-old domestic worker presents with progressive headache, low-grade fever, and altered behavior for 2 weeks. Her family reports personality changes - she has become irritable, confused, and had one episode of seizures. She has lost 6 kg weight over 3 months. She lives in a slum area and her employer's child was recently treated for pulmonary TB.",
    "vital_signs": {"bp": "100/60", "hr": 90, "rr": 18, "temp": 38.2, "spo2": 96},
    "history": "Gradual onset headache for 3 weeks, progressive. Low-grade evening fever for 1 month. Night sweats. Weight loss 6 kg in 3 months. Anorexia. Personality change: irritable, withdrawn, confused for 2 weeks. One episode of generalized tonic-clonic seizure yesterday. Intermittent vomiting (projectile). Employer's child had smear-positive pulmonary TB 3 months ago. Lives in 1-room slum dwelling. No known HIV. No diabetes. BCG scar present.",
    "physical_exam": "Emaciated, febrile, GCS 12/15 (E3V4M5). Neck stiffness present. Kernig and Brudzinski signs positive. Fundoscopy: Bilateral papilledema, choroidal tubercles seen. Cranial nerves: Left 6th nerve palsy (lateral rectus). No focal motor deficits. DTRs brisk. Bilateral plantar extensors. Chest: Few crepitations right upper zone. Abdomen: Doughy feel, mild ascites. Lymph nodes: Bilateral cervical, matted, non-tender.",
    "investigations": "CSF: Opening pressure 300 mmH2O (elevated), WBC 250 (predominantly lymphocytes 80%), Protein 3.2 g/L (elevated), Glucose 22 mg/dL (blood glucose 110 - ratio <0.5), ADA 18 U/L (elevated >10). CSF GeneXpert MTB/RIF: MTB detected, Rifampicin sensitive. AFB stain CSF: Negative (only 10-20% sensitivity). CT brain: Basal meningeal enhancement, hydrocephalus, tuberculoma right temporal lobe. CXR: Miliary pattern (diffuse fine nodules). Sputum GeneXpert: MTB detected. HIV test: Negative. CBC: Hb 9.5, ESR 65. Hepatic function: Normal baseline.",
    "diagnosis": "Disseminated (miliary) tuberculosis with tubercular meningitis (Stage II) and hydrocephalus",
    "differentials": ["TB meningitis", "Cryptococcal meningitis", "Bacterial meningitis (partially treated)", "Viral meningoencephalitis", "Neurosarcoidosis", "CNS lymphoma", "Carcinomatous meningitis"],
    "learning_points": [
      "TB meningitis CSF: Lymphocytic pleocytosis, high protein, low glucose (ratio <0.5), elevated ADA",
      "GeneXpert MTB/RIF on CSF has 60-80% sensitivity - better than AFB stain (10-20%)",
      "TBM staging: Stage I (clear sensorium), Stage II (confused/focal deficits), Stage III (coma)",
      "Choroidal tubercles on fundoscopy are pathognomonic of disseminated TB",
      "Treatment: Intensive phase with HRZE + Steroids (dexamethasone 0.4 mg/kg tapering over 6-8 weeks)",
      "Total treatment duration: 9-12 months for TBM (not 6 months as for pulmonary TB)"
    ],
    "india_context": "India accounts for 26% of global TB burden (2.8 million cases/year). TBM constitutes 1-5% of all TB but has 20-50% mortality. NTEP (National TB Elimination Programme) provides free diagnosis (GeneXpert at all district levels) and treatment. Delay in diagnosis is the single most important determinant of outcome in TBM."
  },
  {
    "id": "INF-006",
    "title": "Dengue Hemorrhagic Fever with Shock Syndrome",
    "specialty": "infectious",
    "difficulty": "intermediate",
    "source": "NVBDCP Guidelines - Dengue Management",
    "demographics": {"age": 12, "gender": "Female", "location": "Delhi"},
    "chief_complaint": "High fever for 5 days with bleeding from gums and nose",
    "presentation": "A 12-year-old girl from South Delhi presents during October (post-monsoon) with high-grade fever for 5 days, now defervescing (fever coming down). She has developed bleeding from gums, epistaxis, and petechial rash. She appears restless and has cold, clammy extremities. Her neighborhood has reported multiple dengue cases.",
    "vital_signs": {"bp": "80/60", "hr": 130, "rr": 28, "temp": 37.2, "spo2": 95},
    "history": "High-grade continuous fever for 5 days (40°C), started defervescing today. Severe headache, retro-orbital pain, myalgia for first 3 days. Rash appeared day 4. Bleeding from gums since morning. Epistaxis twice. Petechial rash spreading. Abdominal pain (right upper quadrant). Restless, not eating. Multiple dengue cases in colony. Aedes mosquito breeding sites identified by MCD. No recent travel. Previously healthy child.",
    "physical_exam": "Restless, cold clammy extremities, delayed capillary refill (>3 seconds). Narrow pulse pressure (20 mmHg). Petechiae widespread. Ecchymoses at venipuncture sites. Tourniquet test: >20 petechiae. Hepatomegaly (3 cm, tender). Bilateral pleural effusion (reduced breath sounds). Mild ascites. No splenomegaly. No neurological deficit.",
    "investigations": "NS1 Antigen: Positive. Dengue IgM: Positive. IgG: Positive (secondary infection). CBC: WBC 2,500 (leucopenia), Platelets 12,000 (severe thrombocytopenia), Hct 48% (baseline ~36% - hemoconcentration >20%). LFT: AST 450, ALT 280 (dengue hepatitis). Coagulation: PT prolonged, APTT prolonged. Albumin: 2.1 (low - plasma leakage). USG: Right pleural effusion, ascites, gallbladder wall thickening (>3mm). CXR: Right pleural effusion.",
    "diagnosis": "Dengue hemorrhagic fever (DHF Grade III) / Dengue shock syndrome (DSS) - secondary dengue infection",
    "differentials": ["Dengue hemorrhagic fever/DSS", "Chikungunya with complications", "Malaria with thrombocytopenia", "Leptospirosis", "Hantavirus", "ITP with intercurrent infection"],
    "learning_points": [
      "Critical phase occurs during defervescence (day 3-7) - NOT during peak fever",
      "Warning signs: Abdominal pain, persistent vomiting, fluid accumulation, mucosal bleed, lethargy, hepatomegaly >2cm, rising Hct with falling platelets",
      "DHF grading: I (fever + tourniquet), II (+ spontaneous bleeding), III (+ circulatory failure), IV (profound shock/undetectable BP)",
      "Fluid resuscitation: Isotonic crystalloids 10-20 mL/kg bolus, then titrate to Hct",
      "Platelet transfusion NOT indicated for thrombocytopenia alone - only for active severe bleeding",
      "Secondary dengue infection (different serotype) carries higher risk of DHF/DSS due to antibody-dependent enhancement"
    ],
    "india_context": "Delhi reports the highest dengue caseload in India, peaking September-November post-monsoon. Urban breeding of Aedes aegypti in coolers, pots, and construction sites drives transmission. NVBDCP issues annual guidelines for clinical management. MCD conducts fogging and breeding site surveys. School-based screening programs operate during peak season."
  },
  {
    "id": "INF-007",
    "title": "HIV with Pneumocystis Pneumonia",
    "specialty": "infectious",
    "difficulty": "advanced",
    "source": "NACO Guidelines - OI Management",
    "demographics": {"age": 32, "gender": "Male", "location": "Mumbai, Maharashtra"},
    "chief_complaint": "Progressive breathlessness and dry cough for 3 weeks",
    "presentation": "A 32-year-old long-distance truck driver from Mumbai presents with progressive exertional dyspnea, dry non-productive cough, and low-grade fever for 3 weeks. He has lost 10 kg weight over 6 months. He has oral white patches. He has a history of multiple sexual partners and inconsistent condom use. He has never been tested for HIV.",
    "vital_signs": {"bp": "110/70", "hr": 100, "rr": 30, "temp": 38.0, "spo2": 82},
    "history": "Progressive dyspnea: initially on exertion, now at rest. Dry non-productive cough for 3 weeks. Low-grade fever with night sweats. Weight loss 10 kg in 6 months. Oral white patches for 2 months. Recurrent diarrhea. Long-distance truck driver (Mumbai-Bengaluru route). Multiple sexual partners. Inconsistent condom use. No IV drug use. Never tested for HIV. No known TB contact. No prior hospitalizations.",
    "physical_exam": "Cachexic, tachypneic (using accessory muscles). Oral candidiasis (thick white plaques on palate and tongue). Generalized lymphadenopathy (cervical, axillary, inguinal - firm, non-tender). Chest: Bilateral fine inspiratory crepitations (out of proportion to auscultatory findings - 'silent chest' discrepancy with severe hypoxemia). Dermatology: Seborrheic dermatitis, papular pruritic eruption. Angular cheilitis. Hepatosplenomegaly.",
    "investigations": "HIV-1 ELISA: Reactive. HIV Western Blot: Positive. CD4 count: 45 cells/μL (severely immunocompromised). HIV viral load: 850,000 copies/mL. CXR: Bilateral diffuse ground-glass opacities (perihilar, butterfly pattern). LDH: 650 U/L (elevated). ABG: PaO2 52 mmHg (severe hypoxemia), A-a gradient 45 (elevated). Induced sputum: Pneumocystis jirovecii on silver stain. β-D-glucan: 450 pg/mL (elevated). CBC: Pancytopenia. Sputum GeneXpert MTB: Not detected.",
    "diagnosis": "HIV/AIDS (WHO Stage IV) with Pneumocystis jirovecii pneumonia (PCP) and oral candidiasis",
    "differentials": ["PCP pneumonia", "Pulmonary tuberculosis", "Cytomegalovirus pneumonitis", "Lymphocytic interstitial pneumonitis", "Pulmonary Kaposi sarcoma", "Bacterial pneumonia"],
    "learning_points": [
      "PCP occurs at CD4 <200 cells/μL - bilateral GGO with elevated LDH is classic",
      "Treatment: TMP-SMX (15-20 mg/kg/day of TMP component) for 21 days",
      "Add corticosteroids if PaO2 <70 mmHg (prednisone 40mg BD x 5 days, taper over 21 days)",
      "Do NOT start ART immediately in PCP - wait 2 weeks to reduce IRIS risk",
      "PCP prophylaxis: TMP-SMX 1 DS daily when CD4 <200 or oral candidiasis",
      "Truck drivers are a bridge population for HIV transmission in India"
    ],
    "india_context": "India has ~2.4 million PLHIV (third largest globally). NACO runs the National AIDS Control Programme with free ART at 650+ centers. Truck drivers and migrant workers are high-risk bridge populations. NACO's targeted interventions along national highways have reduced prevalence in this group. First-line ART: TLD (Tenofovir + Lamivudine + Dolutegravir)."
  },
  {
    "id": "INF-008",
    "title": "Acute Viral Hepatitis E in Pregnancy",
    "specialty": "infectious",
    "difficulty": "intermediate",
    "source": "IJMR - Hepatitis E Pregnancy Outcomes",
    "demographics": {"age": 26, "gender": "Female", "location": "Kanpur, UP"},
    "chief_complaint": "Jaundice and vomiting in third trimester of pregnancy",
    "presentation": "A 26-year-old pregnant woman (32 weeks gestation) from Kanpur presents with progressive jaundice for 5 days, nausea, vomiting, and dark urine. She lives in a low-income area with poor sanitation. There have been several cases of jaundice in her neighborhood following waterlogging from recent rains. She is anxious about her pregnancy.",
    "vital_signs": {"bp": "90/60", "hr": 110, "rr": 22, "temp": 37.5, "spo2": 95},
    "history": "Jaundice for 5 days, progressive deepening. Nausea and vomiting for 1 week. Dark cola-colored urine. Clay-colored stools. Anorexia and malaise. Right upper quadrant discomfort. 32 weeks pregnant, first pregnancy, previously uneventful. Lives in area with recent waterlogging, shared community water source. 5-6 neighbors also developed jaundice in past 2 weeks. No alcohol. No drug intake. No prior liver disease. No blood transfusions.",
    "physical_exam": "Deeply icteric. Dehydrated. Drowsy but arousable (Grade II hepatic encephalopathy developing). Gravid uterus, fetal heart rate 150/min (normal). Liver: Not palpable (shrunken - ominous). Mild ascites. No splenomegaly. Asterixis present. No pedal edema beyond pregnancy-related. Bruising at injection sites (coagulopathy).",
    "investigations": "HEV IgM: Positive. HAV IgM: Negative. HBsAg: Negative. Anti-HCV: Negative. LFT: Bilirubin 22 mg/dL, AST 1500, ALT 1800, ALP 280, Albumin 2.2. PT/INR: 3.5 (severely prolonged). CBC: Hb 9.5, WBC 11,000, Platelets 85,000. Creatinine: 2.1. Blood glucose: 55 mg/dL (hypoglycemia). Ammonia: 180 μg/dL. USG: Shrunken liver (10 cm span), ascites, viable fetus 32 weeks. Fibroscan/elastography: Not indicated acutely.",
    "diagnosis": "Acute hepatitis E with acute liver failure (fulminant hepatic failure) in pregnancy",
    "differentials": ["Hepatitis E (epidemic)", "Hepatitis A", "Drug-induced liver injury (DILI)", "HELLP syndrome", "Acute fatty liver of pregnancy", "Autoimmune hepatitis flare"],
    "learning_points": [
      "HEV in pregnancy has 15-25% mortality (vs <1% in non-pregnant) - highest in third trimester",
      "India has the highest HEV burden globally - Genotype 1 is most common and most dangerous in pregnancy",
      "Fulminant hepatic failure criteria: Encephalopathy + INR >1.5 within 26 weeks of liver disease onset",
      "Management: ICU care, correct coagulopathy (FFP), treat hypoglycemia, lactulose for encephalopathy",
      "Obstetric decision: Do NOT induce labor for liver disease alone; deliver only for obstetric indications",
      "Waterborne transmission - outbreaks linked to fecal contamination of water supply post-flooding"
    ],
    "india_context": "HEV is the most common cause of acute viral hepatitis in India. Epidemic outbreaks linked to contaminated water supply, especially post-monsoon and floods. Kanpur, Delhi, Hyderabad have reported major outbreaks. No specific antiviral treatment. HEV vaccine (Hecolin) approved in China but not yet in India. Prevention is through safe water supply."
  },
  {
    "id": "INF-009",
    "title": "Kala-azar (Visceral Leishmaniasis) with Pancytopenia",
    "specialty": "infectious",
    "difficulty": "intermediate",
    "source": "NVBDCP - Kala-azar Elimination Program",
    "demographics": {"age": 18, "gender": "Male", "location": "Muzaffarpur, Bihar"},
    "chief_complaint": "Prolonged fever and progressive abdominal swelling for 2 months",
    "presentation": "An 18-year-old farm laborer from Muzaffarpur district, Bihar presents with irregular fever for 2 months, progressive abdominal distension, weight loss, and darkening of skin. He lives in a mud house in an area endemic for kala-azar. He has been treated with multiple courses of antibiotics without improvement. His younger brother was treated for kala-azar last year.",
    "vital_signs": {"bp": "100/60", "hr": 96, "rr": 18, "temp": 38.5, "spo2": 97},
    "history": "Fever for 2 months - irregular, double quotidian (two spikes daily). Progressive abdominal swelling (massive spleen). Weight loss 8 kg. Skin darkening (especially face and hands - hence 'kala-azar' = black fever). Bleeding from gums, epistaxis. Treated with multiple antibiotics (amoxicillin, azithromycin, ciprofloxacin) - no response. Lives in mud house with cracks in walls (sandfly habitat). Brother treated for kala-azar. Endemic area. No travel outside Bihar.",
    "physical_exam": "Emaciated, febrile, hyperpigmented (face, hands, abdomen). Pallor severe. Massive splenomegaly (8 cm below costal margin, crossing midline). Hepatomegaly 4 cm. Generalized non-tender lymphadenopathy. No jaundice. Gum hypertrophy and bleeding. Pedal edema (hypoalbuminemia). Skin: Dry, rough, darkened.",
    "investigations": "rK39 rapid test: Positive. Splenic aspirate (if done): LD bodies (Leishman-Donovan bodies) seen - amastigotes within macrophages. CBC: Pancytopenia - Hb 6.5, WBC 2,100, Platelets 55,000. ESR: 90. Peripheral smear: No malarial parasites. Serum protein: Total protein 9.5 (elevated due to hypergammaglobulinemia), Albumin 1.8 (low), A:G ratio reversed. LFT: Mildly deranged. Renal: Normal. Bone marrow: Plasma cells increased, LD bodies seen.",
    "diagnosis": "Visceral leishmaniasis (Kala-azar) with pancytopenia and severe malnutrition",
    "differentials": ["Visceral leishmaniasis", "Tropical splenomegaly syndrome", "Chronic malaria", "Lymphoma/Leukemia", "Myelofibrosis", "Miliary TB with hepatosplenomegaly"],
    "learning_points": [
      "Kala-azar classic triad: Fever + Massive splenomegaly + Pancytopenia in endemic area",
      "rK39 rapid test has >95% sensitivity and specificity - first-line diagnostic in India",
      "First-line treatment in India: Single-dose liposomal amphotericin B (AmBisome 10 mg/kg) - NVBDCP recommendation",
      "Miltefosine (oral) is an alternative but has teratogenic potential and GI side effects",
      "Reversed A:G ratio (polyclonal hypergammaglobulinemia) is characteristic",
      "PKDL (Post-kala-azar dermal leishmaniasis) can occur months-years after treatment - acts as reservoir"
    ],
    "india_context": "India accounts for ~60% of global VL cases. Bihar alone reports 80% of Indian cases. Muzaffarpur is the epicenter. India targets kala-azar elimination (<1 case per 10,000 population at block level) by 2023 (extended). NVBDCP provides free diagnosis (rK39) and treatment (AmBisome). Indoor residual spraying with DDT/synthetic pyrethroids targets the sandfly vector (Phlebotomus argentipes)."
  },
  {
    "id": "INF-010",
    "title": "Japanese Encephalitis in a Child",
    "specialty": "infectious",
    "difficulty": "intermediate",
    "source": "NVBDCP - JE/AES Guidelines",
    "demographics": {"age": 8, "gender": "Male", "location": "Gorakhpur, UP"},
    "chief_complaint": "High fever with seizures and unconsciousness",
    "presentation": "An 8-year-old boy from a rice-farming village near Gorakhpur presents during August monsoon season with high-grade fever for 3 days followed by two episodes of generalized seizures and loss of consciousness. He lives near rice paddy fields with pig farming in the vicinity. He did not receive JE vaccination. The area reports annual outbreaks of acute encephalitis syndrome (AES).",
    "vital_signs": {"bp": "100/65", "hr": 120, "rr": 24, "temp": 40.5, "spo2": 94},
    "history": "Fever for 3 days, high-grade, continuous. Severe headache and vomiting. Two generalized tonic-clonic seizures, each lasting 3-5 minutes. Unconscious since last seizure (6 hours ago). No diarrhea. Lives near rice paddies (Culex mosquito breeding). Pigs kept by neighbors (amplifying host for JE virus). Not vaccinated for JE. Annual AES outbreaks in district. No recent travel. Previously healthy child.",
    "physical_exam": "GCS 6/15 (E1V2M3). Febrile (40.5°C). Neck stiffness present. Kernig sign positive. Pupils: Equal, sluggishly reactive. No papilledema. Hypertonia in all limbs. Bilateral plantar extensors. No focal deficits. No rash. No hepatosplenomegaly.",
    "investigations": "CSF: Opening pressure elevated. WBC 120 (lymphocytic predominance). Protein 0.9 g/L (elevated). Glucose 55 mg/dL (blood 110 - normal ratio). JE IgM ELISA (CSF): Positive. JE IgM ELISA (Serum): Positive. CBC: WBC 12,000, Hb 11, Platelets normal. Na+: 128 (SIADH). MRI brain: Bilateral thalamic hyperintensities (T2/FLAIR) - characteristic of JE. EEG: Diffuse slowing with burst suppression.",
    "diagnosis": "Japanese Encephalitis with SIADH",
    "differentials": ["Japanese encephalitis", "Herpes simplex encephalitis", "Scrub typhus encephalitis", "Enteroviral encephalitis", "Cerebral malaria", "Acute disseminated encephalomyelitis (ADEM)"],
    "learning_points": [
      "Bilateral thalamic involvement on MRI is highly suggestive of JE",
      "JE IgM in CSF is the diagnostic gold standard (appears by day 3-4 of illness)",
      "Culex tritaeniorhynchus is the vector; pigs are the amplifying host, wading birds are reservoir",
      "No specific antiviral treatment - supportive care, seizure control, manage raised ICP",
      "Mortality 20-30%; 30-50% of survivors have neurological sequelae (movement disorders, cognitive deficits)",
      "JE vaccine (SA 14-14-2, live attenuated) included in India's UIP since 2006 for endemic districts"
    ],
    "india_context": "Gorakhpur district (UP) was the epicenter of annual AES outbreaks killing hundreds of children. JE vaccination campaigns and improved sanitation have reduced mortality. NVBDCP classifies 171 endemic districts across 21 states. The 2017 BRD Medical College tragedy highlighted healthcare infrastructure gaps. Rice paddies + pig farming creates ideal JE transmission ecology."
  }
]
