[
  {
    "id": "NEPH-001",
    "title": "Diabetic Nephropathy with Nephrotic Syndrome",
    "specialty": "nephrology",
    "difficulty": "intermediate",
    "source": "ISN India Guidelines - Diabetic Kidney Disease",
    "demographics": {"age": 52, "gender": "Male", "location": "Coimbatore, Tamil Nadu"},
    "chief_complaint": "Progressive swelling of face and legs for 3 months",
    "presentation": "A 52-year-old businessman with poorly controlled type 2 diabetes for 18 years presents with progressive facial puffiness, bilateral pedal edema, and frothy urine for 3 months. His HbA1c has been consistently above 9%. He also has hypertension and diabetic retinopathy.",
    "vital_signs": {"bp": "165/100", "hr": 82, "rr": 16, "temp": 37.0, "spo2": 98},
    "history": "T2DM for 18 years, on glimepiride and metformin. HbA1c 9.5% consistently. Hypertension for 10 years on amlodipine. Progressive swelling: face in mornings, legs by evening. Frothy urine noticed for 4 months. Reduced urine output. No hematuria. Known bilateral proliferative diabetic retinopathy (laser done). Peripheral neuropathy (burning feet). No NSAID use.",
    "physical_exam": "Periorbital edema, bilateral pitting pedal edema up to knees. BP 165/100. Fundoscopy: Proliferative diabetic retinopathy with laser scars. Reduced sensation in stocking distribution (neuropathy). No rash. No joint swelling. Abdomen: Mild ascites.",
    "investigations": "Urine: Protein 4+, 24-hour urine protein 5.2g (nephrotic range >3.5g). Urine albumin-creatinine ratio (UACR): 3500 mg/g (severely increased). Serum albumin: 2.0 g/dL. Cholesterol: 320 mg/dL (dyslipidemia). Creatinine: 2.8 mg/dL, eGFR: 22 mL/min (CKD Stage 4). HbA1c: 9.8%. Renal USG: Bilateral normal-sized kidneys (unlike other causes of CKD), increased cortical echogenicity. ANA, C3/C4, ANCA: Normal. Hepatitis B/C: Negative. Renal biopsy (if done): Nodular glomerulosclerosis (Kimmelstiel-Wilson nodules).",
    "diagnosis": "Diabetic nephropathy (diabetic kidney disease) with nephrotic syndrome — CKD Stage 4",
    "differentials": ["Diabetic nephropathy", "Membranous nephropathy", "Minimal change disease", "Amyloidosis", "Focal segmental glomerulosclerosis", "Lupus nephritis"],
    "learning_points": [
      "Diabetic nephropathy is the leading cause of ESRD in India and globally",
      "Biopsy not always needed if: longstanding DM + retinopathy + gradual proteinuria increase + normal-sized kidneys",
      "ACEi/ARB is mandatory for proteinuria reduction (target <500 mg/day or 50% reduction)",
      "SGLT2 inhibitors (dapagliflozin/empagliflozin) reduce CKD progression independent of diabetes control",
      "Finerenone (non-steroidal MRA) is a new addition to DKD management",
      "Prepare for dialysis when eGFR <15, start AV fistula creation at eGFR <20"
    ],
    "india_context": "India has 77 million diabetics (2nd highest globally). Diabetic nephropathy accounts for 30-40% of patients on dialysis in India. Only 10% of ESRD patients in India can access dialysis due to cost. PM-National Dialysis Programme provides free dialysis at district hospitals."
  },
  {
    "id": "NEPH-002",
    "title": "Nephrotic Syndrome in a Child — Minimal Change Disease",
    "specialty": "nephrology",
    "difficulty": "beginner",
    "source": "IAP Guidelines - Childhood Nephrotic Syndrome",
    "demographics": {"age": 5, "gender": "Male", "location": "Lucknow, UP"},
    "chief_complaint": "Puffy eyes and swollen legs for 1 week",
    "presentation": "A 5-year-old boy is brought by his mother with progressive puffy eyes noticed every morning for 1 week, now progressing to bilateral leg swelling and abdominal distension. The mother reports his urine has become frothy and reduced in amount. He had an upper respiratory tract infection 2 weeks ago.",
    "vital_signs": {"bp": "90/60", "hr": 100, "rr": 20, "temp": 37.0, "spo2": 98},
    "history": "Upper respiratory infection 2 weeks ago. Periorbital puffiness noticed 1 week ago, initially mornings only, now persistent. Progressive bilateral leg swelling. Abdominal distension. Frothy urine, reduced volume. No gross hematuria. No fever. No rash. No joint pains. Previously healthy child. Vaccinations up to date. No family history of kidney disease.",
    "physical_exam": "Periorbital edema, bilateral pitting pedal edema. Distended abdomen with shifting dullness (ascites). Scrotal edema. No rash. No hepatosplenomegaly. BP normal for age. No hypertension. Rest of examination normal.",
    "investigations": "Urine: Protein 4+, no RBCs, no casts. Spot UPCR: 8.5 (nephrotic range >2 in children). 24-hour urine protein: 3.5g/m²/day (or UPCR >2). Serum albumin: 1.5 g/dL. Cholesterol: 380 mg/dL. Triglycerides: 280. Creatinine: 0.4 (normal for age). C3, C4: Normal. ANA: Negative. HBsAg: Negative. ASO: Mildly elevated (recent URTI). Renal USG: Normal-sized kidneys, no structural abnormality.",
    "diagnosis": "Idiopathic nephrotic syndrome — most likely minimal change disease (first episode, steroid trial indicated)",
    "differentials": ["Minimal change disease", "Focal segmental glomerulosclerosis", "Membranous nephropathy", "IgA nephropathy", "Post-infectious glomerulonephritis", "Lupus nephritis"],
    "learning_points": [
      "In children 1-10 years, nephrotic syndrome is MCD until proven otherwise — no biopsy needed for first episode",
      "Biopsy indications in children: Age <1 or >10, steroid resistance, frequent relapses, atypical features (hematuria, low C3, HTN)",
      "Steroid protocol: Prednisolone 2mg/kg/day (max 60mg) for 6 weeks, then 1.5mg/kg alternate day for 6 weeks (modified ISKDC)",
      "90-95% of MCD responds to steroids within 4 weeks (steroid-sensitive)",
      "Frequent relapsers: Consider levamisole, cyclophosphamide, MMF, or rituximab",
      "Complications: Peritonitis (pneumococcal), thrombosis, infections — give pneumococcal vaccine"
    ],
    "india_context": "Childhood nephrotic syndrome incidence in India is 12-16 per 100,000 children (2x Western rates). The Indian Society of Pediatric Nephrology (ISPN) recommends modified ISKDC protocol. Generic prednisolone is affordable. Steroid-resistant cases require biopsy and second-line agents. Rituximab access is improving through charitable trusts."
  },
  {
    "id": "NEPH-003",
    "title": "IgA Nephropathy with Recurrent Gross Hematuria",
    "specialty": "nephrology",
    "difficulty": "intermediate",
    "source": "IJMR - Glomerulonephritis in India",
    "demographics": {"age": 24, "gender": "Male", "location": "Guwahati, Assam"},
    "chief_complaint": "Recurrent episodes of red-colored urine coinciding with sore throats",
    "presentation": "A 24-year-old college student presents with his third episode of painless gross hematuria (cola-colored urine) that started 24 hours after developing a sore throat. Previous episodes resolved spontaneously. He is now found to have persistent microscopic hematuria and proteinuria between episodes.",
    "vital_signs": {"bp": "145/92", "hr": 76, "rr": 16, "temp": 37.5, "spo2": 99},
    "history": "Third episode of gross hematuria in 2 years. Each episode coincides with upper respiratory infection (synpharyngitic — within 24-48 hours, NOT 2-3 weeks like PSGN). Cola-colored urine, no clots. Resolves in 3-5 days. Between episodes: routine check found microscopic hematuria and mild proteinuria. Current: sore throat yesterday, today noticed dark urine. Mild loin discomfort bilateral. No dysuria. No edema. No family history of kidney disease. No hearing issues.",
    "physical_exam": "BP 145/92 (mild hypertension for age). No edema. No rash. No joint swelling. Throat: Mildly congested. No hepatosplenomegaly. Examination otherwise normal.",
    "investigations": "Urine: RBCs 3+, dysmorphic RBCs on phase contrast (glomerular), RBC casts, Protein 1+. UPCR: 1.2 g/g. Serum creatinine: 1.3 mg/dL. Serum IgA: 450 mg/dL (elevated). C3, C4: Normal (KEY — distinguishes from PSGN where C3 is low). ASO: Mildly elevated (concurrent URTI). ANA, ANCA: Negative. Renal biopsy: Mesangial proliferative GN, IgA dominant immunofluorescence deposits. Oxford classification: M1 E1 S0 T0 C1.",
    "diagnosis": "IgA nephropathy (Berger disease) with recurrent synpharyngitic gross hematuria",
    "differentials": ["IgA nephropathy", "Post-streptococcal GN", "Thin basement membrane disease", "Alport syndrome", "IgA vasculitis (HSP) nephritis", "Lupus nephritis"],
    "learning_points": [
      "IgA nephropathy is the commonest GN worldwide and in India",
      "Synpharyngitic hematuria (within 24-48h of URTI) vs PSGN (2-3 weeks after URTI) — KEY differentiator",
      "Normal C3 in IgA nephropathy vs LOW C3 in PSGN",
      "Oxford MEST-C classification guides prognosis and treatment",
      "Treatment: ACEi/ARB for proteinuria >0.5g/day; steroids if proteinuria >1g despite RAAS blockade",
      "30-40% progress to ESRD over 20 years — not as benign as previously thought"
    ],
    "india_context": "IgA nephropathy accounts for 20-30% of renal biopsies in India. Northeast India (Assam, Meghalaya) reports higher prevalence. Indian Renal Biopsy Registry data shows IgAN as the most common primary GN. KDIGO 2021 guidelines incorporated into Indian nephrology practice."
  },
  {
    "id": "NEPH-004",
    "title": "Acute Kidney Injury — Contrast-Induced Nephropathy",
    "specialty": "nephrology",
    "difficulty": "intermediate",
    "source": "ISN India - AKI Prevention",
    "demographics": {"age": 65, "gender": "Male", "location": "Jaipur, Rajasthan"},
    "chief_complaint": "Reduced urine output after coronary angiography",
    "presentation": "A 65-year-old man with diabetes and CKD Stage 3 (baseline creatinine 1.8) develops oliguria 48 hours after coronary angiography with contrast dye. He had an elective angiogram for stable angina. He was not adequately hydrated pre-procedure and his metformin was not stopped.",
    "vital_signs": {"bp": "140/80", "hr": 78, "rr": 18, "temp": 37.0, "spo2": 97},
    "history": "Elective coronary angiography 48 hours ago for stable angina. 150 mL iodinated contrast used. Known CKD Stage 3 (creatinine 1.8, eGFR 38). T2DM on metformin, glimepiride. Hypertension. No pre-hydration given. Metformin not stopped before procedure. Urine output dropped to 200 mL in last 24 hours. No fever. No hypotension during procedure.",
    "physical_exam": "Mild bilateral pedal edema. BP 140/80. JVP mildly elevated. Lungs: Bibasal crepitations. Femoral access site: Clean, no hematoma. Otherwise unremarkable.",
    "investigations": "Creatinine: 4.2 (from baseline 1.8 — >2x increase). BUN: 65. Potassium: 5.8. Bicarbonate: 16 (metabolic acidosis). Urine output: 200 mL/24h (oliguric AKI). Urine: FENa 0.8% (prerenal pattern initially), muddy brown casts (ATN developing). Urine eosinophils: Negative. Lactate: 2.5. Renal USG: Normal-sized kidneys, no hydronephrosis. CBC: Normal. ECG: Peaked T waves (hyperkalemia).",
    "diagnosis": "Contrast-induced acute kidney injury (CI-AKI) superimposed on CKD Stage 3, with hyperkalemia",
    "differentials": ["Contrast-induced nephropathy", "Atheroembolic renal disease (cholesterol emboli post-cath)", "Prerenal AKI (dehydration)", "Acute interstitial nephritis", "Renal artery dissection (post-catheterization)", "Cardiorenal syndrome"],
    "learning_points": [
      "CI-AKI defined: Creatinine rise >0.5 mg/dL or >25% from baseline within 48-72 hours of contrast",
      "Risk factors: Pre-existing CKD (most important), diabetes, dehydration, high contrast volume, nephrotoxic drugs",
      "Prevention: IV normal saline hydration (1 mL/kg/hr for 12h pre and post), use low-osmolar contrast, minimize volume",
      "Metformin must be stopped 48h before contrast in CKD (risk of lactic acidosis if AKI develops)",
      "NAC (N-acetylcysteine) — no longer recommended (no proven benefit per PRESERVE trial)",
      "Hyperkalemia emergency: IV calcium gluconate (membrane stabilizer) + insulin-dextrose + salbutamol nebulization"
    ],
    "india_context": "With increasing cardiac catheterization in India (>500,000/year), CI-AKI is a growing problem. Many patients have undiagnosed CKD at the time of angiography. Pre-hydration protocols are often skipped due to high patient volume. ISN India recommends mandatory eGFR check before all contrast procedures."
  },
  {
    "id": "NEPH-005",
    "title": "Rapidly Progressive Glomerulonephritis — ANCA Vasculitis",
    "specialty": "nephrology",
    "difficulty": "advanced",
    "source": "IJMR - RPGN in India",
    "demographics": {"age": 55, "gender": "Female", "location": "Pune, Maharashtra"},
    "chief_complaint": "Rapidly worsening kidney function with bloody urine and cough",
    "presentation": "A 55-year-old woman presents with 3 weeks of gross hematuria, progressive oliguria, malaise, and hemoptysis. Her creatinine has risen from normal to 6.5 mg/dL in just 3 weeks. She also has nasal crusting and recurrent sinusitis for 6 months. She has coughed up blood twice.",
    "vital_signs": {"bp": "160/95", "hr": 88, "rr": 22, "temp": 37.5, "spo2": 93},
    "history": "Gross hematuria for 3 weeks, cola-colored. Reduced urine output progressively. Malaise, fatigue, weight loss 4 kg over 2 months. Nasal stuffiness and bloody crusting for 6 months (ENT treated as chronic sinusitis). Hemoptysis x 2 episodes (pulmonary involvement). Joint pains (wrists, knees). No rash. No hearing loss. Previously healthy, no prior kidney disease. Creatinine 3 months ago: 0.9 mg/dL.",
    "physical_exam": "Pale, edematous. BP 160/95. Nasal mucosa: Crusted, granular (saddle nose deformity developing). Lungs: Bilateral crepitations (pulmonary hemorrhage). Skin: No purpura. Joints: Mild synovitis wrists. Urine: Visibly bloody.",
    "investigations": "Creatinine: 6.5 (was 0.9 three months ago — RPGN). Urine: RBCs 3+, RBC casts (active GN), Protein 2+. c-ANCA (PR3-ANCA): Strongly positive. p-ANCA: Negative. Anti-GBM: Negative. ANA: Negative. C3/C4: Normal. CXR: Bilateral pulmonary infiltrates (hemorrhage). CT chest: Ground-glass opacities (diffuse alveolar hemorrhage). Renal biopsy: Crescentic GN (>50% crescents), pauci-immune pattern on IF. ENT biopsy: Granulomatous inflammation.",
    "diagnosis": "Granulomatosis with polyangiitis (GPA, formerly Wegener's) — ANCA-associated vasculitis with RPGN and pulmonary hemorrhage",
    "differentials": ["GPA (Wegener's)", "Microscopic polyangiitis", "Anti-GBM disease (Goodpasture)", "SLE nephritis", "IgA vasculitis (HSP)", "Post-infectious crescentic GN"],
    "learning_points": [
      "RPGN = doubling of creatinine in days to weeks — nephrological emergency requiring urgent biopsy",
      "Three types of crescentic GN: Type I (anti-GBM, linear IF), Type II (immune complex, granular IF), Type III (pauci-immune, ANCA-associated)",
      "GPA triad: Upper airway (sinusitis, saddle nose) + Lower airway (hemorrhage) + Kidney (crescentic GN)",
      "c-ANCA/PR3 = GPA; p-ANCA/MPO = MPA (microscopic polyangiitis)",
      "Treatment: Pulse methylprednisolone + cyclophosphamide (or rituximab) induction, then azathioprine maintenance",
      "Plasmapheresis for pulmonary hemorrhage or dialysis-requiring RPGN (PEXIVAS trial)"
    ],
    "india_context": "ANCA vasculitis is increasingly recognized in India. Indian Renal Biopsy Registry shows crescentic GN accounts for 10-15% of biopsies. Many cases are diagnosed late due to initial treatment as 'sinusitis'. Cyclophosphamide is available and affordable. Rituximab access is improving. Dialysis may be needed as bridge during induction."
  },
  {
    "id": "NEPH-006",
    "title": "Post-Streptococcal Glomerulonephritis in a Child",
    "specialty": "nephrology",
    "difficulty": "beginner",
    "source": "IAP Guidelines - PSGN",
    "demographics": {"age": 8, "gender": "Male", "location": "Patna, Bihar"},
    "chief_complaint": "Puffy face, dark urine, and reduced urination after skin infection",
    "presentation": "An 8-year-old boy from a low-income family in Patna presents with sudden onset facial puffiness, cola-colored urine, and reduced urine output for 3 days. He had multiple infected insect bites (impetigo) on his legs 3 weeks ago that were treated with topical ointment only.",
    "vital_signs": {"bp": "140/95", "hr": 90, "rr": 22, "temp": 37.2, "spo2": 97},
    "history": "Multiple infected insect bites on both legs 3 weeks ago, crusted lesions (impetigo). Treated with topical mupirocin. 3 weeks later: sudden facial puffiness, cola-colored urine, reduced volume. Headache. No sore throat. No fever currently. No rash. No joint pains. Lives in crowded conditions, poor sanitation. Similar illness in a neighborhood child last month.",
    "physical_exam": "Periorbital edema, mild bilateral pedal edema. BP 140/95 (hypertensive for age). Healing impetigo lesions on both legs (crusted, resolving). No rash. No joint swelling. Abdomen: No ascites (unlike nephrotic syndrome). Fundoscopy: Normal (no hypertensive changes yet).",
    "investigations": "Urine: RBCs 3+ (dysmorphic), RBC casts, Protein 1-2+. Creatinine: 1.2 (elevated for age). C3: 25 mg/dL (markedly LOW — key finding). C4: Normal. ASO titer: 800 IU/mL (elevated). Anti-DNase B: Positive (more sensitive for post-skin infection PSGN). Throat swab: Negative (not pharyngitis-associated in this case). CBC: Hb 10.5 (dilutional anemia). Renal USG: Normal-sized kidneys, mildly echogenic.",
    "diagnosis": "Acute post-streptococcal glomerulonephritis (PSGN) following skin infection (impetigo)",
    "differentials": ["PSGN", "IgA nephropathy", "Membranoproliferative GN", "Lupus nephritis", "C3 glomerulopathy", "Henoch-Schönlein purpura nephritis"],
    "learning_points": [
      "PSGN: Nephritic presentation 2-3 weeks after pharyngitis OR 3-6 weeks after skin infection",
      "Low C3 with normal C4 (alternative pathway activation) is the hallmark — differentiates from IgA nephropathy (normal C3)",
      "Self-limiting in children: >95% recover completely. C3 normalizes in 6-8 weeks",
      "Treatment is supportive: Salt/fluid restriction, antihypertensives (furosemide, nifedipine), no immunosuppression needed",
      "Biopsy indications: Persistent low C3 >8 weeks, worsening renal function, nephrotic-range proteinuria",
      "Anti-DNase B is more sensitive than ASO for skin-infection-associated PSGN"
    ],
    "india_context": "PSGN remains common in India, especially in children from lower socioeconomic groups. Impetigo during monsoon/hot months is a major trigger. Group A strep prevalence is high in overcrowded settings. ICMR data shows declining incidence with improved hygiene but still significant in rural areas."
  },
  {
    "id": "NEPH-007",
    "title": "Renal Tubular Acidosis Type 1 with Nephrolithiasis",
    "specialty": "nephrology",
    "difficulty": "advanced",
    "source": "Indian Journal of Nephrology",
    "demographics": {"age": 30, "gender": "Female", "location": "Jodhpur, Rajasthan"},
    "chief_complaint": "Recurrent kidney stones and muscle weakness",
    "presentation": "A 30-year-old Rajasthani woman presents with her fourth episode of kidney stones in 3 years, now with bilateral flank pain and muscle weakness. She has been found to have persistent hypokalemia despite supplementation. She also reports polyuria and polydipsia. Stone analysis from a previous episode showed calcium phosphate.",
    "vital_signs": {"bp": "110/70", "hr": 88, "rr": 18, "temp": 37.0, "spo2": 98},
    "history": "Four episodes of renal colic in 3 years. Previous stone analysis: Calcium phosphate (not calcium oxalate). Persistent muscle weakness and fatigue. Polyuria (3-4 liters/day), polydipsia. Muscle cramps, especially at night. Hypokalemia found on multiple occasions (K+ 2.5-3.0 despite supplements). No diarrhea. No laxative use. No family history of stones or kidney disease. Dry climate (Rajasthan).",
    "physical_exam": "Thin build. Mild proximal muscle weakness (difficulty rising from chair). Hyporeflexia. Bilateral renal angle tenderness. No bony deformities. No dental enamel defects. Rest examination normal.",
    "investigations": "ABG: pH 7.28, HCO3 14 (normal anion gap metabolic acidosis — NAGMA). Anion gap: 10 (normal). K+: 2.4 (hypokalemia). Urine pH: 6.8 (inappropriately alkaline despite systemic acidosis — KEY). Urine anion gap: +15 (positive — impaired ammonium excretion). Creatinine: 1.5. Calcium: 9.0. Phosphate: 3.5. PTH: Normal. 24-hour urine calcium: Elevated (hypercalciuria). CT KUB: Bilateral medullary nephrocalcinosis, right ureteric calculus 8mm. Bone density: Osteopenia (calcium mobilized from bones to buffer acidosis).",
    "diagnosis": "Distal (Type 1) renal tubular acidosis with recurrent calcium phosphate nephrolithiasis and nephrocalcinosis",
    "differentials": ["Distal RTA (Type 1)", "Proximal RTA (Type 2)", "Primary hyperparathyroidism", "Medullary sponge kidney", "Sarcoidosis with hypercalciuria", "Sjögren syndrome (secondary dRTA)"],
    "learning_points": [
      "Distal RTA: Inability to acidify urine below pH 5.3 despite systemic acidosis",
      "Clue: Normal anion gap metabolic acidosis + urine pH >5.5 + positive urine anion gap",
      "Calcium phosphate stones (not oxalate) + nephrocalcinosis = think dRTA",
      "Hypokalemia in dRTA (unlike Type 4 RTA which has hyperkalemia)",
      "Treatment: Oral potassium citrate (alkalinization + potassium replacement + citrate inhibits stone formation)",
      "Screen for Sjögren syndrome and autoimmune conditions in adult-onset dRTA"
    ],
    "india_context": "Rajasthan has the highest nephrolithiasis prevalence in India (12-15%) due to hot climate, dehydration, and dietary factors. RTA is an under-recognized cause of recurrent stones. Many patients undergo repeated lithotripsy without addressing the underlying metabolic cause. Potassium citrate is affordable and available."
  },
  {
    "id": "NEPH-008",
    "title": "Lupus Nephritis in a Young Woman",
    "specialty": "nephrology",
    "difficulty": "advanced",
    "source": "ISN India - Lupus Nephritis Management",
    "demographics": {"age": 22, "gender": "Female", "location": "Delhi"},
    "chief_complaint": "Facial rash, joint pains, and swelling of feet",
    "presentation": "A 22-year-old medical student from Delhi presents with a butterfly-shaped facial rash, polyarthralgia, bilateral pedal edema, and frothy urine for 2 months. She has had recurrent oral ulcers, photosensitivity, and hair loss. Her routine urine exam showed proteinuria and active sediment.",
    "vital_signs": {"bp": "150/95", "hr": 88, "rr": 18, "temp": 37.5, "spo2": 98},
    "history": "Butterfly rash on face for 3 months, worsens with sun exposure. Bilateral small joint pains (MCPs, PIPs, wrists) for 4 months, no deformity. Oral ulcers recurrent. Hair loss (diffuse). Photosensitivity. Bilateral pedal edema for 2 months. Frothy urine. Fatigue, malaise. No seizures. No pleuritic chest pain. LMP: Regular. Family history: Maternal aunt has 'lupus'.",
    "physical_exam": "Malar (butterfly) rash sparing nasolabial folds. Diffuse non-scarring alopecia. Oral ulcers on hard palate. Tender MCPs and PIPs bilaterally (non-erosive arthritis). Bilateral pedal edema. No pleural effusion. No lymphadenopathy. No hepatosplenomegaly.",
    "investigations": "ANA: Positive (1:640, homogeneous pattern). Anti-dsDNA: Strongly positive (450 IU/mL). C3: 40 mg/dL (low). C4: 5 mg/dL (very low). Anti-Smith: Positive. Urine: Protein 3+, RBCs 2+, RBC casts. 24-hour urine protein: 3.8g. Creatinine: 1.4. Albumin: 2.5. CBC: Hb 9.0 (hemolytic anemia, Coombs positive), WBC 3,000 (leucopenia), Platelets 100,000. ESR: 85 (elevated). CRP: 15 (less elevated than ESR — typical of SLE). Renal biopsy: Class IV diffuse proliferative lupus nephritis (ISN/RPS), Activity Index 12, Chronicity Index 3.",
    "diagnosis": "Systemic lupus erythematosus with Class IV diffuse proliferative lupus nephritis",
    "differentials": ["SLE with lupus nephritis", "IgA nephropathy", "ANCA-associated vasculitis", "Membranoproliferative GN", "Thrombotic microangiopathy", "Mixed connective tissue disease"],
    "learning_points": [
      "Lupus nephritis occurs in 50-70% of SLE patients — Class IV is most common and most serious",
      "ISN/RPS Classification: I (minimal mesangial), II (mesangial proliferative), III (focal), IV (diffuse), V (membranous), VI (sclerosing)",
      "Anti-dsDNA and low C3/C4 correlate with disease activity in lupus nephritis",
      "Treatment Class III/IV: Induction with mycophenolate (MMF) or cyclophosphamide + steroids, then maintenance with MMF + low-dose pred",
      "Voclosporin (calcineurin inhibitor) added to MMF improves renal response — new addition",
      "Belimumab (anti-BLyS) approved as add-on for active lupus nephritis"
    ],
    "india_context": "SLE prevalence in India is estimated at 30-50 per 100,000. Young women (15-40) are predominantly affected. Lupus nephritis is the most serious organ manifestation. Indian Rheumatology Association (IRA) guidelines recommend early biopsy. MMF is first-line induction in India (preferred over cyclophosphamide for fertility preservation). Generic MMF is affordable."
  },
  {
    "id": "NEPH-009",
    "title": "Obstructive Uropathy with AKI — Bilateral Ureteric Calculi",
    "specialty": "nephrology",
    "difficulty": "intermediate",
    "source": "Indian Journal of Urology",
    "demographics": {"age": 45, "gender": "Male", "location": "Kanpur, UP"},
    "chief_complaint": "No urine output for 24 hours with bilateral flank pain",
    "presentation": "A 45-year-old government clerk presents with anuria (no urine output) for 24 hours, bilateral severe flank pain, nausea, and vomiting. He has a known history of recurrent kidney stones and has passed multiple stones in the past. He presents with AKI and hyperkalemia.",
    "vital_signs": {"bp": "160/100", "hr": 100, "rr": 22, "temp": 37.5, "spo2": 96},
    "history": "Bilateral severe flank pain starting 2 days ago, initially left side, then right. Complete anuria for 24 hours. Nausea and vomiting. Known recurrent calcium oxalate stones for 10 years, has passed 6 stones. High dietary oxalate (spinach, tomato, chikoo). Low water intake. No prior surgical intervention. Family history of stones (father, uncle). Works in air-conditioned office, sedentary.",
    "physical_exam": "Distressed with pain. Bilateral renal angle tenderness. Suprapubic: Bladder not palpable (not urinary retention). No pedal edema. Mild periorbital puffiness.",
    "investigations": "Creatinine: 8.5 (baseline 1.0 — severe AKI). BUN: 90. K+: 6.8 (dangerous hyperkalemia). Na+: 132. Bicarbonate: 12 (metabolic acidosis). ECG: Peaked T waves, widened QRS (hyperkalemic changes). CT KUB (non-contrast): Right ureteric calculus 12mm at VUJ with proximal hydroureter and hydronephrosis. Left ureteric calculus 10mm at PUJ with severe hydronephrosis. Both kidneys: Dilated collecting systems. Renal USG: Bilateral moderate-severe hydronephrosis. CBC: Normal. Uric acid: 9.5.",
    "diagnosis": "Bilateral obstructive uropathy (bilateral ureteric calculi) causing postrenal acute kidney injury with life-threatening hyperkalemia",
    "differentials": ["Bilateral obstructive uropathy", "Bilateral renal vein thrombosis", "Rapidly progressive GN", "Cortical necrosis", "Prerenal AKI (severe dehydration)", "Retroperitoneal fibrosis"],
    "learning_points": [
      "Anuria = think obstruction first (bilateral or obstruction of single functioning kidney)",
      "Postrenal AKI: Requires bilateral obstruction (or unilateral in single kidney) — most reversible cause of AKI",
      "Emergency management: Treat hyperkalemia FIRST (IV calcium gluconate → insulin-dextrose → salbutamol), THEN relieve obstruction",
      "Urgent decompression: Bilateral percutaneous nephrostomy or ureteric stenting (DJ stent)",
      "Post-obstructive diuresis: After relief, expect massive polyuria (5-10 L/day) — replace fluids carefully",
      "Stone prevention: >2.5L water daily, dietary oxalate restriction, potassium citrate, thiazide diuretics for hypercalciuria"
    ],
    "india_context": "India lies in the 'stone belt' — North India (Rajasthan, UP, Gujarat, Maharashtra, Punjab) has 12% prevalence. Hot climate, low water intake, and high oxalate diet (spinach, tomato) drive stone formation. DJ stenting and PCNL are available at district hospitals. ESWL availability is more limited."
  },
  {
    "id": "NEPH-010",
    "title": "CKD Stage 5 — Preparation for Dialysis",
    "specialty": "nephrology",
    "difficulty": "intermediate",
    "source": "ISN India - CKD Management",
    "demographics": {"age": 58, "gender": "Male", "location": "Nagpur, Maharashtra"},
    "chief_complaint": "Nausea, fatigue, and itching with very low kidney function",
    "presentation": "A 58-year-old retired teacher with long-standing hypertension presents with progressive fatigue, nausea, anorexia, generalized itching, and sleep disturbance for 2 months. His creatinine has gradually risen over 5 years from 2.0 to 7.5 mg/dL. He has been non-compliant with medications and follow-up. He now has uremic symptoms requiring dialysis initiation.",
    "vital_signs": {"bp": "175/105", "hr": 84, "rr": 20, "temp": 37.0, "spo2": 95},
    "history": "Known hypertension for 20 years, on amlodipine only (RAAS blocker stopped due to hyperkalemia 2 years ago). Progressive CKD: creatinine 2.0 (5 years ago) → 4.0 (2 years ago) → 7.5 (now). Not on ESA or phosphate binders. Uremic symptoms: Nausea, vomiting, anorexia for 2 months. Generalized pruritus (uremic itch). Restless legs at night. Fatigue, dyspnea on exertion. Weight loss 5 kg. No AV fistula created. No hepatitis B vaccination.",
    "physical_exam": "Pale, sallow complexion (uremic pallor). Scratch marks (pruritus). Uremic fetor. Pericardial friction rub (uremic pericarditis — indication for urgent dialysis). BP 175/105. Bilateral basal crepitations. Mild bilateral pedal edema. No AV fistula.",
    "investigations": "Creatinine: 7.5, eGFR: 7 mL/min (CKD Stage 5/ESRD). BUN: 110. K+: 6.0. Calcium: 7.5 (low). Phosphate: 7.8 (high). iPTH: 650 pg/mL (secondary hyperparathyroidism). Hb: 7.2 (renal anemia — EPO deficiency). Albumin: 2.8. Uric acid: 10.5. ABG: Metabolic acidosis (HCO3 14). Echo: LVH, pericardial effusion (uremic pericarditis). HBsAg/HCV: Negative. HBV antibody: Negative (not vaccinated). AV duplex: Veins suitable for fistula creation.",
    "diagnosis": "CKD Stage 5 (ESRD) due to hypertensive nephrosclerosis with uremic syndrome and uremic pericarditis — urgent dialysis indication",
    "differentials": ["Hypertensive nephrosclerosis", "Diabetic nephropathy (excluded - no DM)", "Chronic GN", "ADPKD", "Obstructive nephropathy", "Analgesic nephropathy"],
    "learning_points": [
      "Uremic pericarditis = absolute indication for urgent hemodialysis",
      "Other urgent dialysis indications: Refractory hyperkalemia, refractory pulmonary edema, severe metabolic acidosis, uremic encephalopathy",
      "CKD-MBD management: Phosphate binders (calcium acetate/sevelamer), calcitriol, cinacalcet for secondary hyperparathyroidism",
      "Renal anemia: EPO-stimulating agents (epoetin/darbepoetin) when Hb <10, target 10-11.5",
      "AV fistula should be created 6 months before anticipated dialysis start (maturation time)",
      "HBV vaccination is essential for all CKD patients (double dose, 4-dose schedule)"
    ],
    "india_context": "India has an estimated 2 lakh ESRD patients, but only 10-15% can access dialysis. PM National Dialysis Programme (PMNDP) provides free hemodialysis at 550+ district hospitals. AV fistula creation is a skill gap in many centers. Peritoneal dialysis (CAPD) is an underutilized home-based alternative. Renal transplant is the best option but donor shortage is severe."
  }
]
