[
  {
    "id": "NEURO-001",
    "title": "Acute Ischemic Stroke - Middle Cerebral Artery",
    "specialty": "neurology",
    "difficulty": "intermediate",
    "source": "Indian Stroke Association Guidelines",
    "demographics": {"age": 58, "gender": "Male", "location": "Ahmedabad, Gujarat"},
    "chief_complaint": "Sudden weakness of right side and inability to speak",
    "presentation": "A 58-year-old Gujarati businessman with poorly controlled diabetes and hypertension is brought to the ER at 7 AM with sudden onset right-sided weakness and inability to speak noticed by wife at 6 AM when he woke up (wake-up stroke, last seen normal at 11 PM). He is unable to comprehend commands or speak coherently.",
    "vital_signs": {"bp": "195/110", "hr": 88, "rr": 18, "temp": 37.0, "spo2": 97},
    "history": "Found at 6 AM with right-sided weakness and incomprehensible speech. Last seen normal at 11 PM (wake-up stroke). Known hypertension for 10 years (irregular medications). Type 2 DM for 8 years (HbA1c 9.5%). No atrial fibrillation known. Smokes 10 cigarettes/day. Overweight. Family history: Father had stroke at 62. No prior TIA/stroke.",
    "physical_exam": "GCS 12 (E3V3M6). Global aphasia (cannot speak, cannot comprehend). Right UMN facial palsy. Right hemiplegia (power 0/5 upper limb, 1/5 lower limb). Right-sided hemisensory loss. Left gaze deviation (eyes look towards the lesion). Right homonymous hemianopia. NIHSS score: 22 (severe stroke). No meningism.",
    "investigations": "CT brain (plain): No hemorrhage (rules out ICH), early ischemic signs (loss of insular ribbon, sulcal effacement left MCA territory). CT angiography: Left MCA M1 segment occlusion. CT perfusion: Large ischemic penumbra (salvageable tissue). MRI DWI (if done): Large left MCA territory diffusion restriction. Blood glucose: 280 mg/dL. INR: 1.0. Platelets: Normal. ECG: Normal sinus rhythm (but need prolonged monitoring for AF). Lipid profile: LDL 165.",
    "diagnosis": "Acute ischemic stroke - left MCA territory (M1 occlusion) - candidate for mechanical thrombectomy",
    "differentials": ["Acute ischemic stroke", "Hemorrhagic stroke", "Todd's paralysis post-seizure", "Hypoglycemia", "Brain tumor with acute presentation", "Hemiplegic migraine"],
    "learning_points": [
      "IV thrombolysis (alteplase) window: 0-4.5 hours from last known well",
      "Mechanical thrombectomy for large vessel occlusion: up to 24 hours (with perfusion imaging selection)",
      "Wake-up stroke: CT perfusion or DWI-FLAIR mismatch can identify candidates for intervention",
      "NIHSS >6 with LVO: Consider thrombectomy regardless of thrombolysis",
      "Do NOT lower BP aggressively unless >220/120 (or >185/110 if giving thrombolysis)",
      "Hyperglycemia in acute stroke worsens outcomes - target 140-180 mg/dL"
    ],
    "india_context": "India has 1.8 million strokes annually. Only 1-3% receive thrombolysis due to delayed presentation and lack of stroke-ready centers. AIIMS and select hospitals offer 24/7 thrombectomy. Indian Stroke Association recommends 'hub and spoke' model for stroke networks. Drip-and-ship or Mothership protocols being developed for Indian cities."
  },
  {
    "id": "NEURO-002",
    "title": "Tubercular Meningitis with Hydrocephalus",
    "specialty": "neurology",
    "difficulty": "advanced",
    "source": "IJMR - Neurotuberculosis",
    "demographics": {"age": 22, "gender": "Male", "location": "Patna, Bihar"},
    "chief_complaint": "Progressive headache, fever, and altered behavior for 3 weeks",
    "presentation": "A 22-year-old college student from Patna presents with insidious onset headache, low-grade fever, and behavioral changes for 3 weeks. He has become increasingly withdrawn, confused, and developed double vision. His roommate reports he has been vomiting in the mornings. He had close contact with a TB patient (uncle who stayed with him for a month).",
    "vital_signs": {"bp": "110/70", "hr": 76, "rr": 16, "temp": 38.0, "spo2": 98},
    "history": "Progressive headache for 3 weeks, worst in mornings. Low-grade fever, night sweats. Personality change: withdrawn, irritable, poor concentration. Double vision (diplopia) for 1 week. Morning vomiting (projectile). Weight loss 5 kg. Uncle (who has sputum-positive TB) stayed with him for 1 month before symptoms started. BCG scar present but vaccination status uncertain. No seizures. No HIV risk factors.",
    "physical_exam": "GCS 13/15 (E3V4M6). Neck stiffness positive. Kernig sign positive. Cranial nerves: Left 6th nerve palsy (abducens - false localizing sign of raised ICP), right 3rd nerve palsy (partial, pupil-involving). Fundoscopy: Bilateral papilledema. No choroidal tubercles. Motor: Mild right hemiparesis. DTRs brisk bilaterally. Bilateral plantar extensors.",
    "investigations": "CSF (after CT): Opening pressure 340 mmH2O, WBC 180 (lymphocytes 85%), Protein 2.8 g/L, Glucose 28 mg/dL (blood glucose 100, ratio 0.28), ADA 22 U/L, Chloride 105 mEq/L (low). CSF GeneXpert: MTB detected, Rif sensitive. AFB stain: Negative. CT brain: Basal meningeal enhancement, hydrocephalus (dilated temporal horns, transependymal edema), 2 tuberculomas (right frontal, left temporal). MRI: Better delineates basal exudates, tuberculomas with ring enhancement. CBC: Hb 11, ESR 55. CXR: Normal (no pulmonary TB). Mantoux: 18 mm.",
    "diagnosis": "Tubercular meningitis (Stage II) with communicating hydrocephalus and multiple tuberculomas",
    "differentials": ["Tubercular meningitis", "Cryptococcal meningitis", "Partially treated bacterial meningitis", "Neurosarcoidosis", "Carcinomatous meningitis", "Fungal meningitis"],
    "learning_points": [
      "TBM CSF formula: Lymphocytic pleocytosis + very high protein + very low glucose + elevated ADA + low chloride",
      "CSF GeneXpert sensitivity: 60-80% (better than AFB smear at 10-20%)",
      "Hydrocephalus in TBM: Communicating (basal exudate blocks CSF absorption) - may need VP shunt",
      "Cranial nerve palsies: 6th (commonest), 3rd, 4th, 7th due to basal meningeal involvement",
      "Treatment: HRZE intensive phase + steroids (dexamethasone 0.4 mg/kg/day, taper over 8 weeks)",
      "Total duration: 9-12 months (intensive 2 months HRZE + continuation 7-10 months HR)"
    ],
    "india_context": "TBM constitutes 1-5% of all TB in India but carries highest mortality (20-50%). Delay in diagnosis is the major determinant of outcome. CSF GeneXpert has been made available at all district hospitals under NTEP. VP shunt surgery for hydrocephalus is available at most medical colleges."
  },
  {
    "id": "NEURO-003",
    "title": "Neurocysticercosis Presenting with Seizures",
    "specialty": "neurology",
    "difficulty": "intermediate",
    "source": "IJMR - Neurocysticercosis in India",
    "demographics": {"age": 28, "gender": "Female", "location": "Chandigarh, Punjab"},
    "chief_complaint": "First episode of seizure",
    "presentation": "A 28-year-old schoolteacher from rural Punjab presents after a witnessed first episode of generalized tonic-clonic seizure lasting 3 minutes. She had complained of intermittent headaches for 2 months. She is a non-vegetarian and eats pork occasionally from local vendors. She has no prior neurological or medical history.",
    "vital_signs": {"bp": "130/80", "hr": 88, "rr": 18, "temp": 37.0, "spo2": 98},
    "history": "Witnessed GTCS lasting 3 minutes with tongue bite and post-ictal confusion (30 minutes). Intermittent headaches for 2 months, holocranial, moderate severity. Non-vegetarian, eats pork from roadside vendors. Lives in area with open defecation practices. No fever. No weight loss. No previous seizures. No family history of epilepsy. No drug use. Menstrual history normal.",
    "physical_exam": "Post-ictal: Drowsy but arousable, oriented. Tongue bite (lateral). No focal neurological deficit. No papilledema. No meningism. No subcutaneous nodules. Rest of examination normal.",
    "investigations": "CT brain (contrast): Multiple ring-enhancing lesions (3-4 lesions, 10-15 mm each) with perilesional edema, one lesion with eccentric dot (scolex). One lesion with calcification (old, dead cyst). MRI brain: Better delineation - vesicular stage (cyst with scolex), colloidal stage (enhancing lesion), and calcified granuloma. Cysticercus IgG ELISA (serum): Positive. CBC: Mild eosinophilia. Stool: No ova/cysts. EEG: Left temporal sharp waves.",
    "diagnosis": "Neurocysticercosis (NCC) with multiple stages - presenting with new-onset seizures",
    "differentials": ["Neurocysticercosis", "Brain tuberculoma", "Brain metastases", "Toxoplasmosis (if HIV+)", "Brain abscess", "Primary brain tumor"],
    "learning_points": [
      "NCC is the commonest cause of acquired epilepsy in India and the developing world",
      "Ring-enhancing lesion with eccentric dot (scolex) is pathognomonic",
      "Stages: Vesicular (viable cyst) → Colloidal (degenerating) → Granular-nodular → Calcified",
      "Treatment: Albendazole 15 mg/kg/day for 2-4 weeks + steroids (to reduce inflammation) + antiepileptics",
      "Steroids should be started 1-2 days BEFORE albendazole to prevent paradoxical worsening",
      "Single enhancing lesion (solitary cysticercus granuloma) may resolve spontaneously"
    ],
    "india_context": "India has the highest NCC burden globally. The 'pig-man-pig' cycle is perpetuated by open defecation and free-roaming pigs. Solitary cysticercus granuloma (SCG) is the commonest CT finding in Indian patients with new-onset seizures. ICMR recommends albendazole + praziquantel combination for >2 viable cysts. Mass deworming and improved sanitation are key prevention strategies."
  },
  {
    "id": "NEURO-004",
    "title": "Myasthenia Gravis with Myasthenic Crisis",
    "specialty": "neurology",
    "difficulty": "advanced",
    "source": "Annals of Indian Academy of Neurology",
    "demographics": {"age": 30, "gender": "Female", "location": "Chennai, Tamil Nadu"},
    "chief_complaint": "Progressive drooping of eyelids, difficulty swallowing, and now breathlessness",
    "presentation": "A 30-year-old IT professional from Chennai presents with progressive bilateral ptosis, diplopia, difficulty chewing and swallowing, and nasal voice for 3 months. She now presents with acute worsening of weakness and breathlessness after a respiratory tract infection. She was recently started on azithromycin by her GP.",
    "vital_signs": {"bp": "120/75", "hr": 100, "rr": 28, "temp": 37.5, "spo2": 91},
    "history": "Bilateral ptosis for 3 months, worse in evenings and with fatigue. Diplopia. Difficulty chewing meat (jaw fatigue). Nasal regurgitation of liquids. Nasal voice. Generalized fatigue. Upper respiratory infection 5 days ago. GP prescribed azithromycin (a drug that can exacerbate MG). Since yesterday: rapidly worsening weakness, unable to lift arms, difficulty breathing, unable to swallow saliva. FVC declining.",
    "physical_exam": "Bilateral ptosis (worse on sustained upgaze - fatigable). Diplopia on lateral gaze. Facial weakness (cannot blow cheeks). Bulbar weakness: Nasal speech, pooling of saliva, weak cough. Neck flexor weakness. Proximal limb weakness (3/5 upper, 4/5 lower). Fatigable weakness on repetitive testing. FVC: 800 mL (predicted 2800 mL) - CRITICAL. Using accessory muscles. No sensory deficits. Reflexes preserved.",
    "investigations": "Anti-AChR antibodies: Strongly positive (15 nmol/L, normal <0.4). Repetitive nerve stimulation (RNS): >10% decrement at 3 Hz stimulation in facial and spinal accessory nerves. CT chest: Anterior mediastinal mass (thymoma, 4 cm). Edrophonium (Tensilon) test: Dramatic improvement in ptosis (if done). Spirometry: FVC 800 mL (28% predicted) - impending respiratory failure. ABG: pH 7.35, PaCO2 50 (rising). CBC, Metabolic panel: Normal. TSH: Normal (check for autoimmune thyroid).",
    "diagnosis": "Myasthenia gravis (AChR antibody-positive, generalized, Osserman Class IVb) with myasthenic crisis precipitated by infection and azithromycin, associated thymoma",
    "differentials": ["Myasthenia gravis", "Lambert-Eaton myasthenic syndrome", "Botulism", "Brainstem stroke", "Motor neuron disease (bulbar onset)", "Inflammatory myopathy"],
    "learning_points": [
      "Myasthenic crisis: Respiratory failure due to MG - FVC <1L or <15 mL/kg = ICU admission",
      "Drugs that worsen MG: Aminoglycosides, macrolides (azithromycin), fluoroquinolones, beta-blockers, magnesium",
      "Treatment of crisis: Plasma exchange (PLEX) or IVIg - NOT just increasing pyridostigmine",
      "Thymoma present in 10-15% of MG patients - thymectomy indicated",
      "Maintenance: Pyridostigmine + immunosuppression (prednisolone + azathioprine or MMF)",
      "Monitor FVC serially (every 4-6 hours in crisis) - intubate if FVC <15 mL/kg or declining rapidly"
    ],
    "india_context": "MG prevalence in India estimated at 10-20 per million. Often misdiagnosed as 'lazy eye' or depression initially. Anti-AChR antibody testing available at most tertiary centers. Thymectomy facilities available at major centers. Rituximab is emerging as a steroid-sparing option for refractory MG in Indian practice."
  },
  {
    "id": "NEURO-005",
    "title": "Viral Encephalitis - Herpes Simplex",
    "specialty": "neurology",
    "difficulty": "intermediate",
    "source": "Indian Academy of Neurology Guidelines",
    "demographics": {"age": 35, "gender": "Male", "location": "Hyderabad, Telangana"},
    "chief_complaint": "Fever, confusion, and abnormal behavior for 4 days",
    "presentation": "A 35-year-old software engineer presents with fever, progressive confusion, and bizarre behavior for 4 days. He has developed new-onset seizures (2 episodes of complex partial seizures with oral automatisms). His wife reports he has been increasingly irritable, has had visual hallucinations, and is unable to recognize family members (prosopagnosia). He had a 'cold sore' on his lip 10 days ago.",
    "vital_signs": {"bp": "130/80", "hr": 92, "rr": 18, "temp": 39.0, "spo2": 97},
    "history": "Fever for 5 days, initially low-grade then high-grade. Headache for 4 days. Progressive confusion and disorientation. Bizarre behavior: talking to imaginary people, removing clothes. Two seizures: staring episodes with lip-smacking (complex partial, temporal lobe). Unable to recognize wife and children (prosopagnosia). Olfactory hallucinations (smells burning rubber). Cold sore on lip 10 days ago. Previously healthy. No HIV risk. No travel. No animal exposure.",
    "physical_exam": "GCS 11/15 (E3V3M5). Febrile. Disoriented to time, place, person. Anosmia on the left. Left UMN facial weakness (subtle). Mild right hemiparesis. Deep tendon reflexes brisk on right. Right plantar extensor. No papilledema. Meningism mild. Healing cold sore on lower lip.",
    "investigations": "CSF: WBC 120 (lymphocytic 90%), RBCs 500 (hemorrhagic), Protein 1.2, Glucose 60 (blood 100, ratio normal). CSF HSV-1 PCR: Positive. CSF opening pressure 220. MRI brain: Bilateral (left > right) temporal lobe hyperintensities on T2/FLAIR with hemorrhagic areas, involving medial temporal lobes, insular cortex, and orbitofrontal cortex (classic distribution). CT (if done first): May be normal early or show temporal lobe hypodensity. EEG: Periodic lateralized epileptiform discharges (PLEDs) from left temporal region. CBC: WBC 10,000. CRP: 45.",
    "diagnosis": "Herpes simplex encephalitis (HSV-1) with temporal lobe involvement",
    "differentials": ["HSV encephalitis", "Autoimmune encephalitis (anti-NMDAR)", "Japanese encephalitis", "TB meningitis", "Brain abscess (temporal)", "Temporal lobe tumor"],
    "learning_points": [
      "HSV encephalitis has predilection for temporal lobes - behavioral changes, seizures, aphasia",
      "CSF may be hemorrhagic (RBCs present) - unique among viral encephalitides",
      "HSV PCR in CSF is diagnostic (sensitivity >95% after 3 days of illness)",
      "Start IV acyclovir (10 mg/kg q8h) EMPIRICALLY - do not wait for PCR results",
      "Treatment duration: 14-21 days of IV acyclovir",
      "Untreated mortality >70%, with treatment ~20%, but significant neuropsychiatric sequelae common"
    ],
    "india_context": "HSV encephalitis is the commonest sporadic viral encephalitis worldwide and in India. CSF HSV PCR testing is available at AIIMS, NIMHANS, and other tertiary centers. IV acyclovir is widely available and affordable. Delay in starting acyclovir is the major determinant of poor outcome."
  },
  {
    "id": "NEURO-006",
    "title": "Spinal Cord Compression - Pott's Spine",
    "specialty": "neurology",
    "difficulty": "intermediate",
    "source": "IJMR - Spinal Tuberculosis",
    "demographics": {"age": 35, "gender": "Male", "location": "Ranchi, Jharkhand"},
    "chief_complaint": "Back pain with progressive weakness in both legs for 2 months",
    "presentation": "A 35-year-old tribal farmer from Jharkhand presents with progressive thoracic back pain for 4 months and weakness in both legs for 2 months. He now has difficulty walking and has developed urinary retention. He has lost 8 kg weight and has evening fevers. He belongs to a community with high TB prevalence.",
    "vital_signs": {"bp": "110/70", "hr": 80, "rr": 18, "temp": 37.8, "spo2": 98},
    "history": "Thoracic back pain for 4 months - constant, aching, worse at night (red flag). Progressive weakness in both legs for 2 months - started with dragging of feet, now unable to walk without support. Band-like sensation around chest (T8 level). Urinary retention for 1 week (needs catheter). Constipation. Evening fever, night sweats, weight loss 8 kg. Tribal community with high TB prevalence. No prior TB treatment. No trauma.",
    "physical_exam": "Gibbus deformity at T8-T9 (kyphotic angulation). Tenderness at T8-T9 spinous processes. Paraparesis: Power 2/5 both lower limbs. Spasticity. Brisk knee and ankle jerks. Bilateral ankle clonus. Bilateral extensor plantars. Sensory level at T8 (loss of sensation below umbilicus). Bladder distended (urinary retention - upper motor neuron bladder). No upper limb involvement.",
    "investigations": "MRI spine (whole): T8-T9 vertebral body destruction with paradiscal pattern, large anterior epidural abscess compressing spinal cord (cord compression with myelopathy signal), gibbus deformity, preservation of disc space relatively (unlike pyogenic). CT-guided biopsy of abscess: GeneXpert MTB positive, Rif sensitive. Histopathology: Caseating granulomas with Langhans giant cells. CXR: No pulmonary TB. CBC: Hb 10, ESR 68. Mantoux: 22 mm. HIV: Negative.",
    "diagnosis": "Spinal tuberculosis (Pott's spine) at T8-T9 with epidural abscess and spinal cord compression causing paraplegia",
    "differentials": ["Spinal TB (Pott's spine)", "Pyogenic spondylodiscitis", "Spinal metastasis", "Multiple myeloma", "Spinal epidural abscess (non-TB)", "Transverse myelitis"],
    "learning_points": [
      "Spinal TB (Pott's spine) is the commonest form of skeletal TB (50% of bone/joint TB)",
      "Thoracolumbar junction is the most common site",
      "Paradiscal pattern with relative disc preservation differentiates from pyogenic (disc destroyed early)",
      "Red flags for spinal cord compression: Night pain, progressive weakness, bladder dysfunction, sensory level",
      "Treatment: ATT for 12-18 months + spinal immobilization ± surgical decompression if cord compression",
      "Indications for surgery: Progressive neurological deficit, large abscess, spinal instability, failure of medical treatment"
    ],
    "india_context": "Spinal TB accounts for ~1-3% of all TB in India. Tribal populations in Jharkhand, Chhattisgarh have high TB prevalence. NTEP provides free ATT. Delay in diagnosis (average 4-6 months) leads to irreversible cord damage. MRI availability at district level is improving under NHM."
  },
  {
    "id": "NEURO-007",
    "title": "Organophosphate Poisoning with Cholinergic Crisis",
    "specialty": "neurology",
    "difficulty": "intermediate",
    "source": "JAPI - Pesticide Poisoning India",
    "demographics": {"age": 25, "gender": "Male", "location": "Guntur, Andhra Pradesh"},
    "chief_complaint": "Found unconscious with frothing from mouth in a cotton field",
    "presentation": "A 25-year-old cotton farmer from Guntur district is brought to the ER after being found unconscious in his field with excessive salivation, frothing from mouth, and a strong garlic-like odor. An empty bottle of chlorpyrifos (organophosphate insecticide) is found nearby. His family reports he had been depressed due to crop failure and debt.",
    "vital_signs": {"bp": "90/60", "hr": 45, "rr": 12, "temp": 36.5, "spo2": 78},
    "history": "Found by fellow workers 1 hour ago, unconscious in cotton field. Empty OP pesticide bottle nearby. Known to have been spraying pesticides earlier today without protective equipment. Family reports: depressed due to crop failure, mounting debts, wife recently left. Intent unclear (accidental or intentional). No suicide note. Young children at home. Previously healthy. No prior psychiatric history.",
    "physical_exam": "GCS 5/15 (E1V1M3). Profuse salivation, lacrimation, urination, defecation (SLUDGE syndrome). Bronchorrhea (copious secretions from airway). Miotic pupils (pinpoint, bilateral). Bradycardia. Hypotension. Fasciculations visible in all muscle groups. Diaphoretic. Garlic-like odor on breath/clothes. Wheezing (bronchospasm). Absent deep tendon reflexes.",
    "investigations": "Serum cholinesterase (pseudocholinesterase): 180 U/L (normal 5000-12000) - severely depressed (96% inhibition). RBC acetylcholinesterase: Not immediately available. ABG: Respiratory acidosis, hypoxemia. ECG: Sinus bradycardia, prolonged QTc. Pupils: Bilaterally miotic (2mm). Blood glucose: Normal. Renal: Normal initially. Toxicology screen: Organophosphate positive.",
    "diagnosis": "Acute organophosphate poisoning (chlorpyrifos) with cholinergic crisis - possible suicidal intent",
    "differentials": ["Organophosphate poisoning", "Carbamate poisoning", "Mushroom poisoning (muscarinic)", "Opioid overdose", "Brainstem stroke", "Myasthenic crisis"],
    "learning_points": [
      "SLUDGE/DUMBELS mnemonic for cholinergic excess: Salivation, Lacrimation, Urination, Defecation, GI distress, Emesis, Bronchospasm/Bradycardia",
      "Treatment: Atropine (0.6-2mg IV, double every 5 min until secretions dry) + Pralidoxime (PAM, 1-2g IV over 30 min)",
      "Atropine endpoint: Dry secretions (NOT pupil size or heart rate)",
      "Pralidoxime must be given within 24-48 hours (before 'aging' of OP-AChE complex)",
      "Watch for Intermediate Syndrome (IMS): Day 1-4, proximal muscle weakness, respiratory failure",
      "Organophosphate-induced delayed neuropathy (OPIDN): 2-4 weeks later, distal sensorimotor neuropathy"
    ],
    "india_context": "India accounts for 1/3 of global pesticide suicides (~50,000/year). AP, Maharashtra, Karnataka are hotspots. Farmer distress (crop failure, debt) drives agricultural suicides. WHO has recommended banning HHPs (highly hazardous pesticides). India banned 12 pesticides in 2020. Atropine and PAM are available at PHC/CHC level under NHM. Psychiatric evaluation and crisis intervention mandatory for all pesticide poisoning cases."
  },
  {
    "id": "NEURO-008",
    "title": "Multiple Sclerosis - Optic Neuritis Presentation",
    "specialty": "neurology",
    "difficulty": "advanced",
    "source": "Annals of Indian Academy of Neurology",
    "demographics": {"age": 27, "gender": "Female", "location": "Bengaluru, Karnataka"},
    "chief_complaint": "Painful loss of vision in right eye for 3 days",
    "presentation": "A 27-year-old software engineer from Bengaluru presents with subacute painful loss of vision in the right eye for 3 days. She describes pain behind the eye that worsens with eye movements. She had an episode of numbness and tingling in both legs 8 months ago that resolved spontaneously over 3 weeks (likely transverse myelitis - not investigated). She also noticed her vision worsens when she takes a hot shower (Uhthoff phenomenon).",
    "vital_signs": {"bp": "110/70", "hr": 72, "rr": 16, "temp": 37.0, "spo2": 99},
    "history": "Right eye: Blurred vision progressing over 3 days, now can only count fingers at 1 meter. Pain behind right eye, worse with eye movements. Colors appear 'washed out' in right eye (color desaturation). Vision worse after hot shower (Uhthoff phenomenon). 8 months ago: Numbness and tingling in both legs up to waist for 3 weeks (spontaneously resolved - ?transverse myelitis). 1 year ago: 2-week episode of vertigo and imbalance (resolved). No headache. No fever.",
    "physical_exam": "Visual acuity: Right eye 6/60 (reduced), Left eye 6/6 (normal). RAPD (relative afferent pupillary defect) positive right eye. Color vision: Right eye cannot read Ishihara plates (dyschromatopsia). Visual fields: Central scotoma right eye. Fundoscopy: Right optic disc slightly edematous. Left eye normal. Neurological: Mild spasticity both lower limbs. Brisk knee jerks. Right plantar extensor. Lhermitte sign positive (electric sensation down spine on neck flexion). Cerebellar: Mild intention tremor left hand.",
    "investigations": "MRI brain with gadolinium: Multiple periventricular white matter lesions (perpendicular to ventricles - Dawson fingers), juxtacortical lesions, 2 enhancing lesions (active). MRI orbit: Right optic nerve enhancement and swelling. MRI spine: 2 demyelinating lesions in cervical cord. CSF: Oligoclonal bands positive (present in CSF, absent in serum), IgG index elevated, mild lymphocytic pleocytosis (8 cells). VEP (visual evoked potential): Prolonged P100 latency right eye. Anti-AQP4 and anti-MOG antibodies: Negative.",
    "diagnosis": "Relapsing-remitting multiple sclerosis (RRMS) presenting with optic neuritis - fulfills 2017 McDonald criteria (dissemination in space and time)",
    "differentials": ["Multiple sclerosis", "Neuromyelitis optica (NMOSD)", "MOG antibody disease", "Sarcoidosis", "SLE with CNS involvement", "Acute disseminated encephalomyelitis (ADEM)"],
    "learning_points": [
      "McDonald criteria (2017): Dissemination in space (≥2 of: periventricular, cortical/juxtacortical, infratentorial, spinal) + time (enhancing + non-enhancing lesions or new lesion on follow-up)",
      "RAPD (Marcus Gunn pupil) is the hallmark of optic neuritis",
      "Uhthoff phenomenon: Worsening with heat (demyelinated fibers are heat-sensitive)",
      "Lhermitte sign: Electric sensation down spine on neck flexion (cervical cord demyelination)",
      "Acute treatment: IV methylprednisolone 1g/day x 3-5 days",
      "Disease-modifying therapy: Start early - interferon-beta, glatiramer, dimethyl fumarate, fingolimod, natalizumab, ocrelizumab"
    ],
    "india_context": "MS prevalence in India estimated 7-10 per 100,000 (lower than West but increasing recognition). NMOSD is relatively more common in India compared to Western countries. Anti-AQP4 testing is important as treatment differs significantly. DMTs are increasingly available through insurance coverage and patient assistance programs. NIMHANS and AIIMS are reference centers for MS care."
  }
]
