[
  {
    "id": "OBG-001",
    "title": "Eclampsia — Seizures in Pre-eclampsia",
    "specialty": "obstetrics",
    "difficulty": "advanced",
    "source": "FOGSI Guidelines - Hypertensive Disorders of Pregnancy",
    "demographics": {"age": 22, "gender": "Female", "location": "Varanasi, UP"},
    "chief_complaint": "Seizures during 34 weeks of pregnancy",
    "presentation": "A 22-year-old primigravida at 34 weeks gestation is brought to emergency after two generalized tonic-clonic seizures at home. She had headache, visual blurring, and epigastric pain since morning. Her BP is 180/120. She has no prior history of epilepsy. She had irregular antenatal visits at a PHC and her last BP recording 2 weeks ago was 150/100 with 2+ proteinuria.",
    "vital_signs": {"bp": "180/120", "hr": 110, "rr": 22, "temp": 37.2, "spo2": 94},
    "history": "Primigravida, 34 weeks by dates. Irregular ANC — 3 visits total. BP 2 weeks ago: 150/100, proteinuria 2+ (pre-eclampsia diagnosed but not treated). Headache and visual blurring since morning. Epigastric pain (liver capsule distension). Two GTCS at home, witnessed by husband. No prior epilepsy. No fever. Fetal movements felt earlier today.",
    "physical_exam": "Post-ictal, GCS 12. BP 180/120. Facial edema, bilateral pedal edema 3+. Uterus: 34 weeks, cephalic presentation. FHR: 110 (fetal bradycardia — concerning). Hyperreflexia (brisk patellar reflexes with clonus). No papilledema. Tongue bite present.",
    "investigations": "Urine: Protein 3+. Platelet count: 85,000 (low — HELLP developing). AST: 250, ALT: 280 (elevated). LDH: 900 (elevated). Bilirubin: 2.5. Peripheral smear: Schistocytes (microangiopathic hemolysis). Creatinine: 1.5. Uric acid: 8.5. Fibrinogen: 180. PT/INR: Normal. CTG: Recurrent late decelerations (fetal distress). USG: Single live fetus, IUGR, oligohydramnios.",
    "diagnosis": "Eclampsia with developing HELLP syndrome at 34 weeks gestation",
    "differentials": ["Eclampsia", "Epilepsy in pregnancy", "Cerebral venous thrombosis", "Thrombotic thrombocytopenic purpura", "Posterior reversible encephalopathy syndrome (PRES)", "Cerebral malaria"],
    "learning_points": [
      "Eclampsia = pre-eclampsia + seizures (can occur antepartum, intrapartum, or postpartum up to 6 weeks)",
      "Magnesium sulfate is THE drug of choice (Pritchard or Zuspan regimen) — NOT phenytoin or diazepam",
      "Pritchard regimen (IM): 4g IV loading + 5g IM each buttock, then 5g IM q4h for 24 hours post-delivery",
      "MgSO4 toxicity monitoring: Knee reflex (lost at 10 mEq/L), RR (<16), urine output (<25 mL/hr). Antidote: Calcium gluconate",
      "HELLP = Hemolysis + Elevated Liver enzymes + Low Platelets — delivery is the only cure",
      "Definitive treatment: Delivery (regardless of gestational age if eclampsia occurs)"
    ],
    "india_context": "Eclampsia is a leading cause of maternal mortality in India (contributing to 8-10% of maternal deaths). UP, Bihar, Rajasthan have highest burden. Many women have inadequate ANC — pre-eclampsia is not detected early. MgSO4 is available at CHCs/PHCs under government supply. FOGSI recommends MgSO4 at all delivery points."
  },
  {
    "id": "OBG-002",
    "title": "Ruptured Ectopic Pregnancy",
    "specialty": "obstetrics",
    "difficulty": "intermediate",
    "source": "FOGSI - Ectopic Pregnancy Guidelines",
    "demographics": {"age": 28, "gender": "Female", "location": "Bhopal, MP"},
    "chief_complaint": "Sudden severe lower abdominal pain with fainting",
    "presentation": "A 28-year-old woman (G2P1) with 7 weeks amenorrhea presents with sudden onset severe right lower abdominal pain radiating to the shoulder tip, with fainting episode at home. She has vaginal spotting but no heavy bleeding. She has a history of PID treated 2 years ago. UPT is positive. She is tachycardic and hypotensive with signs of peritonism.",
    "vital_signs": {"bp": "80/50", "hr": 130, "rr": 24, "temp": 37.0, "spo2": 96},
    "history": "LMP 7 weeks ago. Mild vaginal spotting for 1 week. Today: Sudden severe right iliac fossa pain, sharp, radiating to right shoulder (diaphragmatic irritation from hemoperitoneum). Fainting episode. Nausea. Previous: One normal delivery 3 years ago. History of PID (chlamydia) treated 2 years ago. Using no contraception. No IUCD.",
    "physical_exam": "Pale, cold, clammy (hypovolemic shock). Tachycardic 130, hypotensive 80/50. Abdomen: Guarding, rigidity, rebound tenderness (peritonism). Right iliac fossa tenderness maximal. Shifting dullness positive (hemoperitoneum). PV exam: Cervical excitation tenderness (positive), fullness in pouch of Douglas, uterus slightly bulky but empty. Vaginal spotting.",
    "investigations": "UPT: Positive. Serum beta-hCG: 5,500 mIU/mL. TVS: Empty uterus (no intrauterine sac), Right adnexal mass 4cm with ring of fire sign (ectopic), significant free fluid in pouch of Douglas and Morrison's pouch (hemoperitoneum). Hb: 7.5 g/dL (acute drop). Blood group and crossmatch: Urgent. Culdocentesis: Non-clotting blood aspirated (hemoperitoneum confirmed).",
    "diagnosis": "Ruptured right tubal ectopic pregnancy with hemoperitoneum and hemorrhagic shock",
    "differentials": ["Ruptured ectopic pregnancy", "Ruptured corpus luteum cyst", "Miscarriage (threatened/incomplete)", "Ovarian torsion", "Acute appendicitis", "Ruptured tubo-ovarian abscess"],
    "learning_points": [
      "Risk factors for ectopic: Previous PID (most important), previous ectopic, tubal surgery, IUCD, ART, smoking",
      "Shoulder tip pain (Kehr sign) = diaphragmatic irritation from hemoperitoneum — classic ectopic clue",
      "Ruptured ectopic = surgical emergency — salpingectomy (not salpingostomy for ruptured cases)",
      "Medical management (methotrexate): Only for UNRUPTURED, hemodynamically stable, hCG <5000, no FHR",
      "Beta-hCG discriminatory zone: If >1500-2000 and no intrauterine sac on TVS → strongly suspect ectopic",
      "Anti-D immunoglobulin if mother is Rh negative"
    ],
    "india_context": "Ectopic pregnancy accounts for 3.5-7.1% of maternal mortality in India. Late presentation due to poor access is common. Many cases present as ruptured due to delayed diagnosis. Untreated PID/STIs are a major risk factor in India. Blood bank availability for emergency transfusion is crucial."
  },
  {
    "id": "OBG-003",
    "title": "Placenta Previa with Antepartum Hemorrhage",
    "specialty": "obstetrics",
    "difficulty": "intermediate",
    "source": "FOGSI - APH Management",
    "demographics": {"age": 32, "gender": "Female", "location": "Indore, MP"},
    "chief_complaint": "Painless bright red vaginal bleeding at 32 weeks",
    "presentation": "A 32-year-old G3P2 (previous 2 cesarean sections) at 32 weeks gestation presents with sudden painless bright red vaginal bleeding soaking through clothes. She had a similar smaller bleed at 28 weeks which settled with bed rest. USG at 20 weeks had shown a low-lying placenta. She is currently hemodynamically stable.",
    "vital_signs": {"bp": "110/70", "hr": 95, "rr": 18, "temp": 37.0, "spo2": 98},
    "history": "G3P2, both previous deliveries by cesarean section (2 previous uterine scars). Current: 32 weeks by dates. First episode of spotting at 28 weeks, settled with bed rest. Today: Sudden gush of bright red blood, painless, soaked clothes. Estimated blood loss ~500 mL. No abdominal pain (key — placenta previa is painless). No contractions. No history of trauma. 20-week anomaly scan: Low-lying placenta covering internal os.",
    "physical_exam": "Moderate pallor. Hemodynamically stable (currently). Abdomen: Relaxed, soft, non-tender (NO uterine tenderness — distinguishes from abruption). Uterus corresponds to 32 weeks. Malpresentation: Breech (common with previa). FHR: 140 (reassuring). Vulva: Active bright red bleeding. DO NOT do vaginal examination (can provoke catastrophic hemorrhage in placenta previa).",
    "investigations": "USG: Complete placenta previa (Type IV — centrally covers internal os). Placenta anterior (on scar — risk of placenta accreta). MRI pelvis: Possible placenta accreta (loss of clear zone between placenta and myometrium). Hb: 8.5. Blood group: B positive. Crossmatch: 4 units packed RBCs arranged. Coagulation: Normal. CTG: Reassuring fetal heart pattern. Growth: Appropriate for gestational age.",
    "diagnosis": "Major placenta previa (Type IV) with antepartum hemorrhage at 32 weeks, possible placenta accreta (previous 2 LSCS)",
    "differentials": ["Placenta previa", "Abruptio placentae", "Vasa previa", "Local cervical causes (polyp, cancer)", "Heavy show (early labor)", "Uterine rupture"],
    "learning_points": [
      "Placenta previa: PAINLESS bright red bleeding vs Abruption: PAINFUL dark bleeding with tender uterus",
      "NEVER do PV exam in suspected previa (double setup exam in OT only if previa needs to be ruled out)",
      "Risk factors: Previous cesarean (most important), multiparity, previous previa, ART pregnancies",
      "Previous LSCS + anterior previa = HIGH risk of placenta accreta spectrum (PAS) — plan for cesarean hysterectomy",
      "Steroids for fetal lung maturity (betamethasone 12mg IM x2, 24 hours apart) if <34 weeks",
      "Delivery: Cesarean section at 36-37 weeks if stable, earlier if recurrent/massive hemorrhage"
    ],
    "india_context": "Rising cesarean rates in India (now ~20% nationally, 40-50% in private hospitals) have increased placenta previa and accreta rates. Many women have 3-4 previous cesareans due to repeat LSCS policy. Blood bank availability is critical. FOGSI recommends referral to higher centers with blood bank and surgical expertise for suspected PAS."
  },
  {
    "id": "OBG-004",
    "title": "Complete Hydatidiform Mole",
    "specialty": "obstetrics",
    "difficulty": "intermediate",
    "source": "ICMR - Gestational Trophoblastic Disease",
    "demographics": {"age": 19, "gender": "Female", "location": "Patna, Bihar"},
    "chief_complaint": "Excessive vomiting and vaginal bleeding in early pregnancy with uterus larger than dates",
    "presentation": "A 19-year-old primigravida at presumed 12 weeks gestation presents with severe nausea/vomiting (hyperemesis), intermittent vaginal bleeding with passage of grape-like vesicles, and lower abdominal pain. Her uterus is 18 weeks size (larger than dates). Beta-hCG is markedly elevated. USG shows 'snowstorm' pattern with no fetus.",
    "vital_signs": {"bp": "150/100", "hr": 110, "rr": 20, "temp": 37.0, "spo2": 98},
    "history": "LMP 12 weeks ago. Severe nausea and vomiting since week 6 (hyperemesis — exaggerated pregnancy symptoms). Vaginal bleeding for 2 weeks — brownish initially, then fresh red with passage of small grape-like vesicles (pathognomonic). Lower abdominal cramping. UPT strongly positive (rapid and dark). No prior pregnancies. Married at 17. Low dietary folate intake.",
    "physical_exam": "Pallor (anemia from bleeding). BP 150/100 (pre-eclampsia at 12 weeks — very early, should raise suspicion). Tremor, tachycardia (thyrotoxicosis from hCG crossreacting with TSH receptor). Abdomen: Uterus palpable at 18 weeks (larger than dates). Bilateral adnexal cystic masses palpable (theca lutein cysts). PV: Os open, grape-like vesicles visible. No fetal parts palpable. No FHR detected.",
    "investigations": "Beta-hCG: 450,000 mIU/mL (markedly elevated — >100,000 suggests molar pregnancy). USG: 'Snowstorm' pattern — multiple small cystic spaces (vesicles) filling the uterine cavity, no fetus, no fetal parts (complete mole). Bilateral theca lutein cysts 8cm. CXR: Normal (no lung metastases). TSH: 0.01 (suppressed by hCG), Free T4: 4.0 (elevated — gestational thyrotoxicosis). CBC: Hb 8.5. T&S: B+. Coagulation: Normal.",
    "diagnosis": "Complete hydatidiform mole (gestational trophoblastic disease) with pre-eclampsia and thyrotoxicosis",
    "differentials": ["Complete hydatidiform mole", "Partial hydatidiform mole", "Missed miscarriage with hydropic degeneration", "Twin pregnancy with one molar", "Threatened miscarriage", "Choriocarcinoma"],
    "learning_points": [
      "Complete mole: 46XX (all paternal), no fetus, snowstorm USG, very high hCG, higher malignancy risk",
      "Partial mole: 69XXY (triploid), fetus may be present, less elevated hCG, lower malignancy risk",
      "Pre-eclampsia before 20 weeks = think molar pregnancy (pre-eclampsia normally after 20 weeks only)",
      "Treatment: Suction evacuation (not medical evacuation — risk of embolization)",
      "Post-evacuation: Weekly hCG monitoring until normal for 3 consecutive weeks, then monthly for 6-12 months",
      "Contraception mandatory during surveillance (pregnancy confounds hCG monitoring) — OCP preferred"
    ],
    "india_context": "GTD incidence in India is 1-2 per 1000 pregnancies (higher than Western countries). Higher rates in younger women (<20) and extremes of age. Nutritional deficiency (folate, beta-carotene) may contribute. Follow-up compliance for serial hCG monitoring is a major challenge in rural India. FOGSI recommends registration and tracking of all molar pregnancies."
  },
  {
    "id": "OBG-005",
    "title": "Polycystic Ovary Syndrome with Infertility",
    "specialty": "obstetrics",
    "difficulty": "intermediate",
    "source": "FOGSI-ICOG Guidelines - PCOS Management",
    "demographics": {"age": 26, "gender": "Female", "location": "Pune, Maharashtra"},
    "chief_complaint": "Irregular periods, difficulty conceiving, and weight gain",
    "presentation": "A 26-year-old married woman presents with irregular periods (cycles every 45-90 days) since menarche, inability to conceive after 2 years of marriage, progressive weight gain (20 kg over 5 years), acne, and facial hair. She has a BMI of 32 and features of hyperandrogenism. She also has acanthosis nigricans suggesting insulin resistance.",
    "vital_signs": {"bp": "130/85", "hr": 78, "rr": 16, "temp": 37.0, "spo2": 99},
    "history": "Menarche at 13. Always had irregular periods (oligomenorrhea — cycles 45-90 days). Married 2 years, no contraception, unprotected intercourse, unable to conceive (primary infertility). Progressive weight gain (BMI 32). Acne since teens, worsening. Facial hair (chin, upper lip) increasing. No galactorrhea. No symptoms of thyroid dysfunction. No medications. Family history: Mother has T2DM, sister has PCOS.",
    "physical_exam": "BMI 32 (obese). Acne on face and back. Hirsutism: Ferriman-Gallwey score 14 (moderate). Acanthosis nigricans at neck and axillae (insulin resistance). No virilization (no clitoromegaly, voice deepening). No galactorrhea. Thyroid: Normal. Abdomen: Obese, no masses. PV: Normal-sized uterus, bilateral bulky ovaries.",
    "investigations": "USG pelvis: Bilateral enlarged ovaries with >12 follicles (2-9mm each) in each ovary, arranged peripherally ('necklace' sign). Endometrial thickness: 14mm (thickened — anovulatory). LH: 15 mIU/mL, FSH: 5 mIU/mL (LH:FSH ratio >2). Total testosterone: 85 ng/dL (elevated). DHEAS: Normal. 17-OHP: Normal (rules out NCCAH). TSH: 3.5 (normal). Prolactin: 18 (normal). Fasting glucose: 110, Fasting insulin: 25 (HOMA-IR elevated — insulin resistance). HbA1c: 5.9% (prediabetes). Lipids: TG 200, HDL 38 (dyslipidemia).",
    "diagnosis": "Polycystic ovary syndrome (PCOS — Rotterdam criteria met) with anovulatory infertility and metabolic syndrome",
    "differentials": ["PCOS", "Non-classical congenital adrenal hyperplasia (NCCAH)", "Hypothyroidism", "Hyperprolactinemia", "Cushing syndrome", "Androgen-secreting tumor (ovarian/adrenal)"],
    "learning_points": [
      "Rotterdam criteria (2 of 3): Oligo/anovulation + Clinical/biochemical hyperandrogenism + Polycystic ovaries on USG",
      "PCOS is a diagnosis of EXCLUSION — must rule out thyroid, prolactin, NCCAH, Cushing first",
      "Metabolic syndrome: Screen all PCOS women for insulin resistance, prediabetes, dyslipidemia, and NAFLD",
      "Infertility treatment: Lifestyle modification first (5-10% weight loss restores ovulation in 50-60%)",
      "Ovulation induction: Letrozole (first-line, better than clomiphene per NICHD trial) → clomiphene → gonadotropins → IVF",
      "Long-term risks: T2DM, CVD, endometrial cancer (from chronic anovulation) — needs lifelong monitoring"
    ],
    "india_context": "PCOS affects 5-15% of Indian women of reproductive age. Indian women have more metabolic features (insulin resistance, T2DM) compared to Western PCOS. ICMR-INDIAB study shows Indian PCOS women have 3-5x higher T2DM risk. FOGSI-ICOG recommends lifestyle modification as first-line. Letrozole has replaced clomiphene as first-line for ovulation induction."
  },
  {
    "id": "OBG-006",
    "title": "Postpartum Hemorrhage — Uterine Atony",
    "specialty": "obstetrics",
    "difficulty": "intermediate",
    "source": "FOGSI - PPH Management Protocol",
    "demographics": {"age": 30, "gender": "Female", "location": "Jaipur, Rajasthan"},
    "chief_complaint": "Massive vaginal bleeding after delivery",
    "presentation": "A 30-year-old G4P3 delivers a 4.2 kg baby after prolonged labor (18 hours) augmented with oxytocin. Immediately after delivery of the placenta, she develops massive vaginal bleeding (~1500 mL in 30 minutes). The uterus is felt boggy and poorly contracted on abdominal palpation. Active management of third stage was not done.",
    "vital_signs": {"bp": "80/50", "hr": 130, "rr": 26, "temp": 37.0, "spo2": 92},
    "history": "G4P3, all previous normal deliveries. Current: Term pregnancy, prolonged labor 18 hours, augmented with oxytocin. Baby: 4.2 kg (macrosomia). Placenta delivered complete (no retained products). Immediately after placental delivery: Torrential bright red bleeding. Active management of third stage (AMTSL) NOT performed. Risk factors: Grand multiparity, macrosomic baby, prolonged labor, oxytocin augmentation.",
    "physical_exam": "Hemorrhagic shock: Pale, cold, diaphoretic, tachycardic, hypotensive. Abdomen: Uterus palpable above umbilicus, soft, boggy, poorly contracted (ATONIC). Blood pooling on bed. Perineum: No obvious tears (but need to examine). Placenta: Complete on inspection (membranes and cotyledons).",
    "investigations": "Clinical diagnosis — no time for investigations before treatment. Estimated blood loss: 1500 mL (Class III hemorrhage). Hb: 6.5 (post-hemorrhage). Coagulation: PT 16, APTT 45, Fibrinogen 150 (developing coagulopathy). Platelet: 90,000. Blood group: O positive. Crossmatch: 4 units PRBCs. Bedside clot test: Soft clot (concerning).",
    "diagnosis": "Primary postpartum hemorrhage due to uterine atony (Tone — the most common cause of PPH)",
    "differentials": ["Uterine atony (Tone — 70% of PPH)", "Genital tract trauma (Trauma — tears/lacerations)", "Retained placental tissue (Tissue)", "Coagulation disorders (Thrombin)", "Uterine inversion", "Uterine rupture"],
    "learning_points": [
      "PPH = Blood loss >500 mL (vaginal) or >1000 mL (cesarean). Primary = within 24 hours",
      "4 Ts of PPH: Tone (atony — 70%), Trauma (tears), Tissue (retained), Thrombin (coagulopathy)",
      "AMTSL prevents PPH: Oxytocin 10 IU IM after delivery of anterior shoulder + controlled cord traction + uterine massage",
      "Atony management stepwise: Uterine massage → Oxytocin infusion → Ergometrine → Carboprost (PGF2α) → Misoprostol 800μg sublingual",
      "If medical fails: Uterine tamponade (Bakri balloon / condom catheter — Sayeba method), then B-Lynch suture, uterine artery ligation, and finally hysterectomy",
      "Condom catheter tamponade (developed in India) is a low-cost life-saving innovation for resource-limited settings"
    ],
    "india_context": "PPH is the leading cause of maternal death in India (38% of maternal deaths). Most deaths are preventable with AMTSL. The condom catheter tamponade (Sayeba method) was developed in Bangladesh/India — affordable alternative to Bakri balloon. Misoprostol 600 μg oral at community level is recommended by GoI for prevention where oxytocin is unavailable."
  },
  {
    "id": "OBG-007",
    "title": "Cervical Cancer — Early Detection",
    "specialty": "obstetrics",
    "difficulty": "intermediate",
    "source": "ICMR - Cervical Cancer Screening Guidelines",
    "demographics": {"age": 45, "gender": "Female", "location": "Thiruvananthapuram, Kerala"},
    "chief_complaint": "Postcoital bleeding and foul-smelling vaginal discharge",
    "presentation": "A 45-year-old multiparous woman presents with intermittent postcoital bleeding for 6 months, foul-smelling watery vaginal discharge, and intermenstrual spotting. She has never had a Pap smear or cervical cancer screening. She was married at age 16 and has 4 children. On speculum examination, a growth is visible on the cervix.",
    "vital_signs": {"bp": "120/80", "hr": 78, "rr": 16, "temp": 37.0, "spo2": 99},
    "history": "Postcoital bleeding for 6 months. Foul-smelling watery vaginal discharge for 4 months. Intermenstrual spotting. No postmenopausal bleeding (still premenopausal). Married at 16 (early marriage). First childbirth at 17. Para 4. Never screened for cervical cancer (no Pap smear, no VIA). No HPV vaccination. Husband is a chronic smoker. Low socioeconomic status.",
    "physical_exam": "General: Mild pallor. Per speculum: Cervix — irregular, friable, proliferative growth (cauliflower-like) of ~3 cm on the ectocervix, bleeds on touch. Vaginal fornices: Left fornix thickened (? parametrial involvement). PV: Cervical growth palpable, left parametrium thickened and shortened (not reaching pelvic sidewall). PR: Left parametrial thickening confirmed, rectal mucosa free.",
    "investigations": "Cervical biopsy: Squamous cell carcinoma (most common type — 85%). HPV typing: HPV 16 positive. Pap smear (done alongside): HSIL/Carcinoma. Hb: 9.0. Renal function: Normal (no ureteric obstruction). MRI pelvis: 3.5 cm cervical mass, left parametrial invasion not reaching sidewall, no lymphadenopathy — FIGO Stage IIB. CT chest/abdomen: No distant metastases. Cystoscopy/Proctoscopy: Normal.",
    "diagnosis": "Carcinoma cervix FIGO Stage IIB (squamous cell carcinoma, HPV 16 related) with parametrial involvement",
    "differentials": ["Cervical carcinoma (squamous cell or adenocarcinoma)", "Cervical polyp", "Cervical ectropion", "Cervicitis (chronic)", "Cervical TB", "Endometrial carcinoma prolapsing through cervix"],
    "learning_points": [
      "Cervical cancer is caused by persistent HPV infection (16 & 18 cause 70% of cases)",
      "Screening methods: Pap smear (cytology), HPV DNA testing (most sensitive), VIA (visual inspection with acetic acid — low-resource settings)",
      "FIGO staging is CLINICAL (not surgical) — examination under anesthesia if needed",
      "Stage IB/IIA: Surgery (radical hysterectomy/Wertheim) OR chemoradiation. Stage IIB+: Chemoradiation (cisplatin weekly)",
      "HPV vaccination: Quadrivalent (6,11,16,18) or nonavalent; India's indigenous vaccine Cervavac (qHPV) — ideal age 9-14 years",
      "VIA screening by ASHA workers is India's strategy for population-level cervical cancer screening"
    ],
    "india_context": "India accounts for 25% of global cervical cancer burden (1.2 lakh new cases/year, 67,000 deaths). Most women never get screened. Government has launched cervical cancer screening under NCD program (VIA by ANMs). India's indigenous HPV vaccine 'Cervavac' approved in 2022 — making vaccination affordable. GoI aims to integrate HPV vaccination into UIP."
  },
  {
    "id": "OBG-008",
    "title": "Ovarian Torsion — Acute Abdomen",
    "specialty": "obstetrics",
    "difficulty": "intermediate",
    "source": "FOGSI - Gynecological Emergencies",
    "demographics": {"age": 20, "gender": "Female", "location": "Kolkata, West Bengal"},
    "chief_complaint": "Sudden severe right-sided lower abdominal pain with vomiting",
    "presentation": "A 20-year-old unmarried college student presents with sudden onset severe right-sided lower abdominal pain radiating to the right flank, associated with nausea and multiple episodes of vomiting. The pain started 6 hours ago and is colicky, becoming constant. She had an incidental finding of a right ovarian cyst (6cm dermoid) on USG done for irregular periods 3 months ago, for which she was being observed.",
    "vital_signs": {"bp": "120/80", "hr": 100, "rr": 20, "temp": 37.5, "spo2": 98},
    "history": "Sudden severe right iliac fossa pain 6 hours ago, initially colicky then constant. Nausea and vomiting (4 episodes). Known right ovarian dermoid cyst 6cm (diagnosed 3 months ago). Irregular periods (cycles 28-35 days). LMP: 2 weeks ago (midcycle). No vaginal bleeding. No dysuria. No diarrhea. Pain worsened with change in position. Previously: Was advised elective cystectomy but delayed.",
    "physical_exam": "Distressed, writhing with pain. Tenderness: Right iliac fossa, guarding present. Rebound tenderness present. No rigidity (unlike peritonitis). Bowel sounds: Present. PV (if permitted — unmarried): Right adnexal mass tender, cervical excitation tenderness. Per abdomen: Vague right adnexal mass palpable, exquisitely tender.",
    "investigations": "UPT: Negative (rule out ectopic). USG pelvis: Right ovarian mass 7cm (dermoid — fat-fluid level, calcification) with absent/markedly reduced Doppler flow (torsion). Left ovary: Normal. Free fluid: Minimal. WBC: 12,000. CRP: 25. LDH: Elevated. Tumor markers: AFP, CA-125, beta-hCG: Normal (supports benign dermoid).",
    "diagnosis": "Right ovarian torsion secondary to ovarian dermoid cyst (mature cystic teratoma)",
    "differentials": ["Ovarian torsion", "Ruptured ovarian cyst", "Acute appendicitis", "Ectopic pregnancy", "Renal colic (right ureteric calculus)", "Pelvic inflammatory disease"],
    "learning_points": [
      "Ovarian torsion is a gynecological emergency — delays cause ovarian necrosis and loss",
      "Dermoid cysts (mature teratomas) are the most common benign ovarian tumors causing torsion (long pedicle)",
      "USG with Doppler: Absent/reduced flow is suggestive but NORMAL flow does NOT rule out torsion (dual blood supply)",
      "Treatment: Emergency laparoscopy → De-torsion + cystectomy (ovary-sparing preferred, especially in young women)",
      "Do NOT remove the ovary unless clearly necrotic (even dusky ovaries recover after de-torsion)",
      "Right side is more common (70%) — long utero-ovarian ligament on right"
    ],
    "india_context": "Ovarian torsion is often misdiagnosed as appendicitis in India, leading to delayed intervention. In unmarried women, PV examination may be deferred (cultural sensitivity) — USG is key. Laparoscopy is available at most district hospitals. Conservative surgery (ovary-sparing) should be the standard — removal of functional ovary has fertility implications."
  },
  {
    "id": "OBG-009",
    "title": "Abruptio Placentae — Concealed Hemorrhage",
    "specialty": "obstetrics",
    "difficulty": "advanced",
    "source": "FOGSI - APH Management",
    "demographics": {"age": 35, "gender": "Female", "location": "Lucknow, UP"},
    "chief_complaint": "Severe abdominal pain and board-like rigid uterus at 36 weeks",
    "presentation": "A 35-year-old G3P2 at 36 weeks gestation with known chronic hypertension presents with sudden onset severe constant abdominal pain and a hard, board-like uterus. Despite minimal vaginal bleeding (concealed abruption), she is going into shock. CTG shows fetal distress. She had been non-compliant with her antihypertensives.",
    "vital_signs": {"bp": "170/110", "hr": 120, "rr": 24, "temp": 37.0, "spo2": 94},
    "history": "G3P2, 36 weeks. Known chronic hypertension, on labetalol (non-compliant). Today: Sudden severe abdominal pain — constant, not colicky. Board-like rigidity of abdomen. Minimal vaginal bleeding (only dark spotting) — most blood is concealed behind placenta. Decreased fetal movements. No trauma. No cocaine use.",
    "physical_exam": "Severe distress from pain. Hypertensive (170/110). Signs of shock despite high BP (tachycardia, pallor, cold peripheries — Couvelaire uterus effect). Abdomen: Uterus board-like rigid, tender ('wooden' uterus — tonic contraction). Fundal height: More than gestational age (concealed blood expanding uterus). FHR: 80 (severe fetal bradycardia). Minimal dark vaginal bleeding. Cannot feel fetal parts (rigid uterus).",
    "investigations": "Clinical diagnosis — do NOT delay for investigations. Hb: 8.0 (rapid fall from concealed hemorrhage). Platelets: 60,000 (DIC developing). Fibrinogen: 80 mg/dL (critically low — <100 = severe DIC). PT: 22, APTT: 55 (prolonged). D-dimer: Markedly elevated. Blood group and massive transfusion protocol activated. USG (if time permits): Retroplacental clot, absent fetal cardiac activity. Bedside clot test: No clot at 7 minutes (DIC confirmed).",
    "diagnosis": "Abruptio placentae (Grade 3/concealed) with fetal demise and disseminated intravascular coagulation",
    "differentials": ["Abruptio placentae", "Uterine rupture", "Placenta previa (usually painless)", "HELLP syndrome", "Acute fatty liver of pregnancy", "Perforated peptic ulcer"],
    "learning_points": [
      "Abruption: PAINFUL dark bleeding with tense/tender uterus vs Previa: PAINLESS bright red bleeding with soft uterus",
      "Concealed hemorrhage (20%) is more dangerous than revealed — clinical shock disproportionate to visible bleeding",
      "DIC is the most feared complication — Fibrinogen <100 is critical (should be >400 in pregnancy)",
      "Couvelaire uterus: Blood infiltrates myometrium → uterus cannot contract → PPH after delivery",
      "Management: Resuscitate (blood + FFP + cryoprecipitate for fibrinogen) → expedite delivery (emergency cesarean if fetal distress; amniotomy + vaginal if fetal demise)",
      "Risk factors: Hypertension (most important — 50% of abruptions), trauma, cocaine, smoking, previous abruption"
    ],
    "india_context": "Abruption complicates 1-2% of pregnancies in India. Chronic hypertension is under-treated in pregnant women. Concealed abruption is often missed initially. DIC management requires blood components (FFP, cryoprecipitate) which may not be available at peripheral centers. FOGSI recommends referral to blood bank-equipped facility."
  },
  {
    "id": "OBG-010",
    "title": "Rh Isoimmunization in Pregnancy",
    "specialty": "obstetrics",
    "difficulty": "intermediate",
    "source": "FOGSI - Rh Negative Pregnancy Management",
    "demographics": {"age": 27, "gender": "Female", "location": "Nagpur, Maharashtra"},
    "chief_complaint": "Second pregnancy, Rh negative mother, positive indirect Coombs test",
    "presentation": "A 27-year-old G2P1 Rh-negative woman at 28 weeks gestation is found to have a positive indirect Coombs test (ICT) with rising antibody titers (1:32). Her first pregnancy 3 years ago ended in a normal delivery of an Rh-positive baby, but she did NOT receive anti-D immunoglobulin postpartum (the sensitizing event). The current fetus shows early signs of anemia on MCA Doppler.",
    "vital_signs": {"bp": "110/70", "hr": 78, "rr": 16, "temp": 37.0, "spo2": 99},
    "history": "G2P1. Blood group: B negative. Husband: B positive. First pregnancy (3 years ago): Normal delivery, baby Rh positive, 3.0 kg, healthy. Anti-D immunoglobulin NOT given postpartum (sensitizing event). Current pregnancy: Booked at 12 weeks, ICT positive at booking (1:8), now rising to 1:32 at 28 weeks. No history of blood transfusion. Father: Heterozygous Rh positive (50% chance of Rh positive fetus).",
    "physical_exam": "Unremarkable maternal examination. Uterus: 28 weeks, appropriate. FHR: 150 (normal currently). No hydrops signs on palpation (but need USG to assess).",
    "investigations": "Mother: Blood group B negative. ICT (indirect Coombs): Positive, Anti-D titer 1:32 (critical titer ≥1:16 requires MCA Doppler). Father: B positive, heterozygous (Dd). Cell-free fetal DNA (cffDNA): Fetus Rh positive (non-invasive fetal blood typing). MCA Doppler: Peak systolic velocity 1.4 MoM (moderate anemia — >1.5 MoM indicates severe anemia). USG: No fetal hydrops (ascites, pericardial effusion, skin edema). Liver mildly enlarged. Polyhydramnios absent.",
    "diagnosis": "Rh isoimmunization (anti-D alloimmunization) in second pregnancy with fetal anemia developing",
    "differentials": ["Rh isoimmunization (anti-D)", "ABO incompatibility (milder)", "Other minor blood group antibodies (Kell, Duffy)", "Non-immune hydrops (if hydrops present)", "Fetal anemia from other causes (parvovirus B19, alpha thalassemia)"],
    "learning_points": [
      "Rh isoimmunization: Rh-negative mother exposed to Rh-positive fetal blood → develops anti-D antibodies → affects NEXT pregnancy",
      "Prevention: Anti-D immunoglobulin 300 μg IM at 28 weeks antenatally AND within 72 hours postpartum if baby is Rh positive",
      "Also give anti-D after: Abortion, ectopic, amniocentesis, APH, abdominal trauma, external cephalic version",
      "MCA Doppler PSV is the non-invasive gold standard for monitoring fetal anemia (replaced amniocentesis/Liley curve)",
      "MCA PSV >1.5 MoM = severe fetal anemia → intrauterine transfusion (IUT) via cordocentesis",
      "Kleihauer-Betke test quantifies fetomaternal hemorrhage to determine extra anti-D doses needed"
    ],
    "india_context": "Rh-negative prevalence in India is 5-8% (higher in Northern India, lower in South and Northeast). Anti-D prophylaxis is still missed in many peripheral centers, especially after abortions. Anti-D immunoglobulin cost (Rs 2000-3500) and availability are barriers. GoI supplies anti-D free at government hospitals. MCA Doppler requires trained sonologists — available at tertiary centers."
  }
]
