[
  {
    "id": "ORTHO-001",
    "title": "Fracture Neck of Femur in Elderly Woman After Fall at Home",
    "specialty": "orthopedics",
    "difficulty": "intermediate",
    "source": "Indian Journal of Orthopaedics - Fragility Fractures in Indian Elderly",
    "demographics": {"age": 72, "gender": "Female", "location": "Jaipur, Rajasthan"},
    "chief_complaint": "Inability to bear weight on left lower limb after a fall at home 6 hours ago",
    "presentation": "A 72-year-old postmenopausal woman from Jaipur is brought to the emergency department after slipping on a wet floor at home and falling on her left side. She is unable to stand or bear weight on the left lower limb. She reports severe pain in the left groin and hip region. She is a known case of type 2 diabetes mellitus and systemic hypertension on irregular medications. She is largely homebound, has a stooped posture, and has not received any osteoporosis screening or calcium supplementation. Her diet is predominantly vegetarian with minimal dairy intake. She had a previous Colles fracture of the right wrist 3 years ago managed conservatively by a local bone setter.",
    "vital_signs": {"bp": "160/90", "hr": 96, "rr": 18, "temp": 36.8, "spo2": 96},
    "history": "Trivial fall (low-energy trauma) on wet floor at home. Immediate onset of left hip pain and inability to bear weight. No head injury or loss of consciousness. Known type 2 DM for 12 years on glimepiride 2mg (irregular compliance). Hypertension for 8 years on amlodipine 5mg. History of right Colles fracture 3 years ago treated by local bone setter with bamboo splint (malunion present). Postmenopausal for 22 years, never received HRT or osteoporosis treatment. Predominantly indoor lifestyle, minimal sun exposure (wears ghunghat/veil). Diet: roti, dal, sabzi with very little milk or curd. No history of smoking or alcohol. Family history: mother had kyphosis and hip fracture.",
    "physical_exam": "Elderly woman in pain, lying supine with the left lower limb shortened and externally rotated. Attitude of the left lower limb: 15-degree external rotation, 2 cm apparent shortening. Tenderness over the left anterior groin (femoral triangle). Attempted hip movements are extremely painful, especially internal rotation. No distal neurovascular deficit; dorsalis pedis and posterior tibial pulses palpable. Right wrist shows dinner fork deformity (old malunited Colles fracture). Thoracic kyphosis (dowager's hump) noted. No other injuries found on secondary survey.",
    "investigations": "X-ray pelvis with both hips AP view: Transcervical fracture of the left neck of femur, Garden grade III (incomplete displacement with valgus angulation). Singh index grade 3 (significant osteoporosis). Generalized osteopenia of both femora. X-ray right wrist: Malunited distal radius fracture with dorsal angulation. Blood investigations: Hb 10.8 g/dL, TLC 8,400/mm3, Platelets 2.1 lakh. RBS: 220 mg/dL, HbA1c: 8.2%. Serum creatinine: 1.1 mg/dL. Serum calcium: 8.2 mg/dL (low normal), Phosphorus: 3.8 mg/dL, ALP: 140 IU/L (elevated), 25-OH Vitamin D: 11 ng/mL (deficient). ECG: Normal sinus rhythm, no ischemic changes. 2D Echo: Mild concentric LVH, EF 58%. DEXA scan (done post-stabilization): T-score femoral neck -3.8 (osteoporosis), lumbar spine -3.2.",
    "diagnosis": "Left intracapsular fracture neck of femur (Garden grade III) secondary to osteoporotic fragility fracture with severe Vitamin D deficiency",
    "differentials": ["Intracapsular fracture neck of femur (transcervical/subcapital)", "Intertrochanteric fracture of femur", "Subtrochanteric fracture", "Pathological fracture (metastatic disease, myeloma)", "Posterior hip dislocation"],
    "learning_points": [
      "Garden classification of femoral neck fractures: Grade I (incomplete/valgus impacted), Grade II (complete but undisplaced), Grade III (complete, partially displaced), Grade IV (complete, fully displaced) - Grades III and IV have highest risk of AVN",
      "In elderly patients (>60 years) with displaced intracapsular fractures (Garden III/IV), hemiarthroplasty (cemented bipolar) is the treatment of choice as chances of fracture union and AVN are unacceptable with internal fixation",
      "In physiologically young patients (<60 years), attempt fixation with cancellous cannulated screws within 6 hours (golden period) to preserve the femoral head",
      "Vitamin D deficiency is epidemic in India (70-90% prevalence even in sunny states) due to indoor lifestyle, dark skin pigmentation, vegetarian diet, and cultural practices like veiling - ICMR recommends 600-2000 IU daily supplementation",
      "Singh index on plain X-ray grades trabecular pattern in proximal femur (Grade 6 = normal, Grade 1 = severe osteoporosis) and is a cost-effective screening tool in resource-limited Indian settings",
      "Every fragility fracture patient must be evaluated for osteoporosis and started on calcium, Vitamin D, and bisphosphonates to prevent the 'second fracture' - the concept of Fracture Liaison Services (FLS) is being adopted in India"
    ],
    "india_context": "India has an estimated 50 million people with osteoporosis, with hip fracture incidence rising rapidly due to increasing life expectancy. Vitamin D deficiency is paradoxically endemic despite abundant sunshine, owing to indoor lifestyles, skin pigmentation, and vegetarian diets. Many elderly patients first present to traditional bone setters (known as 'haadjod' practitioners), leading to delays and complications. The Indian Orthopaedic Association recommends cemented bipolar hemiarthroplasty for displaced femoral neck fractures in the elderly. Post-fracture mortality at 1 year in Indian elderly is 25-30%, highlighting the need for comprehensive geriatric hip fracture programs."
  },
  {
    "id": "ORTHO-002",
    "title": "Open Fracture of Tibia Following Road Traffic Accident",
    "specialty": "orthopedics",
    "difficulty": "advanced",
    "source": "Indian Journal of Orthopaedics - Open Fracture Management in Indian Trauma Centers",
    "demographics": {"age": 28, "gender": "Male", "location": "Nagpur, Maharashtra"},
    "chief_complaint": "Severe pain, bleeding, and bone visible through a wound on the right leg after a motorcycle accident 3 hours ago",
    "presentation": "A 28-year-old male auto-rickshaw driver from Nagpur is brought to the trauma center by bystanders after a high-speed collision between his motorcycle and a truck on NH-44. He was not wearing a helmet and was thrown off the bike. He has a large wound on the anterior aspect of the right leg with visible bone fragments and significant contamination with road debris and soil. He is conscious but in severe pain. There is active bleeding controlled partially by a cloth tied by bystanders. He was first taken to a primary health center where a tetanus injection was given and he was referred to the tertiary center, resulting in a 3-hour delay from time of injury.",
    "vital_signs": {"bp": "100/60", "hr": 118, "rr": 22, "temp": 37.2, "spo2": 95},
    "history": "High-speed motorcycle versus truck collision approximately 3 hours ago. Patient was riding without protective gear. Thrown from bike onto the road. Immediate severe pain in the right leg with bleeding and visible bone. No loss of consciousness, no head injury symptoms. No chest or abdominal pain. No other limb injuries. First taken to a PHC 30 km away where wound was covered with gauze, IV fluids started, tetanus toxoid given, and referred. No past medical history. No allergies. Non-smoker, occasional alcohol. Last meal 4 hours ago.",
    "physical_exam": "Primary survey: Airway patent, breathing adequate, circulation - tachycardic with hypotension (early hemorrhagic shock). GCS 15/15. Secondary survey of right leg: A 12 cm x 8 cm wound over the anterolateral aspect of the middle third of the right leg with extensive soft tissue loss, exposed tibial shaft with comminuted fracture fragments visible, contamination with soil and road debris. Periosteal stripping noted over a 6 cm segment. Wound margins are ragged and contused. Active oozing present. Dorsalis pedis pulse is palpable but weak. Posterior tibial pulse palpable. Sensation intact in all dermatomes of the foot. Toe movements present (EHL, FHL active). The anterior and lateral compartments are tense but not rock-hard. Ipsilateral knee and ankle joints stable on preliminary assessment. No other skeletal injuries on full-body survey.",
    "investigations": "X-ray right leg AP and lateral: Comminuted fracture of the mid-shaft tibia and fibula with butterfly fragment. Moderate displacement and angulation. No extension into knee or ankle joints. X-ray pelvis, cervical spine: Normal. FAST ultrasound: No free fluid. CBC: Hb 9.8 g/dL (blood loss), TLC 14,200/mm3, Platelets 2.4 lakh. Blood group and cross-match: B positive, 2 units packed RBC arranged. RFT: Creatinine 1.0 mg/dL. Coagulation: PT/INR normal. RBS: 140 mg/dL. Wound swab sent for culture and sensitivity. CRP: 28 mg/L (elevated). Serum lactate: 2.8 mmol/L (mildly elevated).",
    "diagnosis": "Gustilo-Anderson Type IIIB open fracture of the right mid-shaft tibia and fibula secondary to road traffic accident",
    "differentials": ["Gustilo-Anderson Type IIIB open fracture (extensive soft tissue loss, periosteal stripping, bone contamination)", "Gustilo-Anderson Type IIIA open fracture (adequate soft tissue coverage possible)", "Gustilo-Anderson Type IIIC open fracture (with vascular injury requiring repair)", "Open fracture with compartment syndrome", "Mangled extremity requiring primary amputation (MESS score evaluation)"],
    "learning_points": [
      "Gustilo-Anderson classification: Type I (<1 cm wound, clean), Type II (1-10 cm wound, moderate contamination), Type IIIA (>10 cm, adequate soft tissue cover), Type IIIB (>10 cm, periosteal stripping, requires flap coverage), Type IIIC (any open fracture with vascular injury requiring repair) - essential for NEET-PG",
      "Emergency management follows the '6-hour rule' for debridement, though recent evidence supports thorough debridement within 24 hours if appropriate antibiotics are started early - first-generation cephalosporin for Type I/II, add aminoglycoside for Type III, add penicillin if soil contamination (anaerobes)",
      "External fixation is the gold standard for initial stabilization of Type IIIB open tibial fractures - definitive intramedullary nailing can be done once soft tissues are healthy (damage control orthopedics principle)",
      "Type IIIB fractures require soft tissue reconstruction (local rotational flap for proximal/middle third defects, free flap such as free latissimus dorsi or ALT for distal third defects) - involvement of a plastic surgeon is essential",
      "MESS (Mangled Extremity Severity Score) >7 has traditionally been considered an indication for primary amputation, though clinical judgment remains paramount",
      "Serial wound debridement every 48-72 hours with negative pressure wound therapy (VAC dressing) bridges the gap until definitive soft tissue coverage in resource-limited settings"
    ],
    "india_context": "India has one of the highest road traffic accident rates globally, with approximately 1.5 lakh deaths annually (MoRTH data). Two-wheeler riders constitute 40% of road traffic fatalities, and lack of protective gear is a major contributing factor. Open tibial fractures are extremely common due to the subcutaneous location of the tibia. Delayed presentation to tertiary trauma centers (average 6-12 hours in rural India) increases infection rates. The Indian Orthopaedic Association ATLS-equivalent training (IATSIC courses) and trauma system development are ongoing. Many patients first present to unqualified practitioners or bone setters, further delaying definitive surgical care. Infection rates in open fractures in Indian studies are reported at 15-40% for Type III injuries."
  },
  {
    "id": "ORTHO-003",
    "title": "Septic Arthritis of the Knee in a Young Child",
    "specialty": "orthopedics",
    "difficulty": "intermediate",
    "source": "Journal of Pediatric Orthopaedics (Indian Section) - Acute Septic Arthritis in Children",
    "demographics": {"age": 4, "gender": "Male", "location": "Patna, Bihar"},
    "chief_complaint": "Refusal to walk and high-grade fever for 3 days with swelling of the right knee",
    "presentation": "A 4-year-old boy from a semi-urban area of Patna is brought by his parents with a 3-day history of high-grade fever, irritability, refusal to bear weight on the right leg, and progressive swelling of the right knee. The child had a skin boil on the right thigh 10 days ago which was squeezed and drained at home. He was initially taken to a local practitioner who prescribed oral amoxicillin and paracetamol, but the symptoms worsened. The child is malnourished (weight 12 kg, well below the 50th percentile) and has not received complete immunization.",
    "vital_signs": {"bp": "90/55", "hr": 140, "rr": 32, "temp": 39.6, "spo2": 97},
    "history": "Fever for 3 days, initially intermittent then becoming persistent and high-grade (documented up to 103°F at home). Refusal to walk or move the right leg since day 1 of fever. Progressive swelling of the right knee noticed from day 2. Child is very irritable and cries on any attempt to move the right leg. History of skin boil (furuncle) on right anterior thigh 10 days ago - parents squeezed it at home. The child is the third of four siblings. Born at home, partial immunization (only BCG and first dose of OPV). Diet: predominantly rice and dal, occasional milk. Developmental milestones normal. No prior hospitalizations. No history of recent trauma. No history of sickle cell disease in the family.",
    "physical_exam": "Ill-looking, febrile, irritable child. Malnourished (weight 12 kg, height 95 cm, BMI 13.3). Right knee: diffuse warm, tense swelling with obliteration of knee contour. Palpable effusion with positive patellar tap and ballottement. Skin over the knee is erythematous and shiny. The knee is held in 20-degree flexion (position of maximum comfort). Any attempt at passive flexion or extension is met with severe pain and guarding. Tenderness is maximum along the joint line, both medial and lateral. There is no point tenderness over the distal femoral or proximal tibial metaphysis (helps differentiate from osteomyelitis). Healing scar of the furuncle visible on the right anterior thigh. Inguinal lymphadenopathy on the right side. Left knee and other joints are normal. Abdomen: Mild hepatomegaly.",
    "investigations": "Blood investigations: Hb 9.4 g/dL (anemia of chronic disease/malnutrition), TLC 18,600/mm3 (neutrophilic leukocytosis with 82% neutrophils), Platelets 3.8 lakh. ESR: 68 mm/hr (markedly elevated). CRP: 96 mg/L (markedly elevated). Blood culture: Sent (result after 48 hours - Staphylococcus aureus, MSSA). Procalcitonin: 4.2 ng/mL (elevated, suggesting bacterial infection). X-ray right knee AP and lateral: Widened joint space with soft tissue swelling, no bony erosions or periosteal reaction (early presentation). Ultrasound right knee: Significant joint effusion (approximately 30 mL), echogenic fluid with internal debris suggesting pus, synovial thickening. Joint aspiration (under ultrasound guidance): 25 mL of turbid, yellowish-white purulent fluid. Synovial fluid analysis: WBC count 92,000/mm3 (>50,000 suggestive of sepsis), 95% neutrophils, Gram stain shows Gram-positive cocci in clusters, glucose 18 mg/dL (very low compared to serum glucose 100 mg/dL), protein 5.2 g/dL. Culture of aspirate: Staphylococcus aureus (MSSA), sensitive to cloxacillin, cefazolin, clindamycin. Hb electrophoresis: HbAA (normal, ruling out sickle cell).",
    "diagnosis": "Acute septic arthritis of the right knee (Staphylococcus aureus) secondary to hematogenous spread from skin infection, in a malnourished child",
    "differentials": ["Septic arthritis (Staphylococcus aureus most common in children)", "Acute osteomyelitis of distal femur or proximal tibia with sympathetic effusion", "Juvenile idiopathic arthritis (systemic onset/pauciarticular)", "Transient synovitis of the knee (typically hip, but can affect knee)", "Hemarthrosis (hemophilia - unlikely without history)"],
    "learning_points": [
      "Kocher criteria for differentiating septic arthritis from transient synovitis (originally for hip): fever >38.5°C, non-weight bearing, ESR >40 mm/hr, WBC >12,000/mm3 - presence of all four gives >99% probability of septic arthritis; this child meets all four criteria",
      "Septic arthritis is an orthopedic emergency - delayed treatment beyond 48 hours leads to irreversible cartilage destruction due to proteolytic enzymes from neutrophils and bacteria, ultimately causing a destroyed joint",
      "Staphylococcus aureus is the most common organism in children >2 years; in neonates, Group B Streptococcus and gram-negative bacilli predominate; in children 6 months to 5 years, Haemophilus influenzae was common before vaccination",
      "Treatment protocol: emergency arthrotomy and lavage (open drainage) is the gold standard for knee septic arthritis in children, combined with IV antibiotics (cloxacillin/cefazolin for MSSA) for 3-4 weeks followed by oral antibiotics for 3-4 weeks (total 6 weeks)",
      "The knee is held in 20-degree flexion in septic arthritis because this is the position of maximum joint volume (least intracapsular pressure) - same principle applies to the hip (flexion, abduction, external rotation)"
    ],
    "india_context": "Malnutrition and poor immunization coverage in states like Bihar increase susceptibility to bacterial infections in children. Skin infections (boils, impetigo) are extremely common in tropical Indian climates and serve as a source for hematogenous septic arthritis. Delayed presentation is a significant problem as parents often first consult unqualified practitioners. MRSA rates in Indian pediatric septic arthritis are rising (15-25% in some centers), necessitating empirical coverage with vancomycin in severe cases until culture results are available. The National Health Mission's push for complete immunization and nutrition programs (ICDS/Poshan Abhiyaan) aim to address underlying risk factors."
  },
  {
    "id": "ORTHO-004",
    "title": "Osteosarcoma of the Distal Femur in an Adolescent Boy",
    "specialty": "orthopedics",
    "difficulty": "advanced",
    "source": "Indian Journal of Cancer - Osteosarcoma Outcomes in Indian Tertiary Centers",
    "demographics": {"age": 16, "gender": "Male", "location": "Lucknow, Uttar Pradesh"},
    "chief_complaint": "Progressive painful swelling over the lower end of the right thigh for 3 months, now with difficulty walking",
    "presentation": "A 16-year-old boy, a student from Lucknow, is brought by his parents with a 3-month history of progressively increasing painful swelling over the lower end of the right thigh. The pain is worse at night and has been increasing in severity. He initially attributed it to a minor sports injury while playing cricket and was taken to a local bone setter who applied herbal paste and massage for 6 weeks, during which the swelling increased significantly. He has lost 4 kg weight over the past 2 months and reports low-grade evening rise of temperature. The parents are concerned about a visible lump that has nearly doubled in size over the last month.",
    "vital_signs": {"bp": "118/72", "hr": 84, "rr": 16, "temp": 37.4, "spo2": 98},
    "history": "Dull aching pain in the right knee region for 3 months, initially intermittent, now constant and worse at night (suggestive of bone pain). Pain not relieved by rest or common analgesics. Swelling noticed 2 months ago, progressively increasing in size. No history of significant trauma (minor knock during cricket, which he attributes as the cause). Taken to a local bone setter who performed vigorous massage and applied a herbal poultice for 6 weeks - swelling worsened during this period. Low-grade fever in the evenings for 1 month. Unintentional weight loss of 4 kg. Loss of appetite. No history of prior radiation exposure. No family history of cancer or retinoblastoma. Developmentally normal. He is tall for his age (178 cm, 90th percentile - rapid growth phase).",
    "physical_exam": "Tall adolescent boy appearing thin and mildly pale. Right lower thigh/knee region: A hard, fixed, warm, tender swelling measuring approximately 10 cm x 8 cm over the distal femoral metaphysis extending to the metadiaphyseal region. The swelling is fusiform, non-transilluminant, and fixed to the underlying bone. Skin over the swelling shows prominent dilated veins (increased vascularity). Overlying skin discoloration from herbal paste application. Knee range of motion is restricted (0-90 degrees) due to pain and swelling. No joint effusion. Distal neurovascular status intact. Right inguinal lymph nodes: two palpable, firm, non-tender, 1.5 cm each. Left lower limb: Normal. Chest examination: Clear. Abdomen: No hepatosplenomegaly.",
    "investigations": "X-ray right knee AP and lateral: Aggressive mixed lytic and sclerotic lesion in the distal femoral metaphysis with cortical destruction, periosteal reaction showing Codman triangle and sunburst (sunray) pattern, soft tissue extension with ossification. No joint involvement. MRI right thigh with knee (with gadolinium): Large 10.2 x 7.8 x 8.5 cm heterogeneously enhancing mass arising from the distal femoral metaphysis with cortical breach, extensive soft tissue component, no skip lesions in the femur, marrow involvement extends 12 cm proximal from the articular surface, no neurovascular encasement, no joint involvement. CT chest (metastatic workup): Two sub-centimeter pulmonary nodules in the right lower lobe (6 mm and 8 mm), suspicious for pulmonary metastases. Bone scan (Tc-99m MDP): Intense uptake in the distal right femur, no other skeletal lesions. Blood: Hb 10.2 g/dL, TLC 9,800/mm3, Platelets 3.2 lakh. ESR: 56 mm/hr. Serum ALP: 480 IU/L (markedly elevated, correlates with osteoblastic activity and prognosis). LDH: 620 IU/L (elevated, poor prognostic marker). Calcium: 9.4 mg/dL. Core needle biopsy (performed under image guidance from the most representative area, through a tract that can be excised with the definitive specimen): Histopathology shows high-grade conventional osteosarcoma (osteoblastic subtype) with marked nuclear pleomorphism, atypical mitoses, and osteoid production by malignant cells.",
    "diagnosis": "Conventional high-grade osteosarcoma of the distal right femur (osteoblastic subtype) with suspected pulmonary metastases (Stage IIB/III per Enneking staging)",
    "differentials": ["Osteosarcoma (most common primary malignant bone tumor in adolescents)", "Ewing sarcoma (onion-peel periosteal reaction, diaphyseal, younger age, different histology)", "Giant cell tumor (epiphyseal, typically after skeletal maturity, soap bubble appearance)", "Osteomyelitis (chronic, may mimic aggressive lesion on imaging)", "Aneurysmal bone cyst (expansile, fluid-fluid levels on MRI)"],
    "learning_points": [
      "Osteosarcoma is the most common primary malignant bone tumor, with peak incidence in the second decade of life during the adolescent growth spurt; the most common site is the distal femoral metaphysis (50%), followed by proximal tibia and proximal humerus",
      "Classic X-ray findings for NEET-PG: Codman triangle (elevated periosteum with tumor growing through), sunburst/sunray pattern (spicules of new bone radiating outward), mixed lytic-sclerotic lesion with soft tissue mass - contrast with Ewing sarcoma which shows onion-peel periosteal reaction",
      "Biopsy must be performed through a carefully planned tract (longitudinal incision) that can be excised en bloc during definitive surgery - a poorly placed biopsy incision can compromise limb salvage and is considered a serious surgical error (Mankin's study)",
      "Current standard treatment is neoadjuvant chemotherapy (MAP protocol: Methotrexate, Adriamycin/Doxorubicin, cisPlatin) followed by wide excision (limb salvage surgery with endoprosthetic reconstruction preferred over amputation in 80-85% cases) followed by adjuvant chemotherapy; tumor necrosis >90% on the resected specimen (Huvos grade III/IV) indicates good chemotherapy response",
      "Serum ALP and LDH are important prognostic markers - elevated levels at diagnosis correlate with larger tumor burden and poorer prognosis; they are also used to monitor treatment response",
      "Delay in diagnosis is a major problem in India (average 3-4 months) due to initial treatment by bone setters and unqualified practitioners - vigorous massage of a bone tumor can promote hematogenous metastasis and worsen outcomes"
    ],
    "india_context": "Delayed presentation of bone tumors is a critical problem in India, with an average delay of 14-20 weeks from symptom onset to diagnosis at a tertiary center. Many adolescents are first treated by traditional bone setters (haddjods) who perform massage and apply herbal pastes, which can worsen the condition and delay diagnosis. The Tata Memorial Hospital data shows that approximately 20-25% of osteosarcoma patients in India present with metastatic disease, compared to 15% globally. Limb salvage surgery using indigenous megaprostheses (such as those developed at institutions like PGIMER Chandigarh and CMC Vellore) has improved accessibility and reduced costs compared to imported implants. The National Cancer Grid guidelines recommend centralized treatment of bone sarcomas at tertiary cancer centers for optimal outcomes."
  },
  {
    "id": "ORTHO-005",
    "title": "Lumbar Disc Prolapse with Cauda Equina Syndrome",
    "specialty": "orthopedics",
    "difficulty": "advanced",
    "source": "Neurology India - Cauda Equina Syndrome: Surgical Outcomes in Indian Practice",
    "demographics": {"age": 42, "gender": "Male", "location": "Coimbatore, Tamil Nadu"},
    "chief_complaint": "Sudden worsening of chronic low back pain with numbness in both legs, difficulty passing urine, and loss of sensation around the buttocks for 1 day",
    "presentation": "A 42-year-old male textile factory worker from Coimbatore presents to the emergency department with a 1-day history of acute worsening of chronic low back pain, progressive numbness and weakness in both lower limbs, inability to pass urine for the past 12 hours, and a strange feeling of numbness around his buttocks and perineum. He has a 5-year history of intermittent low back pain with radiation to the left leg, for which he has been taking over-the-counter NSAIDs and visiting a Siddha medicine practitioner who performed repeated traction manipulations. He lifted a heavy textile roll at work yesterday, following which his back pain became excruciating and the new symptoms developed rapidly.",
    "vital_signs": {"bp": "148/88", "hr": 90, "rr": 18, "temp": 37.0, "spo2": 98},
    "history": "Chronic low back pain for 5 years, radiating to left posterior thigh and calf (L5-S1 dermatomal distribution). Treated with NSAIDs, local Siddha massage and manipulative therapy. Symptoms were manageable with intermittent flares. Yesterday, while lifting a heavy textile roll (approximately 40 kg), experienced sudden severe low back pain ('electric shock-like') radiating to both legs. Progressive numbness in both feet, ascending to calves and thighs. Noticed difficulty walking with both feet 'slapping' the ground. Unable to pass urine for 12 hours despite strong desire to do so (urinary retention). Numbness around the buttocks and perineum described as 'sitting on a cushion but unable to feel it' (saddle anesthesia). No bowel incontinence yet but reports decreased awareness of rectal fullness. No history of fever, weight loss, or trauma other than the lifting episode. No history of malignancy. Occupation involves prolonged standing and heavy lifting.",
    "physical_exam": "Patient in severe pain, unable to sit or stand comfortably. Lumbar spine: Loss of lumbar lordosis, paravertebral muscle spasm bilaterally, severe tenderness at L4-L5 and L5-S1 levels. Severely restricted range of motion in all directions. Straight Leg Raising (SLR): Positive bilaterally at 20 degrees (crossed SLR also positive, suggesting central disc prolapse). Neurological examination of lower limbs: Motor - bilateral foot drop (EHL 2/5, ankle dorsiflexion 2/5, plantarflexion 3/5, knee extension 4/5). Sensory - diminished sensation in L4, L5, S1, S2 dermatomes bilaterally, with complete loss of sensation in S3-S5 dermatomes (saddle anesthesia confirmed by pinprick). Absent ankle jerks bilaterally, knee jerks preserved but diminished. Perianal examination: Absent perianal sensation (S2-S4), markedly reduced anal sphincter tone on digital rectal examination, absent bulbocavernosus reflex, absent anal wink reflex. Bladder: Palpable up to umbilicus (grossly distended, confirmed by ultrasound showing 900 mL residual volume). No upper motor neuron signs (Babinski negative bilaterally, no clonus).",
    "investigations": "MRI lumbosacral spine (emergency, within 1 hour of presentation): Large central and left paracentral disc herniation at L4-L5 level with caudal migration, causing severe compression of the cauda equina. The disc fragment measures 2.5 cm craniocaudally and fills >75% of the spinal canal. L5-S1 disc also shows broad-based protrusion with moderate canal stenosis. Cauda equina nerve roots are compressed and displaced. No evidence of tumor or infection. X-ray lumbar spine: Reduced L4-L5 disc space height, no listhesis, no fracture. Blood investigations: Hb 14.2 g/dL, TLC 8,200/mm3. RFT: Normal. Blood sugar: Normal. Urinalysis: Normal (catheterized specimen). Post-void residual (by catheterization): 900 mL. Nerve conduction study (if time permits, not mandatory preoperatively): Not done in emergency setting - clinical diagnosis sufficient for urgent surgical planning.",
    "diagnosis": "Cauda equina syndrome secondary to massive L4-L5 central disc prolapse with bilateral lower limb weakness, saddle anesthesia, and urinary retention",
    "differentials": ["Cauda equina syndrome due to massive disc prolapse (most common cause)", "Cauda equina tumor (ependymoma, schwannoma, metastasis)", "Spinal epidural abscess with cauda equina compression", "Conus medullaris syndrome (upper motor neuron + lower motor neuron mix, sudden onset, symmetric)", "Spinal epidural hematoma (especially in anticoagulated patients)"],
    "learning_points": [
      "Cauda equina syndrome (CES) is defined by the triad of saddle anesthesia, bladder dysfunction (typically painless urinary retention with overflow incontinence), and bilateral lower limb neurological deficits - this is an absolute surgical emergency requiring decompression ideally within 24-48 hours for best outcomes",
      "CES must be distinguished from conus medullaris syndrome for NEET-PG: CES is lower motor neuron (LMN) - asymmetric, gradual onset, severe radicular pain, bladder retention (atonic), absent ankle jerks; Conus is mixed UMN+LMN - symmetric, sudden onset, less pain, bladder early involvement, Babinski may be positive",
      "Red flag signs in low back pain that mandate urgent investigation include: bilateral leg symptoms, saddle anesthesia, urinary retention or incontinence, fecal incontinence, progressive motor weakness, and history of cancer - these must not be missed in clinical practice",
      "Surgical treatment is emergency decompressive laminectomy and discectomy; delay beyond 48 hours significantly worsens prognosis for bladder recovery, which is the last function to recover and often remains permanently impaired",
      "Crossed straight leg raising test (raising the unaffected leg reproduces pain in the affected leg) indicates a large central disc prolapse and is highly specific - its bilateral positivity in this case is consistent with the massive central herniation causing CES"
    ],
    "india_context": "Chronic low back pain is extremely prevalent in the Indian working population, especially among manual laborers, textile workers, and agricultural workers. Many patients rely on traditional medicine systems (Siddha, Ayurveda) and unqualified manipulators for spinal problems, which can delay diagnosis of serious conditions like cauda equina syndrome. MRI availability remains limited in semi-urban and rural India, and patients often need to be transferred to tertiary centers for emergency imaging. The Indian Orthopaedic Association and Association of Spine Surgeons of India (ASSI) emphasize awareness among primary care physicians about red flag signs to enable timely referral. Occupational health regulations regarding safe manual handling are poorly enforced in many Indian industrial settings."
  },
  {
    "id": "ORTHO-006",
    "title": "Bilateral Congenital Talipes Equinovarus (Clubfoot) in a Newborn",
    "specialty": "orthopedics",
    "difficulty": "beginner",
    "source": "Indian Journal of Orthopaedics - Ponseti Method Outcomes in Indian Clubfoot Clinics",
    "demographics": {"age": 0, "gender": "Male", "location": "Bhopal, Madhya Pradesh"},
    "chief_complaint": "Both feet are turned inward and downward noticed at birth",
    "presentation": "A 3-day-old male newborn, born at a district hospital in Bhopal via normal vaginal delivery at 38 weeks gestation, is referred to the orthopedic outpatient department because both feet were noticed to be abnormally positioned at birth. The feet are turned inward and downward with deep creases on the medial and posterior aspects. The baby is the first child of a non-consanguineous couple. The mother is 24 years old with no significant antenatal history except that she did not take folic acid supplementation during the first trimester. Birth weight is 2.8 kg. The baby is otherwise healthy with no other congenital anomalies detected on initial neonatal examination. The parents are distressed and have been told by relatives that the child will never walk normally.",
    "vital_signs": {"bp": "N/A (neonatal)", "hr": 142, "rr": 44, "temp": 36.9, "spo2": 97},
    "history": "Full-term normal vaginal delivery at 38 weeks gestation. Birth weight 2.8 kg, Apgar 8/9. Abnormal foot position noticed immediately at birth by the delivering doctor. No antenatal ultrasound performed (mother had only one antenatal visit at 7th month). No family history of clubfoot or other musculoskeletal anomalies. Non-consanguineous marriage. No maternal diabetes, no drug exposure (other than iron tablets). Mother did not take folic acid in the first trimester. No oligohydramnios. Baby is breastfeeding well, passed meconium, no jaundice. No other congenital anomalies suspected on neonatal screening.",
    "physical_exam": "Well-nourished neonate, alert, active cry, no dysmorphic features. Both feet examination: Bilateral symmetrical deformity with all four components of CTEV present - (1) Cavus: high medial longitudinal arch with forefoot pronation, deep medial crease, (2) Adductus: forefoot and midfoot deviated medially (bean-shaped lateral border of foot), (3) Varus: heel turned inward (inverted), (4) Equinus: ankle in fixed plantarflexion with deep posterior crease, the foot cannot be dorsiflexed past neutral. The deformity is rigid and does not correct with gentle passive manipulation (true clubfoot, not positional). Pirani scoring: Hindfoot score 3/3 (posterior crease severity 1, emptiness of heel 1, rigidity of equinus 1), Midfoot score 3/3 (medial crease severity 1, lateral border curvature 1, lateral head of talus coverage 1). Total Pirani score: 6/6 bilaterally (severe). Spine: No sacral dimple or tuft of hair (ruling out occult spinal dysraphism). Hips: Barlow and Ortolani tests negative bilaterally (ruling out DDH, which is associated with CTEV). Upper limbs: Normal. No features of arthrogryposis or other syndromic associations.",
    "investigations": "Clinical diagnosis - investigations are minimal in idiopathic CTEV. X-ray both feet AP and lateral (done for documentation, not mandatory for initiating treatment): AP view shows talocalcaneal angle reduced (<20 degrees, normally 20-40 degrees) with parallel alignment of talus and calcaneus (talocalcaneal parallelism), metatarsals adducted. Lateral view shows talocalcaneal angle reduced (<25 degrees, normally 25-50 degrees), ladder pattern of metatarsals (all metatarsals overlapping). Kite's angle reduced on both views. Hip ultrasound (screening for DDH): Normal bilateral hips, no dysplasia. Spinal ultrasound (screening): Normal conus position, no spinal dysraphism. Newborn screening: Normal. Karyotype: Not indicated as no syndromic features.",
    "diagnosis": "Bilateral idiopathic Congenital Talipes Equinovarus (CTEV / clubfoot), Pirani score 6/6 bilaterally",
    "differentials": ["Idiopathic CTEV (most common, 80% of all clubfoot)", "Positional clubfoot/postural talipes (flexible, corrects with gentle manipulation, no treatment needed beyond stretching)", "Neurogenic clubfoot (secondary to myelomeningocele, spinal dysraphism - check for sacral dimple/tuft)", "Syndromic clubfoot (arthrogryposis multiplex congenita, Larsen syndrome, diastrophic dysplasia)", "Congenital constriction band syndrome with secondary clubfoot deformity"],
    "learning_points": [
      "CTEV has four components remembered by the mnemonic 'CAVE': Cavus, Adductus, Varus, Equinus - for the Ponseti method, these are corrected sequentially as CAVE (cavus first by supinating forefoot, then adductus and varus simultaneously by abducting the foot with counter-pressure on the talar head, equinus corrected last by percutaneous Achilles tenotomy)",
      "The Ponseti method is the gold standard treatment for CTEV: weekly serial manipulation and above-knee plaster casts (typically 5-7 casts over 5-7 weeks), followed by percutaneous Achilles tenotomy in approximately 80-90% of cases to correct residual equinus, followed by foot abduction brace (Denis Browne bar with shoes) worn 23 hours/day for 3 months then night-time only until age 4-5 years",
      "Pirani scoring system (0-6) is used to assess severity and monitor progress during Ponseti casting: Midfoot contracture score (0-3) evaluates medial crease, lateral border curvature, and talar head coverage; Hindfoot contracture score (0-3) evaluates posterior crease, emptiness of heel, and rigidity of equinus - higher score indicates more severe deformity",
      "The most common cause of relapse in CTEV is non-compliance with the foot abduction brace (Denis Browne splint) - parents must be extensively counseled about the importance of brace wear, which is the most critical factor in long-term success",
      "Incidence of CTEV is approximately 1-2 per 1000 live births, male to female ratio is 2:1, bilateral involvement occurs in 50% of cases; the CURE India clubfoot program has treated over 100,000 children using the Ponseti method across India"
    ],
    "india_context": "India has the highest absolute number of clubfoot births globally (approximately 50,000 per year) due to its large population. The CURE India Clubfoot Program, in collaboration with the Indian Orthopaedic Association, has established over 600 Ponseti clinics across India and trained thousands of practitioners in the Ponseti method. Before the Ponseti revolution, extensive corrective surgeries (posteromedial soft tissue release) were the norm, often leaving patients with stiff, painful feet. Traditional bone setters in India often attempt manipulation and splinting of clubfoot with variable and usually poor results, leading to resistant deformities. The Pirani scoring system was specifically validated in Indian settings and is used as the standard assessment tool. India's National Programme for Prevention and Management of Birth Defects includes clubfoot screening at birth. Socioeconomic barriers, particularly in rural areas, remain a challenge for brace compliance during the maintenance phase of treatment."
  },
  {
    "id": "ORTHO-007",
    "title": "Pott's Spine with Paraplegia in a Young Woman",
    "specialty": "orthopedics",
    "difficulty": "advanced",
    "source": "Indian Journal of Tuberculosis - Spinal Tuberculosis Management: IOA-AO Spine India Consensus",
    "demographics": {"age": 28, "gender": "Female", "location": "Ranchi, Jharkhand"},
    "chief_complaint": "Progressive upper back pain for 4 months with inability to walk for 2 weeks and loss of sensation below the chest",
    "presentation": "A 28-year-old tribal woman from a rural area near Ranchi, Jharkhand, presents to the orthopedic department with a 4-month history of progressive upper back pain, constitutional symptoms (low-grade evening fever, night sweats, weight loss, loss of appetite), and a 2-week history of progressive weakness of both lower limbs culminating in inability to walk. She also reports a band-like sensation of tightness around her chest at the level of the nipples and difficulty controlling her bladder over the past 5 days. She was treated with analgesics and traditional herbal medicines by a local practitioner. She has a history of pulmonary tuberculosis in her father who died 2 years ago. She lives in a one-room mud house with poor ventilation shared by 6 family members.",
    "vital_signs": {"bp": "110/70", "hr": 92, "rr": 20, "temp": 37.8, "spo2": 96},
    "history": "Insidious onset of upper back pain 4 months ago, initially intermittent, now constant and localized to the thoracic region. Pain worse at night and with activity, partially relieved by rest. Progressive difficulty in sitting upright and bending forward. Associated constitutional symptoms: low-grade evening rise of temperature (up to 100°F) for 3 months, drenching night sweats, loss of appetite, and weight loss of approximately 8 kg in 4 months. Noticed a visible 'hump' developing in the upper back 2 months ago. Progressive weakness of both lower limbs starting 1 month ago - initially difficulty climbing stairs, then difficulty walking, and complete inability to walk for the past 2 weeks. Numbness below the chest level for 3 weeks. Urinary hesitancy progressing to incontinence for 5 days. History of contact with sputum-positive pulmonary TB (father, died 2 years ago). No personal history of TB or ATT intake. Lives in overcrowded conditions with poor ventilation. Belongs to a Particularly Vulnerable Tribal Group (PVTG). Not on any regular medications. No history of diabetes, HIV, or immunosuppression.",
    "physical_exam": "Thin, wasted young woman (BMI 16.2), lying in bed, unable to sit or stand. Visible gibbus (angular kyphotic deformity) at the T6-T7 level, tender on palpation. Paravertebral muscle spasm. Fullness palpable on either side of the spinous processes (cold abscess). No sinus or discharging wound. Neurological examination: Motor power - upper limbs 5/5 normal; lower limbs - hip flexion 1/5, knee extension 1/5, ankle dorsiflexion 0/5, plantarflexion 0/5 bilaterally (paraplegia, Frankel grade B). Sensory level at T5 dermatome (at nipple line) - complete loss of all modalities below this level including pinprick, light touch, proprioception, and vibration. Deep tendon reflexes: Knee jerks brisk (3+), ankle jerks brisk (3+) with bilateral sustained ankle clonus. Babinski sign positive bilaterally (extensor plantar response). Abdominal reflexes absent below T6. Superficial anal reflex present but diminished. Bladder: Distended, palpable suprapubically. Per rectal examination: Anal tone preserved (upper motor neuron bladder). Chest examination: Bilateral scattered crepitations in the upper zones. No lymphadenopathy.",
    "investigations": "X-ray thoracic spine AP and lateral: Destruction of T6 and T7 vertebral bodies with loss of disc space, anterior wedging causing angular kyphosis (gibbus), and a paravertebral fusiform soft tissue shadow (cold abscess) extending from T5 to T8. MRI thoracic spine with gadolinium: Destruction of T6 and T7 vertebral bodies with collapse, large epidural collection (phlegmon/abscess) compressing the spinal cord at T5-T7 level causing significant cord compression and T2 signal changes within the cord (myelopathy), large bilateral paravertebral abscesses extending from T4 to T9 tracking along the psoas sheath. Disc involvement at T6-T7 with paradiscal pattern of destruction. No skip lesions. CT chest: Bilateral upper lobe fibrotic lesions with a small cavity in the right apex (likely old/active pulmonary TB), mediastinal lymphadenopathy. Blood investigations: Hb 8.8 g/dL (anemia of chronic disease), TLC 9,200/mm3, ESR 86 mm/hr, CRP 62 mg/L. Mantoux test: 22 mm induration (strongly positive). Sputum for AFB: Positive for acid-fast bacilli (ZN stain). GeneXpert MTB/RIF (sputum): Mycobacterium tuberculosis detected, Rifampicin resistance not detected. HIV ELISA: Negative. Blood sugar: Normal. Serum albumin: 2.4 g/dL (hypoalbuminemia, malnutrition). CT-guided biopsy of paravertebral abscess: Thick caseous material aspirated; histopathology shows caseating granulomatous inflammation with Langhans giant cells; GeneXpert of aspirate: MTB detected, Rif-sensitive.",
    "diagnosis": "Pott's spine (spinal tuberculosis) at T6-T7 with paravertebral cold abscess, spinal cord compression, and paraplegia (Frankel grade B) with concurrent pulmonary tuberculosis",
    "differentials": ["Spinal tuberculosis (Pott's spine) - most common cause of vertebral destruction with paraplegia in India", "Pyogenic spinal infection (acute onset, severe pain, high fever, staph/strep more common)", "Spinal metastasis (older age, multiple levels, pedicle destruction on X-ray, primary malignancy)", "Spinal lymphoma or multiple myeloma", "Brucellosis of spine (occupational exposure, affects L4-L5 commonly, endemic in some Indian states)"],
    "learning_points": [
      "Pott's spine classically shows paradiscal destruction (infection starts in the anterior vertebral body near the endplate, spreads across the disc to the adjacent vertebra), anterior wedging causing kyphosis (gibbus), and cold abscess formation - this triad is pathognomonic; posterior element involvement is rare (unlike tumors which commonly affect pedicles)",
      "Paraplegia in Pott's spine can be classified as paraplegia of active disease (due to pressure from abscess, caseous tissue, sequestrated disc/bone, inflammatory edema - usually recoverable) or paraplegia of healed disease (due to constriction by fibrous tissue, reactivation, internal salient/transverse ridge - often requires surgery and has poorer prognosis)",
      "Treatment follows the modified 'middle path regimen' combining anti-tubercular therapy (ATT) with appropriate surgical intervention: ATT is mandatory for all cases (RNTCP Category I: 2HRZE + 4HRE, now daily regimen for minimum 12-18 months for spinal TB); surgery is indicated for neurological deficit not responding to ATT, spinal instability, severe kyphosis >40-50 degrees, or large abscess causing cord compression",
      "Surgical options include anterior decompression and fusion (Hong Kong operation/anterior radical debridement by Hodgson and Stock) for anterior disease, posterior stabilization with pedicle screws for instability, or combined anterior-posterior approaches for severe cases; decompression must be directed at the site of maximum compression identified on MRI",
      "Frankel grading of spinal cord injury (important for NEET-PG): Grade A = complete motor and sensory loss, Grade B = sensory preservation only (no useful motor), Grade C = motor present but not useful (power <3/5), Grade D = motor useful (power ≥3/5), Grade E = normal - this patient is Frankel B with preserved sensation only partially",
      "MRI is the gold standard investigation showing extent of vertebral destruction, epidural abscess, cord compression, and signal changes within the cord; GeneXpert of tissue/aspirate provides rapid diagnosis and rifampicin resistance status"
    ],
    "india_context": "India bears the highest burden of tuberculosis globally (approximately 28 lakh cases annually per India TB Report), with spinal TB constituting 50% of all musculoskeletal TB cases. Jharkhand's tribal populations have high TB prevalence due to overcrowding, malnutrition, and poor healthcare access. Spinal TB with paraplegia is still one of the most common causes of non-traumatic paraplegia in India. The RNTCP (now NTEP - National Tuberculosis Elimination Programme) provides free ATT under DOTS strategy with daily fixed-dose combination regimen. Delayed presentation (average 4-6 months in India) due to initial treatment by traditional healers worsens neurological outcomes. The Indian Orthopaedic Association and AO Spine India consensus recommends a minimum of 12-18 months of ATT for spinal TB, longer than the standard 6 months for pulmonary TB. India's goal of TB elimination by 2025 (revised to 2030) under Pradhan Mantri TB Mukt Bharat Abhiyaan requires strengthened screening programs especially in vulnerable tribal communities."
  },
  {
    "id": "ORTHO-008",
    "title": "Steroid-Induced Avascular Necrosis of Bilateral Femoral Heads",
    "specialty": "orthopedics",
    "difficulty": "intermediate",
    "source": "Indian Journal of Orthopaedics - AVN in Indian Population: Etiology and Outcomes",
    "demographics": {"age": 35, "gender": "Male", "location": "Pune, Maharashtra"},
    "chief_complaint": "Progressive pain in both hips for 6 months with increasing difficulty walking, worse on the right side",
    "presentation": "A 35-year-old male IT professional from Pune presents with a 6-month history of progressive bilateral hip pain, worse on the right side. The pain is localized to the groin and anterior thigh, aggravated by weight-bearing and walking, and relieved by rest. He reports a gradually increasing limp and difficulty in activities like climbing stairs, squatting for Indian-style toilet use, and sitting cross-legged. He has a significant history of being treated for nephrotic syndrome 2 years ago, during which he received high-dose oral prednisolone (60 mg/day for 8 weeks, followed by a tapering dose over 6 months). He also admits to regular weekend alcohol consumption (approximately 180-360 mL whisky, 2-3 times per week for 10 years). He is currently not on any corticosteroids.",
    "vital_signs": {"bp": "128/82", "hr": 78, "rr": 16, "temp": 36.8, "spo2": 98},
    "history": "Bilateral hip pain for 6 months, insidious onset, progressive. Right hip more symptomatic than left. Pain is in the groin, radiating to the anterior thigh and occasionally to the knee (referred pain via obturator nerve). Pain is mechanical - worse with weight-bearing, walking, and stair climbing. No pain at rest initially, but now mild rest pain on the right side. Morning stiffness lasting 10-15 minutes. Difficulty squatting (for Indian-style toilet) and sitting cross-legged (for eating on the floor). History of nephrotic syndrome 2 years ago (minimal change disease on renal biopsy) treated with high-dose corticosteroids: prednisolone 60 mg/day for 8 weeks, tapered over next 6 months (cumulative dose approximately 8-10 g). Nephrotic syndrome currently in remission, no relapse. Regular alcohol consumption: 180-360 mL whisky, 2-3 times/week for 10 years. No history of smoking. No history of sickle cell disease, SLE, or other autoimmune conditions. No history of hip trauma, radiation exposure, or decompression sickness. No family history of AVN.",
    "physical_exam": "Well-built male, antalgic gait with Trendelenburg lurch on the right side. Trendelenburg test positive on the right. Right hip: Flexion 90 degrees (normal 120), internal rotation 5 degrees (markedly reduced, normal 40), external rotation 20 degrees (reduced), abduction 25 degrees (reduced). Pain at the extremes of all movements, especially internal rotation (earliest and most sensitive sign of hip pathology). Flexion-internal rotation-adduction (FIRA) test positive with groin pain. Thomas test: 10-degree fixed flexion deformity on the right. Left hip: Flexion 100 degrees, internal rotation 15 degrees (reduced), external rotation 30 degrees. Movements less painful than right. No fixed flexion deformity. True limb length: Equal bilaterally. No distal neurovascular deficit. Knee, ankle, and spine examination: Normal. No signs of active nephrotic syndrome (no edema, no ascites).",
    "investigations": "X-ray pelvis with both hips AP view: Right hip - sclerosis and subtle crescent sign (subchondral collapse) at the anterosuperior aspect of the femoral head, early loss of sphericity, maintained joint space. Left hip - subtle patchy sclerosis in the femoral head, no collapse, spherical head maintained. Ficat and Arlet staging: Right hip Stage III, Left hip Stage II. MRI both hips (coronal T1, T2, STIR, sagittal): Right femoral head - serpiginous low-signal line on T1 (band pattern) surrounding a necrotic segment involving >50% of the weight-bearing surface, subchondral fracture (crescent sign) measuring 4 mm, early loss of femoral head sphericity, mild joint effusion, no acetabular changes. Modified Kerboul angle: 230 degrees (combined necrotic angle on mid-coronal and mid-sagittal MRI, >200 degrees indicates large lesion with poor prognosis for head-preserving surgery). Left femoral head - serpiginous band pattern involving approximately 30% of the weight-bearing surface, no subchondral fracture, femoral head spherical. Kerboul angle: 160 degrees. Steinberg classification based on MRI: Right hip Stage IIIB (crescent sign with mild head flattening), Left hip Stage IIC (large lesion but no collapse). Blood investigations: Hb 14.0 g/dL, CBC normal. Serum creatinine: 0.9 mg/dL, Urine protein/creatinine ratio: 0.1 (remission). Lipid profile: TC 240 mg/dL, TG 210 mg/dL (dyslipidemia - also a risk factor for AVN). Coagulation: Normal. HbA1c: 5.6%. Serum uric acid: 7.2 mg/dL. HIV: Negative.",
    "diagnosis": "Bilateral avascular necrosis (osteonecrosis) of the femoral heads - steroid-induced (with alcohol as a contributing factor). Right hip: Ficat Stage III (pre-collapse/early collapse). Left hip: Ficat Stage II (pre-collapse, no structural failure)",
    "differentials": ["Avascular necrosis of the femoral head (steroid and/or alcohol induced)", "Osteoarthritis of the hip (joint space narrowing, osteophytes, older age group)", "Transient osteoporosis of the hip (self-limiting, bone marrow edema on MRI, typically unilateral)", "Inflammatory arthritis of the hip (RA, ankylosing spondylitis - bilateral but with erosions, elevated inflammatory markers)", "Stress fracture of the femoral neck (acute onset, marrow edema on MRI, no necrotic band)"],
    "learning_points": [
      "Corticosteroids are the most common cause of non-traumatic AVN worldwide; risk increases significantly with cumulative dose >2 g prednisolone equivalent and duration >3 months; the proposed mechanism is fat embolism, intravascular coagulation, and increased intraosseous pressure due to marrow fat hypertrophy leading to ischemia of the femoral head",
      "Ficat and Arlet classification for NEET-PG: Stage I (normal X-ray, MRI positive), Stage II (sclerosis/cystic changes on X-ray, no collapse), Stage III (crescent sign representing subchondral fracture, early head flattening), Stage IV (joint space narrowing, secondary acetabular changes, end-stage osteoarthritis) - treatment depends on the stage",
      "MRI is the gold standard for early diagnosis of AVN (sensitivity >95%); the classic finding is a serpiginous (serpentine/band-like) low-signal line on T1-weighted images representing the reactive interface between necrotic and viable bone; the 'double line sign' on T2 (inner bright line of granulation tissue, outer dark line of sclerotic bone) is pathognomonic",
      "Head-preserving procedures for pre-collapse stages (Ficat I/II): Core decompression (drilling into the necrotic area to reduce intraosseous pressure), core decompression with bone grafting (fibular or iliac crest), vascularized fibular grafting, or osteotomy; for post-collapse (Ficat III/IV) or large lesions: Total Hip Arthroplasty (THA) is the definitive treatment",
      "In Indian patients, AVN often presents bilaterally (40-80% of cases), and the contralateral hip must always be screened with MRI even if asymptomatic; this patient demonstrates the common scenario of bilateral but asymmetric involvement requiring different treatment strategies for each hip"
    ],
    "india_context": "AVN of the femoral head is increasingly recognized in young Indian adults (peak age 30-50 years), with steroids and alcohol being the two most common etiological factors. High-dose corticosteroid use for nephrotic syndrome, SLE, organ transplant, and increasingly post-COVID-19 treatment (mucormycosis protocol) has led to a surge in AVN cases in India, particularly after the COVID-19 pandemic when indiscriminate steroid use was widespread. The Indian practice of squatting for toileting and sitting cross-legged makes hip AVN particularly disabling and patients present earlier than in Western populations. Total hip replacement in young patients poses the challenge of implant longevity; ceramic-on-ceramic or ceramic-on-highly-cross-linked-polyethylene bearings are preferred. Indian-made hip implants have made THA more affordable, with the Government's price capping under NPPA (National Pharmaceutical Pricing Authority) reducing implant costs by 70%. The Indian Arthroplasty Association recommends screening the contralateral hip with MRI in all newly diagnosed AVN cases."
  },
  {
    "id": "ORTHO-009",
    "title": "Anterior Cruciate Ligament (ACL) Tear — Sports Injury",
    "specialty": "orthopedics",
    "difficulty": "intermediate",
    "source": "Indian Journal of Orthopedics",
    "demographics": {"age": 23, "gender": "Male", "location": "Chandigarh, Punjab"},
    "chief_complaint": "Knee gave way during a cricket match, now swollen and unstable",
    "presentation": "A 23-year-old cricket player presents with a history of his right knee 'giving way' while taking a sharp turn during fielding. He heard a 'pop' sound, developed immediate swelling, and was unable to continue playing. He now has persistent knee instability with a feeling that his knee will buckle, especially when changing direction.",
    "vital_signs": {"bp": "120/80", "hr": 76, "rr": 16, "temp": 37.0, "spo2": 99},
    "history": "Injury 1 week ago during cricket — non-contact twisting mechanism while planting right foot and pivoting. Heard/felt a 'pop'. Immediate swelling within 2 hours (hemarthrosis — rapid swelling suggests ACL/meniscal injury). Unable to bear weight initially, now walking with limp. Persistent feeling of instability ('knee gives way'). No locking (would suggest meniscal tear). No prior knee injuries. Active sportsperson (cricket, football).",
    "physical_exam": "Right knee: Moderate effusion. Tenderness along joint line. Range of motion: 10-120° (limited by effusion and pain). Lachman test: Positive (soft endpoint — most sensitive test for ACL tear). Anterior drawer test: Positive. Pivot shift test: Positive (pathognomonic but difficult to perform in acute setting due to guarding). Posterior drawer: Negative (PCL intact). McMurray test: Equivocal. Varus/valgus stress: Stable (collaterals intact). Neurovascular: Intact.",
    "investigations": "X-ray knee (AP/Lateral): No fracture. Segond fracture (lateral tibial avulsion) would be pathognomonic of ACL tear but not present here. MRI knee: Complete ACL tear (high signal replacing normal dark ligament on T2). Medial meniscus: Intact. Lateral meniscus: Small tear at posterior horn. Bone bruising at lateral femoral condyle and posterolateral tibial plateau (kiss lesion — typical of ACL injury mechanism). No PCL/collateral injury.",
    "diagnosis": "Complete anterior cruciate ligament (ACL) tear, right knee, with lateral meniscus tear — sports injury",
    "differentials": ["ACL tear", "Meniscal tear (isolated)", "PCL tear", "Medial collateral ligament tear", "Patellar dislocation", "Tibial plateau fracture"],
    "learning_points": [
      "ACL injury mechanism: Non-contact pivoting, cutting, or landing — 'pop' sound + rapid effusion within 2 hours is classic",
      "Lachman test is the MOST sensitive clinical test for ACL tear (85-95% sensitivity); Pivot shift is most specific",
      "Segond fracture (lateral tibial capsular avulsion on X-ray) is pathognomonic of ACL tear",
      "MRI is gold standard for diagnosis — also evaluates meniscus, cartilage, and other ligaments",
      "Treatment: Young, active patients → ACL reconstruction (hamstring or patellar tendon autograft). Rehabilitation takes 9-12 months",
      "Non-operative for low-demand patients, but ACL-deficient knee has high risk of meniscal and cartilage damage over time"
    ],
    "india_context": "ACL injuries are increasingly common in India with growing participation in cricket, football, and kabaddi. IPL and ISL have raised awareness of sports injuries. Arthroscopic ACL reconstruction is available at most tertiary centers and select district hospitals. Hamstring autograft is most commonly used in India. Physiotherapy and rehabilitation infrastructure is a bottleneck — many patients fail to complete rehabilitation protocols."
  },
  {
    "id": "ORTHO-010",
    "title": "Cervical Spondylotic Myelopathy",
    "specialty": "orthopedics",
    "difficulty": "advanced",
    "source": "Indian Spine Journal",
    "demographics": {"age": 58, "gender": "Male", "location": "Pune, Maharashtra"},
    "chief_complaint": "Progressive difficulty walking and numbness in hands for 6 months",
    "presentation": "A 58-year-old retired government officer presents with progressive difficulty walking (spastic gait), clumsiness of hands (cannot button shirt), numbness in both hands, and neck pain for 6 months. He has developed urinary urgency. Neurological examination reveals upper motor neuron signs in all four limbs. MRI shows cervical cord compression at C4-C6.",
    "vital_signs": {"bp": "140/85", "hr": 76, "rr": 16, "temp": 37.0, "spo2": 98},
    "history": "Progressive difficulty walking for 6 months — feeling of stiffness in legs, unsteady gait, stumbles frequently. Hand clumsiness: Cannot button shirt, difficulty writing (myelopathy hand sign). Numbness and tingling in both hands (C6-C7 dermatome). Neck pain with stiffness. Urinary urgency/frequency for 2 months (early bladder involvement). No bowel symptoms. No trauma. No fever. Progressive course (not acute).",
    "physical_exam": "Gait: Spastic, wide-based, circumduction. Upper limbs: Grip weakness bilateral, wasting of intrinsic hand muscles, finger escape sign positive (unable to hold fingers adducted), Hoffman sign positive bilateral. Lower limbs: Spasticity, hyperreflexia (3+), sustained ankle clonus bilateral, Babinski positive bilateral. Sensory: Diminished in C6-C7 distribution, posterior column signs (impaired joint position sense). Lhermitte sign: Positive (electric shock sensation down spine on neck flexion). Spurling test: Not applicable (radiculopathy test, myelopathy is the issue here).",
    "investigations": "X-ray cervical spine: Osteophytes at C4-C5, C5-C6. Reduced disc space. No instability on flexion-extension views. MRI cervical spine: Multi-level disc bulges at C4-5, C5-6 with osteophytic bars causing significant cord compression. Cord signal change (high signal on T2 at C5 level — myelomalacia, poor prognostic sign). AP canal diameter <10mm (severe stenosis, normal >13mm). EMG/NCV: To differentiate from peripheral neuropathy — shows upper motor neuron pattern. Vitamin B12: 350 pg/mL (normal — rules out subacute combined degeneration). MRI brain: Normal (rules out MS, intracranial pathology).",
    "diagnosis": "Cervical spondylotic myelopathy (CSM) — multi-level cord compression at C4-C6 with myelomalacia",
    "differentials": ["Cervical spondylotic myelopathy", "Multiple sclerosis", "Motor neuron disease (ALS)", "Subacute combined degeneration (B12 deficiency)", "Spinal cord tumor (intramedullary)", "Syringomyelia"],
    "learning_points": [
      "CSM is the most common cause of spinal cord dysfunction in adults >55 years",
      "Myelopathy hand signs: Grip-release test (<20 in 10 seconds is abnormal), finger escape sign, inability to button shirt",
      "Lhermitte sign (electric shock on neck flexion) indicates posterior column involvement — seen in CSM, MS, B12 deficiency",
      "T2 high signal in cord (myelomalacia) on MRI indicates poor prognosis — surgical outcomes worse if present",
      "Treatment: Mild myelopathy may be observed; moderate-severe = SURGERY (anterior cervical discectomy and fusion [ACDF] or posterior laminoplasty/laminectomy-fusion)",
      "CSM is PROGRESSIVE — unlike radiculopathy, myelopathy rarely improves spontaneously and worsens without intervention"
    ],
    "india_context": "Cervical spondylosis is extremely common in India with aging population and increasing desk work. Myelopathy is often diagnosed late as patients attribute symptoms to 'aging' or 'arthritis'. Many patients first consult traditional practitioners or undergo physiotherapy for months before neurological consultation. ACDF and laminoplasty are widely available at tertiary spine centers. Indian Spine Surgery Society recommends early referral when myelopathic signs are detected."
  }
]