[
  {
    "id": "PED-001",
    "title": "Acute Viral Bronchiolitis in Infant (RSV)",
    "specialty": "pediatrics",
    "difficulty": "beginner",
    "source": "IAP Guidelines on Management of Bronchiolitis, Indian Pediatrics 2021",
    "demographics": {"age": 5, "gender": "Male", "location": "Lucknow, Uttar Pradesh"},
    "chief_complaint": "Rapid breathing, nasal flaring, and poor feeding for 2 days",
    "presentation": "A 5-month-old male infant is brought to the pediatric emergency of a tertiary care hospital in Lucknow in January with a 2-day history of rapid breathing, nasal flaring, and refusal to breastfeed. The mother reports that the child had a runny nose and mild cough for 3 days before the breathing difficulty started. An older sibling aged 4 years had an upper respiratory infection one week ago. The infant was born at full term via normal vaginal delivery with a birth weight of 2.8 kg and is exclusively breastfed. Immunization is up to date per the IAP schedule.",
    "vital_signs": {"bp": "70/45", "hr": 168, "rr": 68, "temp": 38.2, "spo2": 89},
    "history": "Born full term (39 weeks), birth weight 2.8 kg, cried immediately. No NICU stay. Exclusively breastfed. Immunization up to date as per IAP schedule (BCG, OPV, IPV, Pentavalent, Rotavirus, PCV given). No prior hospitalizations. No history of recurrent wheezing or atopy. Elder sibling (4 years) had URTI 1 week ago. Lives in a two-room house with 6 family members. Father is a daily wage laborer who smokes bidis inside the house. No family history of asthma or atopy. Winter season (January) in Lucknow with ambient temperatures around 8-10 degrees Celsius.",
    "physical_exam": "Irritable, tachypneic infant with visible subcostal and intercostal retractions. Nasal flaring present. Anterior fontanelle normotensive. No cyanosis at rest but desaturates to 85% on crying. Head bobbing present. Auscultation: Widespread bilateral fine inspiratory crackles and expiratory wheeze. Air entry reduced in both lower zones. Liver palpable 2 cm below costal margin (likely due to hyperinflation pushing diaphragm down). No cardiac murmur. CRT 2 seconds. Mild dehydration (slightly dry mucous membranes, reduced urine output per mother). Weight: 6.2 kg (between 15th and 50th centile).",
    "investigations": "SpO2: 89% on room air, improving to 95% on 2 L/min O2 by nasal prongs. CXR: Hyperinflated lungs, bilateral perihilar infiltrates, patchy atelectasis in right middle lobe, flattened diaphragm. No consolidation or pleural effusion. CBC: Hb 10.8 g/dL, TLC 9,200/mm3 (Lymphocyte predominant 68%), Platelets 2.4 lakh. CRP: 4 mg/L (mildly elevated). RSV rapid antigen test (nasopharyngeal aspirate): Positive. Blood gas (capillary): pH 7.34, pCO2 48 mmHg, HCO3 22 mEq/L (mild respiratory acidosis). Blood culture: Sent (no growth at 48 hours). Serum electrolytes: Na 137, K 4.2 mEq/L.",
    "diagnosis": "Acute RSV bronchiolitis with hypoxemia and mild respiratory acidosis",
    "differentials": ["RSV bronchiolitis", "Infantile asthma / recurrent wheezing", "Viral pneumonia (Influenza, Parainfluenza, Adenovirus)", "Pertussis (whooping cough)", "Congestive heart failure secondary to undiagnosed congenital heart disease"],
    "learning_points": [
      "RSV is the most common cause of bronchiolitis in infants under 2 years; peak incidence in India is during the winter and rainy seasons",
      "Management is primarily supportive: oxygen supplementation to maintain SpO2 >92%, nasal suctioning, adequate hydration (nasogastric feeds or IV fluids if unable to feed), and minimal handling",
      "IAP guidelines recommend AGAINST routine use of bronchodilators, corticosteroids, antibiotics, or nebulized hypertonic saline in bronchiolitis as evidence of benefit is lacking",
      "Risk factors for severe bronchiolitis include age <3 months, prematurity, passive smoking exposure, overcrowding, hemodynamically significant congenital heart disease, and immunodeficiency",
      "Palivizumab (anti-RSV monoclonal antibody) prophylaxis is recommended by IAP for high-risk infants (preterm <29 weeks, BPD, hemodynamically significant CHD) but is expensive and not widely available in India",
      "Hepatomegaly in bronchiolitis is often spurious due to lung hyperinflation pushing the diaphragm and liver downward, and must be differentiated from true hepatomegaly due to heart failure"
    ],
    "india_context": "Bronchiolitis is one of the leading causes of hospitalization in Indian infants, especially during winter months in North India and during the monsoon season in South India. Passive smoking from bidis and overcrowded living conditions significantly increase risk. IAP recommends supportive management and discourages routine use of bronchodilators and steroids. Access to pulse oximetry and humidified oxygen in peripheral health centers remains a challenge. RSV vaccination for maternal immunization is being evaluated for inclusion in India's National Immunization Schedule."
  },
  {
    "id": "PED-002",
    "title": "Tetralogy of Fallot with Hypercyanotic (Tet) Spell",
    "specialty": "pediatrics",
    "difficulty": "advanced",
    "source": "IAP Textbook of Pediatric Cardiology, Annals of Pediatric Cardiology",
    "demographics": {"age": 8, "gender": "Male", "location": "Patna, Bihar"},
    "chief_complaint": "Sudden bluish discoloration of lips and nails with excessive crying, lasting 15 minutes",
    "presentation": "An 8-month-old male infant is rushed to the pediatric emergency in Patna after an episode of sudden deep cyanosis, inconsolable crying, and limpness lasting approximately 15 minutes. The mother reports the episode started after the child had a bout of prolonged crying following a bath. She instinctively held the child against her chest with his knees folded, after which the episode gradually resolved. She reports that the child has been 'blue around the lips' since about 3 months of age and frequently becomes more blue after crying or during feeding. The child was born at home via a traditional birth attendant and has never been evaluated by a doctor. The family belongs to a low socioeconomic group and has migrated to Patna from a rural block in Gaya district.",
    "vital_signs": {"bp": "78/50", "hr": 180, "rr": 52, "temp": 37.0, "spo2": 62},
    "history": "Born at home, attended by a dai (traditional birth attendant). Birth weight reportedly normal per mother. Cried immediately. No postnatal evaluation or newborn screening. Cyanosis first noticed by mother at 3 months of age when child turned blue during crying and feeding. Progressive cyanosis noted over subsequent months. Mother reports squatting-like posture assumed by child when placed upright (knees drawn to chest). Poor weight gain despite breastfeeding. Not yet started complementary feeds. No immunization received. Two prior episodes of increased blueness with crying, each lasting 5-10 minutes, which resolved spontaneously. No history of fever, seizure, or loss of consciousness during these episodes. Family history: consanguineous marriage (parents are first cousins). No known family history of congenital heart disease.",
    "physical_exam": "Small for age, weight 5.8 kg (<3rd centile), length 65 cm (<3rd centile). Central cyanosis with clubbing of fingers and toes. SpO2 62% on room air at presentation (during spell), improving to 75% after knee-chest position and oxygen. Active precordium with right ventricular heave. Auscultation: Single loud S2 (absent P2 component). Grade 3/6 ejection systolic murmur (ESM) at left upper sternal border (LUSB) due to RVOT obstruction. Note: murmur becomes softer during hypercyanotic spell (increased right-to-left shunt, less flow across RVOT). No hepatomegaly. Normal bowel sounds. Anterior fontanelle open, normotensive. No dysmorphic features.",
    "investigations": "SpO2: 62% during spell, 75% after resolution on room air. ECG: Right axis deviation, right atrial enlargement (peaked P waves in lead II), right ventricular hypertrophy (tall R in V1, deep S in V6), upright T wave in V1. CXR: Boot-shaped heart (coeur en sabot) due to RVH and concavity in the region of main pulmonary artery, oligemic lung fields (decreased pulmonary vascular markings), right-sided aortic arch present. 2D Echocardiography: Large malalignment VSD (subaortic, 12 mm), overriding of aorta (~50%), severe infundibular and valvular pulmonary stenosis (peak gradient 85 mmHg), right ventricular hypertrophy. Confluent branch pulmonary arteries (McGoon ratio 1.8). No PDA. CBC: Hb 18.2 g/dL (polycythemia secondary to chronic hypoxia), Hct 58%, TLC 11,400, Platelets 1.9 lakh. ABG: pH 7.28, pCO2 32, pO2 38, HCO3 16 (metabolic acidosis during spell).",
    "diagnosis": "Tetralogy of Fallot with hypercyanotic (tet) spell",
    "differentials": ["Tetralogy of Fallot", "Transposition of great arteries (TGA)", "Tricuspid atresia", "Total anomalous pulmonary venous connection (TAPVC)", "Double outlet right ventricle (DORV) with pulmonary stenosis"],
    "learning_points": [
      "Tetralogy of Fallot is the most common cyanotic congenital heart disease (CHD) beyond infancy; its four components are VSD, overriding aorta, RVOT obstruction (infundibular +/- valvular PS), and RVH",
      "Hypercyanotic (tet) spells occur due to dynamic infundibular spasm leading to increased right-to-left shunt; triggers include crying, feeding, defecation, and dehydration",
      "Emergency management of tet spell: knee-chest position (increases SVR), oxygen, IV morphine (0.1 mg/kg), IV fluids (volume bolus), IV phenylephrine (alpha-agonist to increase SVR), IV propranolol (reduces infundibular spasm), correct acidosis with sodium bicarbonate",
      "The ejection systolic murmur in TOF becomes SOFTER during a tet spell because less blood flows across the obstructed RVOT - this is a classic NEET-PG question",
      "Boot-shaped heart on CXR, right aortic arch (25% of TOF cases), and oligemic lung fields are classic radiological findings",
      "Definitive treatment is intracardiac repair (ICR) ideally between 3-6 months; a modified Blalock-Taussig (BT) shunt is a palliative procedure for infants with unfavorable anatomy or low weight"
    ],
    "india_context": "Congenital heart disease affects approximately 9 per 1000 live births in India, yet detection rates remain low due to the absence of universal pulse oximetry screening in newborns. Many cases, especially in rural Bihar and other underserved states, present late with complications. Consanguinity increases the risk of CHD. The Rashtriya Bal Swasthya Karyakram (RBSK) under NHM aims to screen for CHD at birth and in early childhood. Surgical treatment under Ayushman Bharat PM-JAY provides coverage of up to Rs 1.5 lakh for cardiac surgery, but long waiting lists and limited pediatric cardiac surgery centers (concentrated in metros) remain barriers to timely intervention."
  },
  {
    "id": "PED-003",
    "title": "Kawasaki Disease with Coronary Artery Aneurysm",
    "specialty": "pediatrics",
    "difficulty": "advanced",
    "source": "IAP Guidelines on Kawasaki Disease, Indian Journal of Pediatrics",
    "demographics": {"age": 3, "gender": "Male", "location": "Mumbai, Maharashtra"},
    "chief_complaint": "High fever for 7 days not responding to antibiotics, red eyes, rash, and peeling of fingertips",
    "presentation": "A 3-year-old boy is brought to a pediatric referral center in Mumbai with persistent high-grade fever for 7 days, bilateral redness of eyes without discharge for 5 days, a polymorphous rash over the trunk for 4 days, redness and swelling of both hands and feet for 3 days, and cracked red lips with a strawberry tongue for 3 days. He was initially treated at a local clinic with oral amoxicillin and then injectable ceftriaxone for suspected bacterial infection, but the fever has persisted at 39-40 degrees Celsius throughout. The mother also reports extreme irritability, decreased appetite, and peeling of skin around the fingertips that started today (day 7).",
    "vital_signs": {"bp": "85/55", "hr": 148, "rr": 32, "temp": 39.6, "spo2": 98},
    "history": "Previously healthy child. Developmentally normal. Immunization complete per IAP schedule including MMR. No recent travel. No known sick contacts. No prior significant illness. Fever onset 7 days ago, high grade (39-40 degrees C), continuous, with partial and transient response to paracetamol. Bilateral non-purulent conjunctival injection on day 2. Polymorphous erythematous maculopapular rash on trunk and extremities on day 3. Red, swollen hands and feet on day 4. Cracked, erythematous lips and strawberry tongue on day 4. Extreme irritability and refusal to walk (possibly arthralgia). Decreased oral intake. One episode of non-bilious vomiting. Periungual desquamation of fingers noted today (day 7). Treated with oral amoxicillin (days 1-3) and IV ceftriaxone (days 4-6) without improvement. No family history of Kawasaki disease or autoimmune conditions.",
    "physical_exam": "Irritable, febrile child. Bilateral non-purulent bulbar conjunctival injection (limbal sparing). Erythematous, cracked, fissured lips. Strawberry tongue (prominent fungiform papillae). Polymorphous maculopapular rash over trunk, perineal region (with early desquamation in perineum). Erythema and indurated edema of dorsum of hands and feet. Periungual desquamation of fingers bilaterally. Unilateral non-purulent cervical lymphadenopathy on the right side (single node approximately 1.8 cm, firm, tender). BCG scar erythema and induration noted. No cardiac murmur. No hepatosplenomegaly. Mild irritability of knee and ankle joints with reluctance to bear weight.",
    "investigations": "CBC: Hb 10.4 g/dL, TLC 18,600/mm3 (Neutrophil predominant 78%), Platelets 5.8 lakh (thrombocytosis, characteristic of second week of illness). ESR: 88 mm/hr. CRP: 142 mg/L (markedly elevated). LFT: Albumin 2.8 g/dL (hypoalbuminemia), AST 68 U/L, ALT 82 U/L (mildly elevated), GGT 120 U/L (elevated). Urinalysis: Sterile pyuria (WBC 25/hpf, culture negative). Blood culture: No growth at 48 hours. 2D Echocardiography: Left main coronary artery (LMCA) dilated at 4.2 mm (z-score +3.8), Left anterior descending (LAD) shows fusiform aneurysm 5.0 mm (z-score +4.5), Right coronary artery (RCA) mildly dilated 3.0 mm (z-score +2.8). Mild pericardial effusion. LV function normal (EF 62%). No valvular regurgitation.",
    "diagnosis": "Complete Kawasaki disease (day 7) complicated by coronary artery aneurysm (medium aneurysm of LAD)",
    "differentials": ["Kawasaki disease", "Scarlet fever (Group A Streptococcus)", "Measles", "Systemic-onset juvenile idiopathic arthritis (SoJIA)", "Drug hypersensitivity reaction (Stevens-Johnson syndrome)"],
    "learning_points": [
      "Kawasaki disease diagnosis requires fever >=5 days PLUS 4 of 5 clinical criteria: bilateral non-purulent conjunctivitis, oral mucosal changes, extremity changes, polymorphous rash, and cervical lymphadenopathy (>=1.5 cm, usually unilateral); incomplete KD can be diagnosed with fewer criteria if echocardiography is suggestive",
      "Coronary artery aneurysms develop in 25% of untreated cases and in <5% of cases treated with IVIG within the first 10 days of illness; coronary artery z-score >2.5 is considered dilated",
      "Standard treatment is high-dose IVIG (2 g/kg single infusion over 10-12 hours) plus high-dose aspirin (80-100 mg/kg/day in 4 divided doses until afebrile for 48-72 hours, then low-dose aspirin 3-5 mg/kg/day for 6-8 weeks or longer if coronary abnormalities persist)",
      "BCG scar reactivation (erythema and induration) is a highly specific clinical sign for Kawasaki disease in BCG-vaccinated populations and is especially useful in India where BCG vaccination is universal",
      "IVIG-resistant KD (fever persisting >36 hours after first IVIG) occurs in 10-20% of cases; second-line options include repeat IVIG, IV methylprednisolone, or infliximab",
      "Long-term follow-up with serial echocardiography is essential; giant aneurysms (>=8 mm or z-score >=10) carry the highest risk of thrombosis and myocardial infarction"
    ],
    "india_context": "Kawasaki disease is increasingly recognized in India, though it remains underdiagnosed, particularly in smaller cities and rural areas where it is often mistaken for viral exanthems, measles, or drug reactions. The incidence in India is estimated at 5-10 per 100,000 children under 5, lower than Japan (>300/100,000) but likely underreported. BCG scar reactivation is a valuable diagnostic clue in Indian children as BCG is given at birth under the Universal Immunization Programme. Cost of IVIG (approximately Rs 20,000-30,000 per vial, 8-10 vials needed for a child) is a major barrier. IAP recommends early echocardiography in all suspected cases and IVIG within the first 10 days to prevent coronary complications."
  },
  {
    "id": "PED-004",
    "title": "Severe Acute Malnutrition - Kwashiorkor",
    "specialty": "pediatrics",
    "difficulty": "intermediate",
    "source": "NNF-IAP Guidelines on Facility-Based Management of SAM, WHO Protocol",
    "demographics": {"age": 2, "gender": "Female", "location": "Jashpur, Chhattisgarh"},
    "chief_complaint": "Generalized body swelling, irritability, and skin changes for 3 weeks",
    "presentation": "A 2-year-old girl is brought by her mother to the Nutritional Rehabilitation Centre (NRC) at a district hospital in Jashpur, Chhattisgarh, with generalized swelling of the body for 3 weeks, progressive irritability, loss of appetite, and skin peeling over the legs. The mother reports that the child was breastfed until 8 months but was abruptly weaned when the mother became pregnant again. Since then, the child has been fed primarily rice water, diluted dal, and occasional biscuits. The family is from a tribal (Adivasi) community and relies on subsistence farming. The mother is currently 7 months pregnant with her fourth child.",
    "vital_signs": {"bp": "72/48", "hr": 130, "rr": 30, "temp": 35.8, "spo2": 96},
    "history": "Born at home, birth weight unknown. Breastfed until 8 months, then abruptly weaned due to mother's next pregnancy. Complementary feeding primarily rice water and diluted dal since 8 months. Family practices prolonged food taboos during and after illness. Two episodes of watery diarrhea in the past month, each lasting 3-4 days, treated at home with ORS. History of measles at 14 months of age (not vaccinated). Incomplete immunization: only BCG and OPV-0 received at a sub-center visit. Three older siblings, one of whom died at 18 months (reportedly due to diarrhea and malnutrition). Father is a marginal farmer, monthly income approximately Rs 3,000. Family does not have a ration card for PDS (Public Distribution System).",
    "physical_exam": "Apathetic, miserable-looking child with moon facies. Weight: 7.2 kg (expected weight for age ~12 kg; weight-for-height z-score < -3 SD). Length: 78 cm. MUAC: 10.8 cm (<11.5 cm = SAM). Bilateral pitting pedal edema extending to the pretibial region and dorsum of hands (Grade ++ edema). Sparse, thin, easily pluckable hair with flag sign (alternating bands of light and dark color). Skin: Flaky paint dermatosis over both legs and buttocks with areas of hyperpigmentation, desquamation, and raw weeping areas (resembling a paint surface peeling off). Angular stomatitis. Pale conjunctivae. No corneal xerosis or Bitot spots. Abdomen: Distended with hepatomegaly (liver 4 cm below costal margin, smooth, non-tender, fatty liver). No ascites. No dehydration signs currently. Muscle wasting evident in limbs and buttocks. Hypothermic (axillary temp 35.8 degrees C).",
    "investigations": "CBC: Hb 7.2 g/dL (moderate anemia, dimorphic picture), TLC 14,500 (possible occult infection), Platelets 1.8 lakh. Peripheral smear: Dimorphic anemia (microcytic and macrocytic cells), anisopoikilocytosis. Serum albumin: 1.6 g/dL (severely low, normal >3.5). RBS: 42 mg/dL (hypoglycemia). Serum electrolytes: Na 128 mEq/L (dilutional hyponatremia), K 2.8 mEq/L (hypokalemia), Mg 1.2 mg/dL (low). Serum calcium: 7.2 mg/dL (low). Urine: No albumin. Stool: No ova or cysts. HIV rapid test: Negative. Mantoux test: Non-reactive (anergy due to immunosuppression from malnutrition). Chest X-ray: No consolidation or lymphadenopathy.",
    "diagnosis": "Severe Acute Malnutrition - Kwashiorkor (edematous malnutrition) with hypoglycemia, hypothermia, hypokalemia, and dimorphic anemia",
    "differentials": ["Kwashiorkor (edematous SAM)", "Nephrotic syndrome (edema with hypoalbuminemia)", "Congestive heart failure", "Chronic liver disease with portal hypertension", "Celiac disease with secondary malnutrition"],
    "learning_points": [
      "Kwashiorkor is characterized by bilateral pitting edema, flaky paint dermatosis, flag sign of hair, hepatomegaly (fatty liver), moon facies, apathy, and severe hypoalbuminemia; it occurs due to predominantly protein-deficient diet with relatively adequate caloric intake",
      "WHO 10-step protocol for facility-based management of SAM: treat/prevent hypoglycemia, hypothermia, dehydration (use ReSoMal, NOT standard ORS), correct electrolyte imbalance, treat infections, correct micronutrient deficiencies, start cautious feeding (F-75), achieve catch-up growth (F-100), provide sensory stimulation, and prepare for follow-up",
      "Refeeding syndrome is a life-threatening complication of aggressive caloric supplementation in malnourished children; it causes hypophosphatemia, hypokalemia, hypomagnesemia, and fluid overload - hence start with low-calorie F-75 formula (75 kcal/100ml) before transitioning to energy-dense F-100 (100 kcal/100ml)",
      "MUAC <11.5 cm in children 6-59 months is used for community-based screening for SAM; bilateral pitting edema automatically classifies as SAM irrespective of weight-for-height z-score",
      "Severely malnourished children are immunosuppressed and may not mount fever or positive Mantoux reaction even with active TB or sepsis; always start empirical broad-spectrum antibiotics (IAP recommends ampicillin + gentamicin) as per WHO protocol"
    ],
    "india_context": "India accounts for the highest burden of child malnutrition globally; NFHS-5 (2019-21) data shows 35.5% of children under 5 are stunted and 19.3% are wasted. Tribal districts in Chhattisgarh, Jharkhand, and Madhya Pradesh have the highest SAM prevalence. Nutritional Rehabilitation Centres (NRCs) have been established under the National Health Mission for facility-based management of SAM. ICDS (Integrated Child Development Services) through Anganwadi centers provides supplementary nutrition, growth monitoring, and nutrition education. Community-based Management of Acute Malnutrition (CMAM) using ready-to-use therapeutic food (RUTF) is being scaled up. The National Food Security Act and PDS entitlements are crucial for food-insecure families, but gaps in coverage persist, particularly among tribal communities."
  },
  {
    "id": "PED-005",
    "title": "Neonatal Jaundice with Kernicterus Risk",
    "specialty": "pediatrics",
    "difficulty": "intermediate",
    "source": "NNF Clinical Practice Guidelines on Neonatal Hyperbilirubinemia 2022",
    "demographics": {"age": 0, "gender": "Male", "location": "Jodhpur, Rajasthan"},
    "chief_complaint": "Deep yellow discoloration of skin since day 2 of life, poor feeding and lethargy since day 4",
    "presentation": "A 5-day-old male neonate is brought to the SNCU (Special Newborn Care Unit) of a district hospital in Jodhpur with deep yellow discoloration of the skin extending to the palms and soles, poor feeding, and increasing lethargy. The baby was born at home via normal delivery attended by a traditional birth attendant. Birth weight was 2.6 kg. The mother reports that yellow discoloration of the eyes and face was first noticed on day 2 of life and has progressively deepened. The baby was exclusively breastfed initially but has been refusing feeds since day 4 with increasing sleepiness. The mother's blood group is O positive. This is her third child; her second child also had severe jaundice at birth and reportedly died at 7 days of life at home (no medical evaluation was done).",
    "vital_signs": {"bp": "58/35", "hr": 160, "rr": 48, "temp": 36.2, "spo2": 95},
    "history": "Born at home, full term per dates, cried immediately. Birth weight 2.6 kg. No complications during delivery per mother. Yellow discoloration noticed on day 2, progressive deepening. Initially breastfed well but feeds have become poor since day 4. Increasing lethargy and sleepiness. Mother noticed high-pitched cry episodes since day 4 evening. Mother's blood group O positive, father's blood group B positive. Second child reportedly died at 7 days of life with severe jaundice (no medical records). First child (5 years) is healthy. No consanguinity. No G6PD deficiency known in family. Mother did not receive antenatal anti-D (Rh not relevant here as mother is Rh positive). No medications given to baby. No sepsis risk factors except home delivery.",
    "physical_exam": "Lethargic neonate with deep yellow discoloration of skin extending to palms and soles (Kramer zone V). Weight 2.4 kg (weight loss of 7.7% from birth weight). Anterior fontanelle open, soft. Eyes: Icteric sclerae, no sunset sign. High-pitched cry on stimulation. Mild hypertonia of upper and lower limbs. Intermittent opisthotonos (arching of the back) on handling. Incomplete Moro reflex. Absent sucking reflex. Liver palpable 1 cm below costal margin. Spleen not palpable. No cephalhematoma. No bruising. Umbilical stump clean, no signs of omphalitis.",
    "investigations": "Total serum bilirubin (TSB): 32.4 mg/dL (severely elevated; exchange transfusion threshold for a term neonate at 5 days is approximately 25 mg/dL per NNF chart). Direct bilirubin: 1.2 mg/dL (predominantly unconjugated). Baby's blood group: B positive. Mother's blood group: O positive. Direct Coombs test (DCT): Positive (3+). Reticulocyte count: 8.2% (elevated, indicating hemolysis). CBC: Hb 12.8 g/dL (low normal for a neonate, suggestive of hemolysis), TLC 12,400, Platelets 2.2 lakh. Peripheral smear: Spherocytes and polychromasia. G6PD assay: Normal. Serum albumin: 2.8 g/dL. CRP: 2 mg/L (not suggestive of sepsis). Blood culture: Sent. Transcutaneous bilirubin: Not reliable at this level; TSB was used for clinical decision-making.",
    "diagnosis": "Severe neonatal unconjugated hyperbilirubinemia due to ABO hemolytic disease (mother O, baby B) with impending acute bilirubin encephalopathy (early kernicterus)",
    "differentials": ["ABO hemolytic disease of the newborn", "Rh hemolytic disease", "G6PD deficiency", "Hereditary spherocytosis", "Neonatal sepsis with jaundice"],
    "learning_points": [
      "ABO incompatibility (mother O, baby A or B) is the most common cause of hemolytic disease of the newborn in India; unlike Rh disease, it can affect the first pregnancy and DCT may be weakly positive or negative",
      "NNF guidelines use gestational age-specific hour-specific nomograms (modified Bhutani nomogram) for phototherapy and exchange transfusion thresholds; TSB >25 mg/dL in a term neonate warrants immediate exchange transfusion",
      "Signs of acute bilirubin encephalopathy (ABE) include lethargy, poor feeding, high-pitched cry, hypertonia, opisthotonos, and absent primitive reflexes; this progresses to chronic bilirubin encephalopathy (kernicterus) with cerebral palsy (athetoid), sensorineural hearing loss, upward gaze palsy, and dental enamel dysplasia",
      "Double volume exchange transfusion (DVET) replaces approximately 85% of circulating RBCs, removes bilirubin and offending antibodies; volume = 2 x 80 ml/kg = 160 ml/kg using reconstituted blood (O negative packed RBCs + AB plasma)",
      "Intensive phototherapy (irradiance >=30 microW/cm2/nm using LED devices) should be started immediately while arranging exchange transfusion; placing the baby on a bilirubin blanket below with overhead phototherapy above (tandem/double phototherapy) maximizes efficacy",
      "Risk factors for severe hyperbilirubinemia in Indian neonates include ABO/Rh incompatibility, G6PD deficiency (common in certain communities), home delivery without postnatal bilirubin monitoring, delayed initiation of breastfeeding, and sepsis"
    ],
    "india_context": "Severe neonatal jaundice remains a significant cause of neonatal morbidity and mortality in India, with an estimated 25,000-30,000 cases of kernicterus annually, predominantly due to delayed recognition and treatment. Home deliveries (still 10-20% in states like Rajasthan, Bihar, UP) without postnatal follow-up are a major risk factor. NNF recommends visual assessment of jaundice within 24 hours of birth, TSB estimation when clinical jaundice extends below the umbilicus, and predischarge bilirubin screening. Under Janani Shishu Suraksha Karyakram (JSSK), free treatment including phototherapy and exchange transfusion is available at government facilities. SNCUs and NBSUs established under NHM have improved access to phototherapy in district hospitals, but availability of blood products for exchange transfusion remains a challenge in peripheral centers."
  },
  {
    "id": "PED-006",
    "title": "Febrile Seizure - Simple vs Complex Differentiation",
    "specialty": "pediatrics",
    "difficulty": "beginner",
    "source": "IAP Standard Treatment Guidelines on Febrile Seizures, Indian Pediatrics",
    "demographics": {"age": 1, "gender": "Female", "location": "Coimbatore, Tamil Nadu"},
    "chief_complaint": "Episode of jerky movements of all four limbs with eyes rolling up during high fever, lasting 3 minutes",
    "presentation": "An 18-month-old girl is brought to the pediatric emergency of a government hospital in Coimbatore by her parents after an episode of generalized tonic-clonic jerky movements of all four limbs with upward rolling of eyes, cyanosis of lips, and loss of consciousness lasting approximately 3 minutes. The episode occurred at home about 30 minutes ago. The mother reports that the child had fever (measured at 103 degrees F at home) for 6 hours before the episode, along with a runny nose and mild cough. The seizure resolved spontaneously. The child was drowsy for approximately 10 minutes after the episode but is now alert and recognizing her parents. There was no recurrence of the seizure. This is the first seizure episode in the child's life.",
    "vital_signs": {"bp": "90/55", "hr": 140, "rr": 30, "temp": 39.4, "spo2": 98},
    "history": "Born at term, normal vaginal delivery at government hospital. Birth weight 3.0 kg. APGAR 8/9. Developmental milestones normal: sitting at 7 months, walking at 13 months, speaking 8-10 words at 18 months. Immunization up to date per UIP and IAP schedule. No previous seizure episodes. No history of head trauma. No history of CNS infection (no neck stiffness, no bulging fontanelle, no persistent vomiting). No family history of epilepsy. Mother's younger brother had febrile seizures in childhood. Current febrile illness: runny nose and cough for 1 day, fever since 6 hours, no ear pain, no rash, no diarrhea. Seizure semiology: Generalized tonic-clonic, bilateral symmetric, duration approximately 3 minutes (timed by father on phone), single episode, self-terminating, postictal drowsiness for 10 minutes, now alert.",
    "physical_exam": "Alert, active, recognizing parents, playful now. Febrile (39.4 degrees C). No meningeal signs: neck supple, Kernig and Brudzinski negative. Anterior fontanelle closed. No bulging of fontanelle. Pupils equal and reactive. No focal neurological deficit. Tone normal in all four limbs. Deep tendon reflexes symmetrical and normal. Plantar response: flexor bilaterally. ENT: Bilateral tympanic membranes normal, mild pharyngeal congestion, rhinorrhea. Chest: Bilateral equal air entry, no adventitious sounds. Cardiovascular: Normal heart sounds, no murmur. Abdomen: Soft, no hepatosplenomegaly. No rash. No neurocutaneous markers.",
    "investigations": "Temperature: 39.4 degrees C. RBS: 86 mg/dL (normal). Serum electrolytes: Na 138, K 4.0, Ca 9.4, Mg 2.0 mEq/L (all normal). CBC: Hb 11.2 g/dL, TLC 10,800 (Lymphocyte predominant), Platelets 2.8 lakh. CRP: 5 mg/L (mildly elevated, consistent with viral infection). Urinalysis: Normal. No lumbar puncture performed (child >18 months with no meningeal signs; IAP guidelines state LP is not routinely indicated in simple febrile seizures in children >12-18 months with no meningeal signs). EEG: Not performed (not recommended in simple febrile seizures as per IAP). Neuroimaging: Not indicated.",
    "diagnosis": "Simple febrile seizure in the setting of a viral upper respiratory tract infection",
    "differentials": ["Simple febrile seizure", "Complex febrile seizure", "Meningitis / encephalitis", "Epilepsy with first seizure triggered by fever", "Electrolyte disturbance (hypoglycemia, hypocalcemia, hyponatremia)"],
    "learning_points": [
      "Simple febrile seizure: Generalized, duration <15 minutes, single episode in 24 hours, age 6 months to 5 years, no focal features, no postictal neurological deficit, normal development; Complex febrile seizure: Focal onset, duration >15 minutes, recurrence within 24 hours, or postictal Todd's paresis",
      "IAP guidelines: No routine blood investigations, EEG, or neuroimaging are recommended for simple febrile seizures; lumbar puncture is indicated only when meningeal signs are present or in infants <12 months where meningeal signs may be unreliable",
      "Recurrence risk of febrile seizures is approximately 30% overall; risk factors for recurrence include age <18 months at first seizure, family history of febrile seizures, low-grade fever at onset, and short duration of fever before seizure",
      "Neither continuous antipyretic prophylaxis nor intermittent oral diazepam prophylaxis is routinely recommended by IAP for simple febrile seizures; parental counseling and reassurance are the mainstay of management",
      "Risk of developing epilepsy after simple febrile seizures is only 1-2% (similar to general population risk), compared to 4-6% after complex febrile seizures",
      "Emergency management of ongoing seizure: secure airway, administer oxygen, and give IV lorazepam (0.1 mg/kg) or rectal/intranasal midazolam (0.2 mg/kg) as first-line; follow IAP status epilepticus protocol if seizure persists"
    ],
    "india_context": "Febrile seizures are one of the most common pediatric emergencies in India, affecting 2-5% of children. Many parents in India associate seizures with evil spirits or supernatural causes, leading to inappropriate traditional remedies (applying kajal, inserting objects in the mouth, visiting faith healers) before seeking medical help. IAP emphasizes parental counseling as the cornerstone of management: explaining the benign nature, first-aid measures (lateral recovery position, not restraining the child, not putting anything in the mouth), and when to seek emergency care. Universal Immunization Programme vaccines (DPT, measles) may rarely trigger febrile seizures through vaccine-related fever but this is NOT a contraindication to continued vaccination, as IAP strongly endorses continued immunization."
  },
  {
    "id": "PED-007",
    "title": "Childhood Acute Lymphoblastic Leukemia (ALL) Presenting with Pancytopenia",
    "specialty": "pediatrics",
    "difficulty": "advanced",
    "source": "IAP Pediatric Oncology Guidelines, Indian Journal of Medical and Paediatric Oncology",
    "demographics": {"age": 5, "gender": "Male", "location": "Kolkata, West Bengal"},
    "chief_complaint": "Progressive pallor, recurrent fever, bleeding from gums, and bone pain for 3 weeks",
    "presentation": "A 5-year-old boy is referred to the pediatric hematology department of a tertiary cancer center in Kolkata with a 3-week history of progressive pallor, intermittent high-grade fever, bleeding from gums while brushing, multiple bruises over the limbs, and refusal to walk due to pain in both legs. The mother first noticed pallor 3 weeks ago and took the child to a local doctor who prescribed iron syrup. When the child developed fever and bleeding gums, a blood test was performed at a local laboratory which showed 'very low counts,' and he was referred for further evaluation. The family has traveled from Malda district (approximately 350 km) for treatment.",
    "vital_signs": {"bp": "100/60", "hr": 128, "rr": 24, "temp": 38.8, "spo2": 97},
    "history": "Previously healthy child, developmentally normal. Immunization complete per UIP. No significant past medical history. Progressive pallor for 3 weeks, initially attributed to poor dietary intake. Fever for 2 weeks, intermittent, high-grade (39-40 degrees C), associated with chills but no rigors. Bleeding from gums for 10 days, spontaneous as well as while brushing. Multiple new bruises over limbs noticed by mother. Bone pain in both legs (especially shins and knees) for 2 weeks, worsening at night, causing the child to refuse walking. Decreased appetite and weight loss (mother estimates approximately 2 kg). No history of lymph node swelling noticed by parents. No history of testicular swelling. No CNS symptoms (headache, vomiting, visual disturbance). No exposure to radiation or known carcinogens. Family: Father is a jute mill worker, mother is homemaker. No family history of malignancy or hematological disorders.",
    "physical_exam": "Ill-looking, pale child. Weight: 15 kg (between 3rd and 15th centile). Significant pallor of conjunctivae, nail beds, and palms. Multiple ecchymoses over both shins and forearms. Petechiae over palate and buccal mucosa. Gingival hypertrophy and bleeding. Cervical lymphadenopathy: bilateral, multiple nodes, largest 2.5 cm x 2 cm in right posterior triangle, firm, non-tender, discrete, mobile. Axillary lymphadenopathy: bilateral, 1-1.5 cm nodes. Inguinal lymphadenopathy: bilateral. Hepatomegaly: liver 5 cm below right costal margin, firm, smooth, non-tender. Splenomegaly: spleen 6 cm below left costal margin. Sternal tenderness present. Tenderness over both tibiae and distal femora on palpation. No testicular enlargement. No cranial nerve deficits. Fundoscopy: Roth spots seen (retinal hemorrhages with white centers).",
    "investigations": "CBC: Hb 4.8 g/dL (severe anemia), TLC 68,000/mm3 (markedly elevated), Differential: Blasts 72%, Neutrophils 8%, Lymphocytes 18%, Monocytes 2%. Absolute neutrophil count (ANC): 5,440. Platelets: 18,000/mm3 (severe thrombocytopenia). Peripheral smear: Numerous lymphoblasts with high N:C ratio, scant cytoplasm, fine chromatin, 1-2 nucleoli, no Auer rods. Retic count: 0.3% (reticulocytopenia). ESR: 110 mm/hr. LDH: 2,840 U/L (markedly elevated). Uric acid: 9.8 mg/dL (elevated, tumor lysis risk). Bone marrow aspiration: Hypercellular marrow with >90% blast infiltration, reduced erythroid and myeloid precursors, megakaryocytes markedly reduced. Flow cytometry: CD10+, CD19+, CD20 partial+, CD22+, CD34+, TdT+; Myeloid markers negative. Diagnosis: Pre-B cell ALL (Common ALL - cALLA/CD10 positive). Cytogenetics: Hyperdiploidy (>50 chromosomes). CSF cytology: No blasts (CNS-1 status). CXR: No mediastinal mass. LFT: Mildly deranged (AST 65, ALT 58). Creatinine: 0.5 mg/dL. Coagulation: PT 14s (control 12s), aPTT 34s (control 30s).",
    "diagnosis": "Precursor B-cell Acute Lymphoblastic Leukemia (Pre-B ALL, CD10+, Hyperdiploid) - NCI Standard Risk",
    "differentials": ["Acute lymphoblastic leukemia (ALL)", "Acute myeloid leukemia (AML)", "Aplastic anemia", "Idiopathic thrombocytopenic purpura (ITP) with viral illness", "Visceral leishmaniasis (Kala-azar) presenting with pancytopenia and hepatosplenomegaly"],
    "learning_points": [
      "ALL is the most common childhood malignancy (25-30% of all pediatric cancers); peak incidence at 2-5 years; Pre-B ALL (CD10+) is the most common subtype with the best prognosis; NCI Standard Risk: age 1-10 years AND WBC <50,000/mm3",
      "Classic presentation includes the triad of pancytopenia symptoms: anemia (pallor, fatigue), neutropenia (recurrent infections, fever), and thrombocytopenia (bleeding, petechiae, ecchymoses); bone pain and refusal to walk due to marrow expansion and periosteal infiltration is a characteristic feature",
      "Visceral leishmaniasis (Kala-azar) endemic in Bihar and West Bengal must be considered in the differential of pancytopenia with hepatosplenomegaly in an Indian child; rK39 rapid test and bone marrow for LD bodies should be performed if epidemiologically relevant",
      "Flow cytometry immunophenotyping is essential for classification: B-ALL (CD19, CD10, CD22, TdT), T-ALL (CD3, CD5, CD7), and to differentiate from AML (MPO, CD13, CD33); Auer rods are pathognomonic for AML and are absent in ALL",
      "Risk stratification guides therapy: favorable factors include age 1-10 years, WBC <50,000, hyperdiploidy (>50 chromosomes), ETV6-RUNX1 fusion; unfavorable factors include age <1 year (infant ALL), WBC >50,000, hypodiploidy, Philadelphia chromosome (BCR-ABL), KMT2A rearrangements, and poor early response to steroids",
      "Tumor lysis syndrome prevention (hydration, allopurinol/rasburicase) must be initiated before starting induction chemotherapy; treatment follows multi-drug induction (prednisolone, vincristine, L-asparaginase, daunorubicin in HR), consolidation, maintenance for total duration of 2-3 years"
    ],
    "india_context": "Approximately 45,000-50,000 new cases of childhood cancer are diagnosed annually in India, with ALL being the most common. Survival rates in India have improved from <30% to 60-70% at centers following ICiCLe (Indian Childhood Collaborative Leukemia) and modified BFM protocols but remain lower than >90% survival in developed countries due to delayed diagnosis, treatment abandonment (15-25% in some centers), infection-related mortality, and limited access to supportive care. Kala-azar endemic zones (Bihar, West Bengal, Jharkhand, eastern UP) pose a diagnostic challenge as pancytopenia with hepatosplenomegaly overlaps with leukemia. Treatment abandonment is a major concern, especially in families from lower socioeconomic backgrounds; NGOs and government schemes (PMJAY, state cancer funds) provide financial assistance. Tata Medical Center, Kolkata, and other CNCL (Childhood Cancer Network of Centres in India) institutions have standardized affordable treatment protocols."
  },
  {
    "id": "PED-008",
    "title": "Wilson Disease (Hepatolenticular Degeneration)",
    "specialty": "pediatrics",
    "difficulty": "advanced",
    "source": "Indian National Association for Study of the Liver (INASL) Guidelines, Indian Pediatrics",
    "demographics": {"age": 10, "gender": "Female", "location": "Hyderabad, Telangana"},
    "chief_complaint": "Yellowish discoloration of eyes for 2 months, trembling of hands, and difficulty writing for 1 month",
    "presentation": "A 10-year-old girl is brought to the pediatric gastroenterology outpatient clinic in Hyderabad with progressive yellowish discoloration of the eyes for 2 months, trembling of both hands for 1 month, and deterioration in handwriting noticed by her school teacher for 3 weeks. The parents also report that she has become increasingly irritable and emotionally labile with frequent crying spells and declining school performance over the past 2 months. She had an episode of jaundice 8 months ago which was treated as 'hepatitis' at a local hospital and apparently resolved. Her elder brother (14 years) was recently found to have elevated liver enzymes on a routine check-up. The family is from a consanguineous marriage (parents are second cousins).",
    "vital_signs": {"bp": "100/65", "hr": 88, "rr": 18, "temp": 36.8, "spo2": 99},
    "history": "Born at term, normal development until current illness. Good scholastic performance until 3 months ago. Episode of jaundice 8 months ago: presented with yellow eyes, dark urine, and fatigue. Treated as viral hepatitis (no specific investigations beyond LFT). Jaundice partially resolved. Current symptoms: recurrence of jaundice 2 months ago (progressive), tremor of both hands noticed 1 month ago (initially intermittent, now constant), deterioration in handwriting, emotional lability, irritability, and decline in school performance. No history of dysarthria, dysphagia, gait disturbance, or drooling yet. No abdominal distension or GI bleed. Consanguineous marriage (second cousins). Elder brother (14 years) found to have elevated AST/ALT on evaluation at another hospital. Younger sibling (6 years) asymptomatic. No family history of liver disease or neuropsychiatric illness per parents.",
    "physical_exam": "Well-nourished girl. Icterus present. No pallor, cyanosis, or lymphadenopathy. Eyes: Kayser-Fleischer (KF) rings visible on slit lamp examination - golden-brown pigmented rings at the periphery of the cornea (Descemet membrane copper deposition), bilateral, more prominent superiorly and inferiorly. No sunflower cataract. Neurological: Higher functions intact but emotionally labile. Speech: Mildly dysarthric. Bilateral postural and intention tremor of hands (wing-beating type on sustained arm extension). Mild dystonia of right hand. Handwriting sample shows progressive micrographia and tremulousness. Tone: Mildly increased in upper limbs. Reflexes: Brisk bilaterally. Gait: Normal currently. Abdomen: Liver palpable 2 cm below costal margin (firm, non-tender). Spleen tip palpable. No ascites. No spider naevi or palmar erythema.",
    "investigations": "LFT: Total bilirubin 4.2 mg/dL (direct 2.8), AST 128 U/L, ALT 96 U/L, ALP 42 U/L (disproportionately low for a child - characteristic of Wilson disease), Albumin 3.0 g/dL, Globulin 3.8 g/dL (A:G reversal). Serum ceruloplasmin: 8 mg/dL (markedly low; normal 20-40 mg/dL). 24-hour urinary copper: 286 mcg/day (markedly elevated; normal <40 mcg/day; >100 mcg/day strongly suggestive of Wilson disease). Serum copper: 48 mcg/dL (low total copper due to low ceruloplasmin, but free/non-ceruloplasmin-bound copper elevated). CBC: Hb 10.2 g/dL, TLC 5,600, Platelets 1.1 lakh (mild thrombocytopenia from hypersplenism). Coagulation: INR 1.6 (prolonged). Slit lamp examination: Kayser-Fleischer rings confirmed bilaterally. MRI Brain: Hyperintense signal on T2/FLAIR in bilateral basal ganglia (lenticular nuclei - putamen > caudate) and thalami. Face of the giant panda sign in midbrain on T2W. Ultrasound abdomen: Hepatomegaly with coarse echotexture, splenomegaly, no ascites, patent portal vein. Liver biopsy (if performed): Hepatic copper content >250 mcg/g dry weight confirms diagnosis. ATP7B gene mutation analysis: Sent for confirmation. Sibling screening: Brother found to have low ceruloplasmin (12 mg/dL) and elevated urinary copper (180 mcg/day) - presymptomatic Wilson disease.",
    "diagnosis": "Wilson disease (hepatolenticular degeneration) presenting with hepatic and neuropsychiatric manifestations",
    "differentials": ["Wilson disease", "Autoimmune hepatitis", "Chronic viral hepatitis (HBV/HCV)", "Juvenile hemochromatosis", "Non-Wilsonian copper overload disorders"],
    "learning_points": [
      "Wilson disease is an autosomal recessive disorder of copper metabolism due to ATP7B gene mutations leading to defective biliary copper excretion and copper accumulation in liver, brain (basal ganglia), cornea (KF rings), kidneys, and other organs; onset typically 5-35 years",
      "Diagnostic triad: Low serum ceruloplasmin (<20 mg/dL), elevated 24-hour urinary copper (>100 mcg/day; >40 mcg/day suggestive), and KF rings on slit lamp examination; Leipzig scoring system assigns points to each finding for definitive diagnosis",
      "Disproportionately low alkaline phosphatase (ALP) for age and an ALP:total bilirubin ratio <4 with AST:ALT ratio >2.2 in the setting of acute liver failure is highly suggestive of Wilsonian acute liver failure - this is a classic NEET-PG pearl",
      "MRI brain showing T2 hyperintensity in bilateral lenticular nuclei (putamen) and the 'face of the giant panda' sign in the midbrain are characteristic neuroimaging findings",
      "Treatment: D-penicillamine (chelation, 20 mg/kg/day in 2-3 divided doses, given with pyridoxine supplementation) is first-line in India due to availability and cost; trientine is an alternative in penicillamine-intolerant patients; zinc acetate (maintenance therapy and presymptomatic patients) inhibits intestinal copper absorption; liver transplantation for acute liver failure or decompensated cirrhosis not responding to chelation",
      "Screening of all first-degree relatives (siblings especially) is mandatory as the disease is autosomal recessive with 25% risk in siblings; presymptomatic treatment prevents organ damage"
    ],
    "india_context": "Wilson disease is relatively more common in India due to higher rates of consanguineous marriages, particularly in South India, with an estimated prevalence of 1 in 10,000-30,000. The ATP7B mutation spectrum in India differs from Western populations, with p.C271X being a common mutation in the Indian subcontinent. D-penicillamine remains the mainstay of chelation therapy in India due to cost (Rs 5-10/tablet) compared to trientine (not easily available in India, imported). INASL guidelines recommend lifelong therapy and regular monitoring of urinary copper, LFT, ceruloplasmin, and neurological status. Pediatric liver transplantation is available at select centers (ILBS Delhi, CMC Vellore, SGPGI Lucknow, Gleneagles Global Hyderabad) but cost (Rs 15-25 lakh) remains a barrier. Family screening with ceruloplasmin and urinary copper should be performed for all siblings, with genetic testing where available."
  },
  {
    "id": "PED-009",
    "title": "Infantile Hypertrophic Pyloric Stenosis",
    "specialty": "pediatrics",
    "difficulty": "intermediate",
    "source": "IAP Textbook of Pediatric Surgery, Indian Journal of Surgery",
    "demographics": {"age": 0, "gender": "Male", "location": "Chandigarh, Punjab"},
    "chief_complaint": "Forceful vomiting after every feed for 10 days, not gaining weight",
    "presentation": "A 5-week-old first-born male infant is brought to the pediatric surgery outpatient department at PGIMER, Chandigarh, with a 10-day history of progressively worsening non-bilious vomiting after every breastfeed. The mother describes the vomiting as forceful, projectile in nature, traveling 2-3 feet away, occurring within 15-30 minutes of feeding. The baby remains hungry after vomiting and eagerly accepts re-feeding. There has been no bile-stained (green) vomiting, no blood in vomitus, and no fever. The mother reports progressively decreasing wet diapers (currently 2-3 per day versus 6-8 previously) and no stool for 2 days. The baby's birth weight was 3.2 kg, and the current weight is 3.0 kg (net weight loss). The baby was started on oral erythromycin at 2 weeks of age for 5 days by a local doctor for suspected chlamydial conjunctivitis.",
    "vital_signs": {"bp": "62/40", "hr": 156, "rr": 38, "temp": 36.6, "spo2": 98},
    "history": "First-born male child. Born at full term via elective LSCS (breech presentation) at a private hospital. Birth weight 3.2 kg, cried immediately. APGAR 8/9. Mother is 28 years old, primigravida, blood group A positive. Exclusively breastfed since birth. Feeding pattern was normal until 3 weeks of age. Non-bilious vomiting started at 3.5 weeks, initially occasional (1-2 feeds/day), rapidly progressive to every feed by 4.5 weeks. Vomiting is projectile in nature. No bilious component (no green color). Baby is eager to feed immediately after vomiting (hungry vomiter). Decreasing urine output and constipation. Weight at 3 weeks was 3.4 kg (gaining well), current weight at 5 weeks is 3.0 kg (weight loss). Received oral erythromycin ethylsuccinate at 2 weeks of age for sticky eyes. Family history: mother reports her brother had surgery for similar vomiting in infancy. No other significant history.",
    "physical_exam": "Alert but thin-appearing infant. Mild dehydration (slightly sunken eyes, dry mucous membranes, reduced skin turgor). Weight 3.0 kg (below birth weight at 5 weeks, failure to gain weight). Anterior fontanelle slightly depressed. Abdomen: Scaphoid (due to dehydration and poor nutrition). Visible gastric peristalsis from left to right across the upper abdomen, observable when the baby is offered a breastfeed during examination. On deep palpation of the right upper quadrant (epigastrium/right of umbilicus) with the left hand while feeding the baby (using the 'test feed' technique): a firm, smooth, non-tender, olive-shaped mass approximately 2 cm x 1 cm is palpable in the region of the pylorus. No hepatosplenomegaly. Inguinal regions normal. External genitalia normal. Perianal area normal.",
    "investigations": "Serum electrolytes: Na 132 mEq/L (mildly low), K 2.8 mEq/L (low), Cl 86 mEq/L (markedly low). ABG: pH 7.52, pCO2 48 mmHg (compensatory respiratory acidosis), HCO3 36 mEq/L (elevated). Diagnosis: Hypochloremic hypokalemic metabolic alkalosis (classic electrolyte abnormality in pyloric stenosis due to vomiting of HCl-rich gastric contents). BUN: 22 mg/dL (elevated due to dehydration). Creatinine: 0.3 mg/dL. Blood glucose: 62 mg/dL (low normal). Ultrasound abdomen (pylorus): Pyloric muscle thickness 5.2 mm (normal <3 mm; >3 mm is diagnostic), pyloric channel length 18 mm (normal <14 mm; >14 mm is diagnostic). Target sign on transverse view (hypertrophied pyloric muscle surrounding echogenic mucosa). Cervix sign at the gastric antrum. No gastric outlet obstruction from other causes. No malrotation features.",
    "diagnosis": "Infantile hypertrophic pyloric stenosis (IHPS) with hypochloremic hypokalemic metabolic alkalosis and dehydration",
    "differentials": ["Infantile hypertrophic pyloric stenosis", "Gastroesophageal reflux disease (GERD)", "Malrotation with midgut volvulus (bilious vomiting would be expected)", "Milk protein allergy", "Pylorospasm"],
    "learning_points": [
      "IHPS classically presents at 3-6 weeks of age in a first-born male infant with non-bilious, projectile vomiting; the baby is characteristically a 'hungry vomiter' who eagerly accepts re-feeding after vomiting",
      "The classic electrolyte disturbance is hypochloremic hypokalemic metabolic alkalosis with paradoxical aciduria: loss of HCl from vomiting depletes chloride and hydrogen ions causing alkalosis; kidneys retain H+ and Na+ at the expense of K+ loss; eventually kidneys excrete H+ (acidic urine) to conserve K+ despite systemic alkalosis",
      "Palpation of the pyloric 'olive' (firm, mobile, olive-shaped mass in the right upper quadrant/epigastrium) during a test feed is the clinical gold standard, but sensitivity is operator-dependent (60-80%); ultrasound is the investigation of choice with pyloric muscle thickness >3 mm and channel length >14 mm being diagnostic",
      "Macrolide antibiotics (erythromycin, azithromycin) given in early infancy are a recognized risk factor for IHPS, with odds ratio of 2-3 for exposure in the first 2 weeks of life; this association is frequently tested in NEET-PG",
      "Surgery (Ramstedt pyloromyotomy - longitudinal incision through the serosa and muscle of the pylorus without breaching the mucosa) is the definitive treatment, but MUST be performed only after complete correction of dehydration and electrolyte abnormalities, particularly potassium and chloride, as hypokalemia and alkalosis increase anesthetic risk"
    ],
    "india_context": "IHPS is less common in Indian infants compared to Western populations (incidence approximately 1 per 1000 live births in India versus 2-4 per 1000 in Caucasians), but it is not rare and must be suspected in any infant with progressive non-bilious projectile vomiting. Late presentation is common in India due to initial misdiagnosis as GERD or overfeeding and limited access to ultrasound in rural areas. The 'test feed' clinical examination remains invaluable in resource-limited Indian settings where ultrasound may not be immediately available. Open Ramstedt pyloromyotomy is the standard surgical approach at most Indian centers, though laparoscopic pyloromyotomy is increasingly performed at tertiary centers like PGIMER Chandigarh, AIIMS, and CMC Vellore. Pre-operative correction of metabolic alkalosis and hypokalemia is emphasized across all Indian surgical training programs."
  },
  {
    "id": "PED-010",
    "title": "Beta-Thalassemia Major (Cooley Anemia)",
    "specialty": "pediatrics",
    "difficulty": "intermediate",
    "source": "IAP Guidelines on Thalassemia, NHM Thalassemia Screening Programme",
    "demographics": {"age": 1, "gender": "Female", "location": "Ahmedabad, Gujarat"},
    "chief_complaint": "Severe pallor, abdominal distension, and failure to thrive since 6 months of age",
    "presentation": "A 14-month-old girl is referred to the thalassemia day care center of a government hospital in Ahmedabad by a PHC doctor after blood investigations showed severe anemia (Hb 4.2 g/dL). The mother reports that the child has been progressively pale since about 6 months of age, with increasing abdominal distension, poor appetite, irritability, and failure to gain weight despite adequate breastfeeding and complementary feeds. The child has been hospitalized twice previously (at 8 and 11 months) at a private hospital for blood transfusions, with the diagnosis noted as 'severe anemia.' No specific testing for the cause of anemia was performed at the private hospital. Both parents are from the Lohana community in Saurashtra region of Gujarat. The parents are not consanguineous but belong to the same community.",
    "vital_signs": {"bp": "78/50", "hr": 158, "rr": 40, "temp": 37.2, "spo2": 96},
    "history": "Born at full term, normal delivery at a government hospital. Birth weight 2.9 kg, cried immediately. No jaundice at birth. Breastfed exclusively until 6 months, then complementary feeding started. Appeared well until 5-6 months of age when mother noticed progressive pallor. Increasing irritability and poor feeding from 7 months. First blood transfusion at 8 months (Hb was 3.8 g/dL per mother). Second transfusion at 11 months (Hb was 4.5 g/dL). Now presenting with Hb 4.2 g/dL despite last transfusion 3 months ago. Mother noticed progressive abdominal distension over the past 3 months. Weight gain has been poor. No history of blood in stools, black stools, or visible bleeding. Both parents are healthy with no anemia symptoms. They are from the Lohana community (endogamous group in Gujarat with high beta-thalassemia carrier frequency). A distant relative's child reportedly has thalassemia and receives regular transfusions. No prior hemoglobin electrophoresis or HPLC done on the child or parents.",
    "physical_exam": "Irritable, pale, malnourished-appearing infant. Weight: 7.0 kg (<3rd centile, expected ~10 kg). Length: 72 cm (<3rd centile). Severe pallor of conjunctivae, palms, and nail beds. Mild icterus. Facial features: Frontal bossing with prominent zygomatic bones (thalassemic facies - beginning extramedullary hematopoiesis is causing calvarial expansion). Depressed nasal bridge. Maxillary prominence giving chipmunk facies (early changes). Anterior fontanelle: Widened, soft. Abdomen: Markedly distended. Hepatomegaly: liver 6 cm below right costal margin (firm, smooth, non-tender). Splenomegaly: spleen 8 cm below left costal margin (massive splenomegaly). No ascites. Cardiovascular: Tachycardia, systolic flow murmur grade 2/6 at left sternal border (anemia-related). No signs of cardiac failure. Chest: Bilateral equal air entry, no adventitious sounds. No petechiae or purpura. No lymphadenopathy. Developmental milestones: Mildly delayed gross motor milestones (sitting with support at 10 months, not yet standing).",
    "investigations": "CBC: Hb 4.2 g/dL, MCV 62 fL (microcytic), MCH 19 pg (hypochromic), MCHC 28 g/dL, RDW 32% (highly elevated). TLC: 12,400 (normal). Platelets: 1.2 lakh (mildly low, hypersplenism). Reticulocyte count: 6.2% (elevated). Peripheral smear: Severe microcytic hypochromic anemia with marked anisopoikilocytosis, target cells, tear-drop cells, nucleated RBCs (numerous), basophilic stippling. Hemoglobin HPLC (pre-transfusion sample): HbF 92.4%, HbA2 3.8%, HbA 0% (absent), confirming beta-thalassemia major (beta-0/beta-0). Serum ferritin: 1,480 ng/mL (elevated even at this age after only 2 prior transfusions, reflecting massive ineffective erythropoiesis). Serum iron: 198 mcg/dL, TIBC: 210 mcg/dL, Transferrin saturation: 94%. LDH: 680 U/L (elevated from hemolysis and ineffective erythropoiesis). Indirect bilirubin: 3.2 mg/dL (unconjugated hyperbilirubinemia from hemolysis). Parent screening - Father HPLC: HbA2 5.6% (elevated; beta-thalassemia trait), Hb 11.2 g/dL, MCV 68 fL. Mother HPLC: HbA2 5.2% (elevated; beta-thalassemia trait), Hb 10.8 g/dL, MCV 66 fL. Both parents confirmed beta-thalassemia carriers. X-ray skull: Hair-on-end appearance (crew-cut appearance) due to calvarial expansion from extramedullary hematopoiesis. Diploic space widened.",
    "diagnosis": "Beta-thalassemia major (Cooley anemia, beta-0/beta-0 genotype) with iron overload, massive hepatosplenomegaly, and failure to thrive",
    "differentials": ["Beta-thalassemia major", "Beta-thalassemia intermedia (HbE/beta-thalassemia in Eastern India)", "Severe iron deficiency anemia", "Hemoglobin H disease (alpha-thalassemia intermedia)", "Congenital dyserythropoietic anemia"],
    "learning_points": [
      "Beta-thalassemia major presents at 6-9 months of age (when fetal hemoglobin normally declines and adult HbA production should take over but cannot due to defective beta-globin synthesis); HbF >90% with absent or markedly reduced HbA on HPLC is diagnostic",
      "Management requires regular packed RBC transfusions every 2-4 weeks to maintain pre-transfusion Hb >9.5 g/dL (IAP guidelines) to suppress ineffective erythropoiesis, prevent skeletal deformities, and allow normal growth; leucodepleted, cross-matched, phenotypically matched (at minimum for Rh and Kell) blood should be used",
      "Iron chelation therapy must be started after 10-20 transfusions or when serum ferritin exceeds 1000 ng/mL: deferasirox (oral, 20-40 mg/kg/day, most commonly used in India), desferrioxamine (subcutaneous infusion, gold standard), or deferiprone (oral, especially useful for cardiac iron overload); target ferritin <1000 ng/mL",
      "Skeletal changes (hair-on-end appearance on skull X-ray, maxillary expansion causing chipmunk facies, frontal bossing) result from compensatory extramedullary hematopoiesis and marrow expansion due to ineffective erythropoiesis; adequate transfusion prevents these deformities",
      "Curative options: Allogeneic hematopoietic stem cell transplantation (HSCT) from an HLA-matched sibling donor is the only established cure; gene therapy and gene editing (CRISPR-based) are emerging options; in India, HSCT is available at CMC Vellore, Tata Memorial, AIIMS, and other select centers at a cost of Rs 10-15 lakh",
      "Thalassemia prevention through carrier screening (HPLC-based) of at-risk communities, premarital counseling, and prenatal diagnosis (chorionic villus sampling at 10-12 weeks) with option of medical termination of affected pregnancies is the most cost-effective strategy as emphasized by NHM and IAP"
    ],
    "india_context": "India has the world's largest burden of beta-thalassemia, with an estimated 1-1.5 lakh patients and 10,000-12,000 new thalassemia major births annually. The carrier frequency is 3-4% nationally but much higher in certain endogamous communities: Sindhis, Lohanas, Gujaratis, Punjabis, Bengalis, and certain tribal groups carry rates of 5-15%. Gujarat has among the highest carrier rates in the country. The NHM Thalassemia Screening Programme and ICMR-supported Thalassemia Prevention Programme recommend HPLC-based carrier screening in high-prevalence communities and mandatory premarital screening in some states (Gujarat, Maharashtra). The Thalassemia day care centers provide free transfusions and chelation under NHM in many states. Cost of lifelong treatment (transfusion + chelation + complications management) is estimated at Rs 1-2 lakh per year, making prevention through screening and genetic counseling the priority public health strategy. DALYs lost due to thalassemia in India are substantial and comparable to many communicable diseases."
  }
]
