[
  {
    "id": "PSY-001",
    "title": "First Episode Psychosis — Schizophrenia",
    "specialty": "psychiatry",
    "difficulty": "intermediate",
    "source": "IPS Guidelines - Schizophrenia Management",
    "demographics": {"age": 22, "gender": "Male", "location": "Kolkata, West Bengal"},
    "chief_complaint": "Talking to himself, suspicious behavior, and social withdrawal for 6 months",
    "presentation": "A 22-year-old engineering student is brought by his parents with gradual onset of talking/laughing to himself, suspicion that neighbors are plotting against him, hearing voices commenting on his actions, progressive social withdrawal, and declining academic performance over 6 months. He has poor insight and refuses to acknowledge any illness.",
    "vital_signs": {"bp": "120/80", "hr": 78, "rr": 16, "temp": 37.0, "spo2": 99},
    "history": "Insidious onset over 6 months. Auditory hallucinations: Hears 2-3 voices discussing him (third-person commentary type). Persecutory delusions: Believes neighbors have installed cameras, food is being poisoned. Thought broadcasting: Believes others can read his thoughts. Social withdrawal: Stopped attending college, stays in room. Self-care deterioration: Not bathing, disheveled. Sleep disturbance. No substance use. No family history of psychiatric illness. No head injury. No seizures. Premorbid personality: Introverted but functionally normal.",
    "physical_exam": "Disheveled appearance, poor hygiene. Eye contact: Avoidant. Affect: Flat, incongruent (laughs inappropriately). Speech: Tangential, occasional loosening of associations. Hallucinations: Appears to respond to internal stimuli. Delusions: Fixed, systematized persecutory delusions. Insight: Absent. Judgment: Impaired. No focal neurological deficit. No signs of substance abuse.",
    "investigations": "Diagnosis is clinical (ICD-11/DSM-5 criteria). CBC, RFT, LFT, TFT: Normal (baseline before starting antipsychotics). Blood glucose, lipid profile: Normal (baseline — antipsychotics cause metabolic syndrome). Urine drug screen: Negative. MRI brain: Normal (rules out organic causes in first episode). EEG: Normal. HIV, VDRL: Negative.",
    "diagnosis": "Schizophrenia — first episode psychosis (paranoid type, ICD-11: >1 month of symptoms with Schneiderian first-rank symptoms)",
    "differentials": ["Schizophrenia", "Acute psychotic disorder (brief)", "Bipolar disorder with psychotic features", "Substance-induced psychosis (cannabis, amphetamine)", "Organic psychosis (temporal lobe epilepsy, brain tumor)", "Delusional disorder"],
    "learning_points": [
      "Schneiderian first-rank symptoms: Auditory hallucinations (commentary/discussing), thought insertion/withdrawal/broadcasting, delusions of control — suggestive but not pathognomonic of schizophrenia",
      "Diagnosis requires >1 month of symptoms (ICD-11) with significant functional impairment",
      "First episode: MRI brain mandatory to rule out organic causes before labeling as schizophrenia",
      "Treatment: Second-generation antipsychotics (risperidone 2-6 mg, olanzapine 10-20 mg) are first-line",
      "Duration of untreated psychosis (DUP) predicts outcome — shorter DUP = better prognosis",
      "Metabolic monitoring: Weight, glucose, lipids at baseline and regularly (olanzapine worst for weight gain)"
    ],
    "india_context": "Schizophrenia prevalence in India is 3-4 per 1000. Stigma is the biggest barrier to treatment — families hide illness, consult traditional healers first. Average DUP in India is 1-2 years. Mental Healthcare Act 2017 guarantees right to mental healthcare. DMHP (District Mental Health Programme) provides psychiatric care at district level. Generic antipsychotics are affordable."
  },
  {
    "id": "PSY-002",
    "title": "Major Depressive Disorder with Suicidal Ideation",
    "specialty": "psychiatry",
    "difficulty": "intermediate",
    "source": "IPS Guidelines - Depression Management",
    "demographics": {"age": 35, "gender": "Female", "location": "Chennai, Tamil Nadu"},
    "chief_complaint": "Persistent sadness, loss of interest, and thoughts of ending life for 3 months",
    "presentation": "A 35-year-old married schoolteacher presents with persistent low mood, loss of interest in all activities (anhedonia), fatigue, insomnia, poor concentration, guilt, appetite loss with 6 kg weight loss, and active suicidal ideation with a plan (has been collecting medications) for 3 months. She recently went through a difficult divorce process.",
    "vital_signs": {"bp": "110/70", "hr": 68, "rr": 14, "temp": 37.0, "spo2": 99},
    "history": "Depressed mood: Persistent, worse in mornings (diurnal variation). Anhedonia: Lost interest in teaching, music, socializing. Sleep: Early morning awakening (4 AM, unable to go back to sleep — typical). Appetite: Markedly decreased, lost 6 kg. Fatigue: Cannot complete daily tasks. Concentration: Making errors at work. Guilt: Excessive, inappropriate guilt about divorce. Suicidal ideation: Active, with plan (has collected excess medications). Previous episode of depression 5 years ago (treated with escitalopram, remitted). Divorce proceedings ongoing (psychosocial stressor). No substance use. No psychotic symptoms.",
    "physical_exam": "Appearance: Neatly dressed but tearful, poor eye contact, psychomotor retardation (slow movements, long pauses before answering). Speech: Low volume, monotonous. Mood: 'I feel like a burden, there's no point.' Affect: Depressed, congruent, restricted range. Thought content: Ideas of worthlessness, hopelessness, active suicidal ideation WITH PLAN. No hallucinations. Insight: Partial. Cognition: Intact but subjective poor concentration.",
    "investigations": "PHQ-9 score: 24 (severe depression). Columbia Suicide Severity Rating Scale: Active suicidal ideation with plan (HIGH RISK). TSH: Normal (rule out hypothyroidism). Hb: Normal (rule out anemia). Vitamin B12: Normal. Blood glucose: Normal. No investigations specific to depression — diagnosis is clinical.",
    "diagnosis": "Major depressive disorder — recurrent, severe, with active suicidal ideation and plan (high-risk)",
    "differentials": ["Major depressive disorder", "Bipolar depression (screen for mania history)", "Adjustment disorder with depressed mood", "Hypothyroidism", "Anemia causing fatigue", "Persistent depressive disorder (dysthymia)"],
    "learning_points": [
      "DSM-5: ≥5 of 9 symptoms for ≥2 weeks (SIGECAPS: Sleep, Interest, Guilt, Energy, Concentration, Appetite, Psychomotor, Suicidality) + depressed mood",
      "ALWAYS assess suicide risk: Ideation → Plan → Intent → Access to means → Protective factors",
      "Active suicidal ideation with plan = psychiatric emergency — hospitalization indicated",
      "Treatment severe depression: SSRI (escitalopram/sertraline) + psychotherapy (CBT). ECT for treatment-resistant or immediate suicidal risk",
      "ECT is highly effective and fast-acting — consider early in severe depression with active suicidality",
      "SSRI takes 2-4 weeks for effect — bridge with benzodiazepine for anxiety/insomnia if needed, but not long-term"
    ],
    "india_context": "Depression affects 5-10% of Indian population. India accounts for 36% of global suicides. National Suicide Prevention Strategy launched in 2022. KIRAN helpline (1800-599-0019) provides 24/7 free mental health support. Stigma prevents help-seeking — only 10-20% of depressed individuals seek treatment. Generic SSRIs (escitalopram, sertraline) cost Rs 2-5/day."
  },
  {
    "id": "PSY-003",
    "title": "Bipolar Disorder — Acute Manic Episode",
    "specialty": "psychiatry",
    "difficulty": "intermediate",
    "source": "IPS Guidelines - Bipolar Disorder",
    "demographics": {"age": 28, "gender": "Male", "location": "Mumbai, Maharashtra"},
    "chief_complaint": "Decreased sleep, excessive talking, grandiosity, and reckless spending for 2 weeks",
    "presentation": "A 28-year-old software engineer is brought by his wife with 2 weeks of decreased need for sleep (sleeping 2 hours yet feeling energetic), excessive talking (pressured speech), grandiose plans (claims he will become PM, has filed patents worth billions), reckless spending (bought a luxury car on EMI), hypersexuality, and irritability when challenged. He had a depressive episode 2 years ago.",
    "vital_signs": {"bp": "130/85", "hr": 92, "rr": 18, "temp": 37.2, "spo2": 99},
    "history": "Onset 2 weeks ago: Initially seemed 'extra happy' and productive. Then: Decreased need for sleep (2-3 hours), felt refreshed. Pressured speech: Talks non-stop, jumps between topics. Grandiosity: Claims divine connection, plans to run for PM. Reckless behavior: Bought luxury car (Rs 35 lakhs on credit), invested savings in dubious scheme. Hypersexuality: Inappropriate advances. Irritable when confronted. Previous depressive episode 2 years ago (treated with sertraline — may have triggered hypomanic switch). Family history: Father had 'mood swings' (likely bipolar). No substance use.",
    "physical_exam": "Dressed flamboyantly (bright colors, excessive jewelry). Psychomotor agitation — cannot sit still. Speech: Pressured, loud, rapid, flight of ideas. Mood: 'I feel fantastic, on top of the world!' Affect: Euphoric, labile (suddenly becomes irritable when questioned). Thought content: Grandiose delusions. No hallucinations. Insight: Absent ('I am fine, everyone else is jealous'). Judgment: Severely impaired.",
    "investigations": "Clinical diagnosis — based on DSM-5/ICD-11 criteria. Young Mania Rating Scale (YMRS): 38 (severe mania, >20 indicates mania). TSH: Normal (hyperthyroidism can mimic mania). Urine drug screen: Negative (stimulants, cannabis can cause mania-like state). CBC, RFT, LFT: Normal (baseline before mood stabilizers). Blood glucose: Normal. ECG: Normal (baseline before lithium). Serum calcium: Normal (hyperparathyroidism can cause mood symptoms).",
    "diagnosis": "Bipolar I disorder — acute manic episode with psychotic features (grandiose delusions), previous depressive episode",
    "differentials": ["Bipolar I disorder — manic episode", "Schizoaffective disorder", "Substance-induced mania (stimulants, steroids)", "Hyperthyroidism", "Frontal lobe syndrome", "Cyclothymic disorder"],
    "learning_points": [
      "Mania diagnostic criteria (DIG FAST): Distractibility, Insomnia (decreased need for sleep), Grandiosity, Flight of ideas, Activity increase, Speech (pressured), Thoughtlessness (reckless behavior) — ≥3 (or 4 if only irritable mood) for ≥1 week",
      "ONE manic episode = Bipolar I (even without depressive episodes). Hypomania + depression = Bipolar II",
      "Antidepressants can trigger mania in bipolar patients — always screen for bipolar before starting antidepressants",
      "Acute mania treatment: Lithium OR valproate + antipsychotic (olanzapine/quetiapine) for behavioral control",
      "Lithium monitoring: Therapeutic level 0.6-1.0 mEq/L (acute: up to 1.2). Check levels 5 days after initiation",
      "Lithium side effects: Tremor, polyuria (NDI), hypothyroidism, weight gain. Teratogenic (Ebstein anomaly)"
    ],
    "india_context": "Bipolar disorder prevalence in India is 0.5-1.5%. Often misdiagnosed as schizophrenia or depression initially. Lithium is cheap (Rs 1-2/day) and widely available — remains first-line in India. Valproate is alternative but TERATOGENIC — avoid in women of childbearing age. IPS recommends lithium monitoring every 3-6 months. Many patients stop medication when feeling well (during euthymia)."
  },
  {
    "id": "PSY-004",
    "title": "Alcohol Dependence Syndrome with Delirium Tremens",
    "specialty": "psychiatry",
    "difficulty": "advanced",
    "source": "IPS Guidelines - Substance Use Disorders",
    "demographics": {"age": 45, "gender": "Male", "location": "Thiruvananthapuram, Kerala"},
    "chief_complaint": "Confusion, tremors, seeing insects on walls, and agitation after stopping alcohol",
    "presentation": "A 45-year-old autorickshaw driver with 20 years of heavy daily alcohol use presents 72 hours after his last drink with severe confusion, visual hallucinations (seeing insects crawling on walls), coarse tremors, profuse sweating, tachycardia, and a seizure in the emergency department. He stopped drinking 3 days ago because of hospitalization for a leg fracture.",
    "vital_signs": {"bp": "170/100", "hr": 120, "rr": 24, "temp": 38.8, "spo2": 95},
    "history": "Alcohol use: 20 years, daily 750 mL arrack/brandy (>60 units/week). Last drink 72 hours ago (stopped due to hospital admission for leg fracture). CAGE: 4/4 (positive for dependence). Timeline: 12 hours: Tremors, anxiety, nausea. 24 hours: Insomnia, tachycardia, sweating. 48 hours: Auditory/visual hallucinations. 72 hours: Confusion, disorientation, agitation, seizure. Previous withdrawal episodes: 2 episodes with tremors and hallucinations (kindling effect). Liver disease symptoms: Abdominal distension, jaundice.",
    "physical_exam": "Agitated, disoriented (time, place, person — delirium). Coarse tremors of hands. Profuse diaphoresis. Visual hallucinations: Picking at bedsheets (Lilliputian hallucinations), looking at walls frightened. Tachycardic, hypertensive, febrile. Icterus. Palmar erythema, spider nevi (chronic liver disease). Parotid enlargement. Tender hepatomegaly. Ascites. Asterixis. CIWA-Ar score: 28 (severe withdrawal, >20 = severe).",
    "investigations": "CIWA-Ar score: 28 (Clinical Institute Withdrawal Assessment). CBC: Macrocytic anemia (MCV 105), thrombocytopenia (80,000). LFT: AST 180, ALT 90 (AST:ALT ratio >2 — alcoholic liver disease), GGT 350 (markedly elevated). Bilirubin: 4.5. Albumin: 2.5. PT/INR: 1.8 (coagulopathy). RBS: 60 (hypoglycemia). Magnesium: 1.2 (low). Phosphate: Low. Thiamine level: Low. ABG: Metabolic alkalosis (vomiting). USG abdomen: Hepatomegaly, fatty liver, ascites. CT brain: No SDH or SOL.",
    "diagnosis": "Delirium tremens (severe alcohol withdrawal) in a patient with alcohol dependence syndrome and alcoholic liver disease",
    "differentials": ["Delirium tremens", "Hepatic encephalopathy", "Wernicke encephalopathy", "Meningitis/encephalitis", "Subdural hematoma (alcoholics fall frequently)", "Sepsis with delirium"],
    "learning_points": [
      "Delirium tremens: Onset 48-96 hours after last drink. Confusion + autonomic hyperactivity + visual hallucinations + seizures",
      "CIWA-Ar protocol for withdrawal management: >20 = severe, treat aggressively with benzodiazepines",
      "Benzodiazepines are the treatment of choice: Diazepam loading (10-20mg IV q1-2h) OR lorazepam (if liver failure)",
      "Give IV thiamine (500mg TDS x 3 days) BEFORE glucose — glucose without thiamine precipitates Wernicke encephalopathy",
      "Wernicke triad: Ophthalmoplegia + Ataxia + Confusion — often incomplete. Treat empirically if suspected",
      "DT mortality is 5-15% without treatment, <1% with proper benzodiazepine and ICU management"
    ],
    "india_context": "Kerala has the highest per-capita alcohol consumption in India. Alcohol dependence affects 5-10% of adult males nationally. Arrack and toddy are commonly consumed. NIMHANS Bengaluru is a leading center for addiction treatment. De-addiction centers under DMHP are available in all districts. National Drug De-addiction Programme provides free treatment."
  },
  {
    "id": "PSY-005",
    "title": "Conversion Disorder — Functional Neurological Symptom Disorder",
    "specialty": "psychiatry",
    "difficulty": "intermediate",
    "source": "IPS Practice Guidelines",
    "demographics": {"age": 18, "gender": "Female", "location": "Jaipur, Rajasthan"},
    "chief_complaint": "Sudden inability to move legs after an argument at home",
    "presentation": "An 18-year-old girl is brought to the emergency with sudden onset inability to move both legs since this morning, following a heated argument with her father about her wanting to continue education vs an arranged marriage. She appears surprisingly calm despite the 'paralysis' (la belle indifference). Neurological examination shows inconsistencies. She had a similar episode 1 year ago that resolved spontaneously.",
    "vital_signs": {"bp": "110/70", "hr": 78, "rr": 16, "temp": 37.0, "spo2": 99},
    "history": "Sudden onset bilateral leg weakness/paralysis this morning after an argument about arranged marriage (identifiable psychosocial stressor). Appears unable to move legs voluntarily. No pain. No sensory loss. No bladder/bowel involvement. La belle indifference: Appears indifferent to her dramatic symptom. Previous similar episode: 1 year ago (resolved in 3 days after family conflict resolved). No headache, no LOC, no seizures. No trauma. Academic stress ongoing.",
    "physical_exam": "Calm, cooperative, la belle indifference. Motor: Bilateral leg paralysis claimed (grade 0/5 on voluntary testing). BUT: Hoover sign POSITIVE (involuntary extension of 'paralyzed' leg when flexing the opposite hip against resistance — inconsistency). Hip flexion on bed shows normal power when attention diverted. Deep tendon reflexes: NORMAL (should be abnormal in UMN or LMN lesion). Plantars: Flexor bilaterally (normal — should be extensor in UMN). Sensation: Non-dermatomal, stocking distribution loss (anatomically inconsistent). No muscle wasting. No fasciculations.",
    "investigations": "MRI spine: Normal. MRI brain: Normal. NCV/EMG: Normal (no neuropathy or radiculopathy). CBC, TFT, calcium: Normal. These are done to rule out organic causes — diagnosis is clinical based on positive signs of functional disorder, NOT just negative investigations.",
    "diagnosis": "Conversion disorder (Functional Neurological Symptom Disorder — DSM-5) with functional paralysis",
    "differentials": ["Conversion disorder", "Guillain-Barré syndrome", "Transverse myelitis", "Spinal cord compression", "Myasthenia gravis", "Malingering (intentional feigning)"],
    "learning_points": [
      "Conversion disorder diagnosis requires POSITIVE signs of functional disorder (Hoover sign, inconsistencies), NOT just absence of organic disease",
      "Hoover sign: Involuntary hip extension when flexing the other hip — positive = functional weakness",
      "La belle indifference: Lack of concern about severe symptoms — suggestive but NOT reliable alone",
      "DSM-5 removed the requirement for identifiable stressor — but stressors are commonly found",
      "Treatment: Explanation (name the condition, validate symptoms are real but not from structural damage), physiotherapy, CBT",
      "Conversion is NOT malingering (unconscious mechanism) — patients genuinely experience symptoms"
    ],
    "india_context": "Conversion disorder is common in India, especially in young women facing psychosocial stressors (marriage, family conflicts, academic pressure). Often first seen in emergency/neurology departments. Frequently mismanaged — dramatic treatments (cold water splashing, aversive techniques) are still used and are harmful. IPS recommends empathetic, non-confrontational approach with physiotherapy and psychotherapy."
  },
  {
    "id": "PSY-006",
    "title": "Obsessive-Compulsive Disorder (OCD)",
    "specialty": "psychiatry",
    "difficulty": "intermediate",
    "source": "IPS Guidelines - OCD Management",
    "demographics": {"age": 25, "gender": "Male", "location": "Bengaluru, Karnataka"},
    "chief_complaint": "Excessive handwashing and intrusive thoughts about contamination for 2 years",
    "presentation": "A 25-year-old IT professional presents with 2 years of intrusive, distressing thoughts about contamination (obsessions) leading to repetitive handwashing for 3-4 hours daily (compulsions). He recognizes the behavior is excessive (good insight) but cannot control it. He has developed cracked, bleeding skin on his hands. His work performance has suffered and he is at risk of losing his job.",
    "vital_signs": {"bp": "120/75", "hr": 76, "rr": 16, "temp": 37.0, "spo2": 99},
    "history": "Onset 2 years ago: Intrusive thought that doorknobs, surfaces are contaminated with germs. Washes hands repeatedly (20-30 times/day, 3-4 hours total). Also showers 2-3 times daily for 1 hour each. Avoids touching anything in office. Changed clothes immediately upon returning home. Insight: Present ('I know it's irrational but I can't stop'). Resistance: Tries to resist but overwhelming anxiety forces compliance. Interference: Late to work, missing deadlines. Y-BOCS score: 28 (severe). No depressive symptoms currently. No substance use. Family history: Mother has 'checking rituals' (undiagnosed OCD).",
    "physical_exam": "Hands: Severe contact dermatitis — cracked, excoriated, bleeding skin from excessive washing. Appears anxious. Otherwise normal physical examination. Mental status: Anxious mood. Obsessions described clearly. Insight present. No psychotic symptoms. No suicidal ideation.",
    "investigations": "Y-BOCS (Yale-Brown Obsessive Compulsive Scale): 28/40 (severe; >16 = clinically significant). Diagnosis is clinical. TSH: Normal. CBC: Normal. No specific lab tests for OCD. Brain imaging: Not routinely needed (but if done: may show increased activity in caudate nucleus and orbitofrontal cortex on fMRI).",
    "diagnosis": "Obsessive-compulsive disorder — contamination obsessions with washing compulsions, severe (Y-BOCS 28)",
    "differentials": ["OCD", "Obsessive-compulsive personality disorder (OCPD — no insight issues)", "Body dysmorphic disorder", "Illness anxiety disorder (hypochondriasis)", "Generalized anxiety disorder", "Tic disorders (Tourette with OCD)"],
    "learning_points": [
      "Obsessions: Intrusive, unwanted, distressing thoughts. Compulsions: Repetitive behaviors to reduce anxiety from obsessions",
      "Common themes: Contamination/washing, doubt/checking, symmetry/ordering, forbidden thoughts",
      "OCD has INSIGHT (ego-dystonic) — patient knows behavior is irrational. OCPD has NO insight (ego-syntonic)",
      "First-line treatment: SSRI (fluoxetine 40-80mg or fluvoxamine — higher doses needed than for depression) + ERP (Exposure and Response Prevention therapy)",
      "ERP is THE most effective psychotherapy — gradual exposure to feared stimulus while preventing compulsive response",
      "If SSRI fails: Clomipramine (most effective anti-obsessional but more side effects) or augment with low-dose antipsychotic"
    ],
    "india_context": "OCD prevalence in India is 2-3%. Often underdiagnosed as patients feel ashamed. Average delay to treatment in India is 7-10 years. Religious/cultural content in obsessions is common in India (fear of blasphemy, religious purity rituals). ERP therapists are scarce in India — NIMHANS and major centers provide training. SSRIs for OCD are affordable (generic fluoxetine Rs 2-3/day)."
  },
  {
    "id": "PSY-007",
    "title": "Neuroleptic Malignant Syndrome (NMS)",
    "specialty": "psychiatry",
    "difficulty": "advanced",
    "source": "IPS Guidelines - Psychiatric Emergencies",
    "demographics": {"age": 30, "gender": "Male", "location": "Delhi"},
    "chief_complaint": "High fever, severe muscle rigidity, and altered consciousness after starting haloperidol",
    "presentation": "A 30-year-old man with schizophrenia was started on haloperidol 10mg IM for acute agitation 3 days ago at a psychiatric facility. He now develops high fever (40.5°C), generalized 'lead-pipe' muscle rigidity, altered consciousness, profuse sweating, and tachycardia. His CPK is markedly elevated. This is a life-threatening psychiatric emergency.",
    "vital_signs": {"bp": "160/100", "hr": 130, "rr": 28, "temp": 40.5, "spo2": 93},
    "history": "Known schizophrenia, recently admitted for acute psychotic episode. Started haloperidol 10mg IM (high-potency antipsychotic) 3 days ago. Day 1: Appeared stiff, attributed to EPS. Day 2: Developed fever 38.5°C, worsening rigidity. Day 3: High fever 40.5°C, severe rigidity, altered sensorium, diaphoretic, tachycardic. No prior NMS episodes. Also on trihexyphenidyl (anticholinergic). No recent dehydration. No recent restraint use.",
    "physical_exam": "Altered consciousness (GCS 10). Severe generalized 'lead-pipe' rigidity (constant resistance throughout range of motion — NOT cogwheel). Profuse diaphoresis. Hyperthermia 40.5°C. Tachycardia 130. Labile BP. Tremor. Dysphagia. Incontinence. No focal neurological signs. Deep tendon reflexes: Decreased (masked by rigidity).",
    "investigations": "CPK: 15,000 IU/L (markedly elevated — rhabdomyolysis; normal <200). WBC: 18,000 (leukocytosis). Creatinine: 2.5 (AKI from myoglobinuria). Urine: Dark brown (myoglobinuria). Myoglobin: Elevated. LFT: Mildly elevated transaminases. Electrolytes: Calcium low, Phosphate high. Coagulation: Mildly deranged. Iron levels: Low (often seen in NMS). CT brain: Normal. LP: Normal (rules out meningitis).",
    "diagnosis": "Neuroleptic malignant syndrome (NMS) secondary to haloperidol — life-threatening antipsychotic complication",
    "differentials": ["Neuroleptic malignant syndrome", "Serotonin syndrome", "Malignant hyperthermia", "Lethal catatonia", "Meningitis/encephalitis", "Heat stroke"],
    "learning_points": [
      "NMS tetrad: Fever + Rigidity (lead-pipe) + Altered mental status + Autonomic instability",
      "Most common with high-potency typical antipsychotics (haloperidol) but can occur with ANY antipsychotic",
      "Risk factors: High dose, rapid dose escalation, IM route, dehydration, agitation, restraint use",
      "STOP the offending drug immediately. Supportive: ICU, cooling, IV fluids, monitor CPK and renal function",
      "Specific treatment: Dantrolene (muscle relaxant for rigidity) and/or Bromocriptine (dopamine agonist)",
      "ECT is effective for treatment-resistant NMS and lethal catatonia"
    ],
    "india_context": "NMS is underrecognized in Indian psychiatric facilities. Haloperidol is still widely used (cheapest antipsychotic) despite higher NMS risk. Overcrowded wards, dehydration, and restraint use increase risk. Many psychiatric facilities lack ICU access. IPS recommends: Low starting dose, adequate hydration, avoid IM depot in first-episode patients, monitor temperature."
  },
  {
    "id": "PSY-008",
    "title": "Anorexia Nervosa in a Teenager",
    "specialty": "psychiatry",
    "difficulty": "intermediate",
    "source": "IPS Guidelines - Eating Disorders",
    "demographics": {"age": 16, "gender": "Female", "location": "Mumbai, Maharashtra"},
    "chief_complaint": "Extreme weight loss, refusal to eat, and excessive exercise",
    "presentation": "A 16-year-old girl from an affluent Mumbai family is brought by her parents with alarming weight loss (BMI 14.5, from 21 one year ago), refusal to eat adequate meals, self-induced vomiting after eating, and exercising excessively (running 10 km daily). She expresses intense fear of gaining weight and perceives herself as 'fat' despite being severely emaciated. She has developed amenorrhea.",
    "vital_signs": {"bp": "85/55", "hr": 48, "rr": 14, "temp": 35.8, "spo2": 98},
    "history": "Started 'dieting' 1 year ago after being called 'chubby' by a classmate. Progressive restriction of food intake. Currently eating ~400 kcal/day (should be ~2000). Self-induced vomiting after meals (purging). Excessive exercise: Runs 10 km daily, does not rest. Intense fear of weight gain (weighs herself 5-6 times daily). Body image distortion: Perceives herself as fat (BMI 14.5 — severely underweight). Amenorrhea for 6 months. Hair loss. Cold intolerance. Fatigue. Constipation. Social isolation. Academic performance maintained (perfectionistic personality). No substance use.",
    "physical_exam": "BMI 14.5 (severely underweight; <17.5 criteria met). Emaciated, sunken eyes, dry skin. Lanugo hair on face and arms (malnutrition). Bradycardia (48/min). Hypotension (85/55). Hypothermia (35.8°C). Parotid enlargement (purging). Russell's sign: Calluses on knuckles (self-induced vomiting). Dental erosion (enamel loss from gastric acid). Pedal edema (hypoalbuminemia). Muscle wasting. Hair thinning.",
    "investigations": "BMI: 14.5 (severe anorexia <15). ECG: Sinus bradycardia, prolonged QTc (risk of arrhythmia — most dangerous complication). Electrolytes: K+ 2.8 (hypokalemia from purging), Na+ 132. Glucose: 55 (hypoglycemia). Albumin: 2.5. CBC: Hb 10.0, WBC 3,000 (leucopenia), platelets normal. LFT: Mildly elevated. TFT: Low T3 (sick euthyroid syndrome — adaptive). Cortisol: Elevated (stress response). Estradiol: Low (amenorrhea). DEXA: Osteopenia (low estrogen). Amylase: Elevated (parotid — purging marker).",
    "diagnosis": "Anorexia nervosa — restricting and binge-purge subtype, severe (BMI 14.5) with medical complications",
    "differentials": ["Anorexia nervosa", "Bulimia nervosa", "Major depressive disorder with appetite loss", "Hyperthyroidism", "Malignancy (occult)", "Inflammatory bowel disease", "Celiac disease"],
    "learning_points": [
      "Anorexia nervosa criteria: Restriction of intake → low body weight + Intense fear of gaining weight + Body image distortion",
      "Medical emergencies: Bradycardia, prolonged QTc, severe hypokalemia, hypoglycemia — cardiac arrest is leading cause of death",
      "Refeeding syndrome: Starting nutrition too aggressively causes fatal hypophosphatemia — start LOW and GO SLOW (10-15 kcal/kg/day)",
      "Treatment: Nutritional rehabilitation + Family-based therapy (FBT/Maudsley approach) for adolescents + SSRI if comorbid depression/OCD",
      "No medication is FDA-approved for anorexia nervosa — treatment is primarily psychological and nutritional",
      "Anorexia has the HIGHEST mortality of any psychiatric disorder (5-10% mortality rate)"
    ],
    "india_context": "Eating disorders are increasingly recognized in urban India, especially among affluent adolescent girls. Previously considered Western, now reported from metro cities. Cultural factors: Body image pressure from media, competitive academic environment. NIMHANS Bengaluru and AIIMS Delhi have specialized eating disorder clinics. Most Indian psychiatrists receive limited training in eating disorders. Early identification by pediatricians and school counselors is critical."
  }
]
