[
  {
    "id": "RESP-001",
    "title": "Drug-Resistant Pulmonary Tuberculosis",
    "specialty": "respiratory",
    "difficulty": "advanced",
    "source": "NTEP Guidelines - DR-TB Management",
    "demographics": {"age": 30, "gender": "Male", "location": "Dharavi, Mumbai"},
    "chief_complaint": "Persistent cough with blood-tinged sputum despite 2 months of ATT",
    "presentation": "A 30-year-old autorickshaw driver from Dharavi, Mumbai presents with persistent productive cough, hemoptysis, evening fever, and weight loss despite completing 2 months of intensive phase ATT. His sputum remains smear-positive. He lives in a 10x10 ft room with 6 family members. He admits to irregular medication intake in the first month due to side effects.",
    "vital_signs": {"bp": "110/70", "hr": 92, "rr": 22, "temp": 38.0, "spo2": 93},
    "history": "Cough with mucopurulent sputum for 5 months. Blood-tinged sputum for 1 month. Evening fever with night sweats. Weight loss 8 kg. Started DOTS Category I ATT 2 months ago. Irregular intake first month (missed 15 doses) due to nausea and joint pains. Sputum still smear-positive at 2 months. Lives in overcrowded slum. Wife and 2 children living in same room. No HIV risk factors.",
    "physical_exam": "Thin, ill-appearing male. BMI 17.5. Finger clubbing. Chest: Reduced breath sounds right upper zone, coarse crepitations bilateral upper zones. Amphoric breathing right apex (cavity). No lymphadenopathy. No hepatosplenomegaly.",
    "investigations": "Sputum GeneXpert MTB/RIF: MTB detected, Rifampicin RESISTANT. Sputum culture (MGIT): Growing, awaiting DST. Line probe assay (LPA): Resistant to Isoniazid and Rifampicin (MDR-TB confirmed). CXR: Bilateral upper zone cavities (right 4 cm, left 2 cm), fibrosis, volume loss. HRCT: Multiple cavities, tree-in-bud opacities, bronchiectasis. HIV: Negative. HbA1c: 5.4%. LFT: Normal. Renal: Normal. Audiometry: Normal baseline. Visual acuity: 6/6 bilateral.",
    "diagnosis": "Multi-drug resistant pulmonary tuberculosis (MDR-TB: resistant to at least Isoniazid + Rifampicin)",
    "differentials": ["MDR-TB", "XDR-TB", "Non-tuberculous mycobacterial infection", "Lung abscess (anaerobic)", "Chronic pulmonary aspergillosis", "Bronchiectasis with secondary infection"],
    "learning_points": [
      "GeneXpert MTB/RIF detects rifampicin resistance in 2 hours - proxy for MDR-TB",
      "MDR-TB: Resistant to at least INH + RIF. Pre-XDR: + fluoroquinolone OR injectable. XDR: + both",
      "New shorter all-oral MDR-TB regimen (BPaL): Bedaquiline + Pretomanid + Linezolid (9 months)",
      "India's NTEP adopted the shorter all-oral regimen in 2022",
      "Contact tracing mandatory: All household members need screening (symptom screen + CXR + IGRA/TST)",
      "Treatment success in MDR-TB: ~55% globally, improving with new drugs"
    ],
    "india_context": "India has the highest MDR-TB burden globally (~130,000 cases/year). Dharavi's population density (>270,000/km²) makes TB transmission intense. NTEP provides free MDR-TB treatment including bedaquiline through PMDT (Programmatic Management of Drug-resistant TB). Nikshay Poshan Yojana provides Rs 500/month nutritional support to TB patients."
  },
  {
    "id": "RESP-002",
    "title": "Severe Community-Acquired Pneumonia with Empyema",
    "specialty": "respiratory",
    "difficulty": "intermediate",
    "source": "JAPI - CAP Guidelines India",
    "demographics": {"age": 55, "gender": "Male", "location": "Ranchi, Jharkhand"},
    "chief_complaint": "High fever, cough, and chest pain for 7 days",
    "presentation": "A 55-year-old coal mine worker from Ranchi presents with high-grade fever with rigors, productive cough with rust-colored sputum, and right-sided pleuritic chest pain for 7 days. He is a chronic smoker (30 pack-years) and heavy alcohol user. He presents with respiratory distress and confusion.",
    "vital_signs": {"bp": "85/55", "hr": 120, "rr": 34, "temp": 39.8, "spo2": 85},
    "history": "Cough for 10 days, initially dry then productive with rust-colored sputum. High fever with rigors for 7 days. Right-sided chest pain, worse on inspiration. Progressive breathlessness. Confused since this morning. Smoker 30 pack-years (bidis). Heavy alcohol use (country liquor). Works in open-cast coal mine (dust exposure). No diabetes known. No prior hospitalizations. No TB history.",
    "physical_exam": "Toxic, confused (GCS 13), tachypneic, using accessory muscles. Right chest: Stony dull percussion, absent breath sounds, absent vocal resonance, reduced chest wall movement (pleural effusion). Left chest: Bronchial breathing left lower zone. Chest wall tenderness right side. No clubbing.",
    "investigations": "CXR: Right-sided whiteout (massive pleural effusion), left lower zone consolidation. CT chest: Right-sided loculated pleural effusion with enhancing pleura (empyema), left lower lobe consolidation with air bronchograms. Pleural fluid: Pus (frank empyema). pH 6.9, Glucose <40, LDH >1000, Protein 5.5, WBC 50,000 (neutrophilic). Gram stain: Gram-positive diplococci. Pleural fluid culture: Streptococcus pneumoniae. Blood cultures: S. pneumoniae (bacteremia). CBC: WBC 24,000, Hb 10.5, Platelets 450,000. Procalcitonin: 12 ng/mL. ABG: Type 1 respiratory failure. CURB-65 score: 4 (severe).",
    "diagnosis": "Severe community-acquired pneumonia (Streptococcus pneumoniae) complicated by empyema thoracis and septic shock",
    "differentials": ["CAP with empyema", "Lung abscess with pleural extension", "TB pleural effusion", "Mesothelioma", "Parapneumonic effusion (simple)", "Pulmonary infarction"],
    "learning_points": [
      "CURB-65 score ≥3: ICU admission recommended (Confusion, Urea >7, RR ≥30, BP <90/60, Age ≥65)",
      "Empyema criteria: Pleural fluid pH <7.2, glucose <40, LDH >1000, or frank pus - needs drainage",
      "Intercostal chest drain (ICD) is mandatory for empyema - antibiotics alone insufficient",
      "CAP empiric therapy (severe): IV beta-lactam (ceftriaxone/piperacillin-tazobactam) + macrolide/fluoroquinolone",
      "S. pneumoniae remains the commonest cause of CAP globally and in India",
      "Alcohol and smoking are major risk factors for complicated pneumonia"
    ],
    "india_context": "CAP causes significant mortality in India, especially in malnourished, alcoholic, and COPD patients. Coal miners in Jharkhand have high rates of pneumoconiosis predisposing to infections. PCV (Pneumococcal Conjugate Vaccine) was introduced in India's UIP but adult pneumococcal vaccination rates remain extremely low."
  },
  {
    "id": "RESP-003",
    "title": "Acute Severe Asthma (Status Asthmaticus)",
    "specialty": "respiratory",
    "difficulty": "beginner",
    "source": "GINA Guidelines - Asthma Management India",
    "demographics": {"age": 20, "gender": "Female", "location": "Delhi"},
    "chief_complaint": "Severe breathlessness and wheeze not responding to inhalers",
    "presentation": "A 20-year-old college student from Delhi presents during November (Diwali season, high pollution) with severe breathlessness, audible wheeze, and inability to speak in full sentences for 6 hours. She has known asthma since childhood but has been using only salbutamol rescue inhaler without any controller medication. She ran out of her inhaler yesterday. She was exposed to heavy firecracker smoke during Diwali celebrations.",
    "vital_signs": {"bp": "120/80", "hr": 130, "rr": 35, "temp": 36.8, "spo2": 88},
    "history": "Known asthmatic since age 8. Uses only salbutamol MDI as needed (no controller therapy). Frequency of rescue inhaler use: 4-5 times daily (poorly controlled). Previous ICU admission for asthma at age 15. Ran out of salbutamol yesterday. Heavy exposure to firecracker smoke last night (Diwali). Woke up at 3 AM with severe breathlessness, audible wheeze. Used neighbor's inhaler 6 puffs - minimal relief. Cannot speak full sentences. No fever, no sputum.",
    "physical_exam": "Sitting upright, tripod position, severe distress. Unable to speak full sentences. Using accessory muscles (sternocleidomastoid, intercostals). Pulsus paradoxus 25 mmHg. Chest: Bilateral diffuse expiratory and inspiratory wheeze. Air entry markedly reduced bilaterally. SILENT CHEST in right lower zone (ominous - too tight to wheeze). No cyanosis yet. Tachycardic.",
    "investigations": "Peak flow: Unable to perform (too dyspneic). SpO2: 88% on room air. ABG: pH 7.32, PaCO2 48 (rising - ominous, indicates fatigue), PaO2 58, HCO3 24. CXR (portable): Hyperinflated lungs, no pneumothorax, no consolidation. CBC: WBC 11,000 (eosinophilia 12%). No fever to suggest infection.",
    "diagnosis": "Life-threatening acute severe asthma (status asthmaticus) with impending respiratory failure",
    "differentials": ["Acute severe asthma", "Acute COPD exacerbation", "Vocal cord dysfunction", "Allergic bronchopulmonary aspergillosis", "Foreign body aspiration", "Anaphylaxis"],
    "learning_points": [
      "Life-threatening features: Silent chest, cyanosis, bradycardia, hypotension, confusion, PaCO2 normal/rising",
      "Rising PaCO2 in acute asthma = respiratory muscle fatigue - prepare for intubation",
      "Immediate treatment: Oxygen + continuous nebulized salbutamol + ipratropium + IV corticosteroids + IV MgSO4",
      "NEVER sedate or give beta-blockers in acute asthma",
      "Diwali air pollution spike is a major trigger in North India - AQI >500 in Delhi",
      "This patient needs STEP-UP to ICS-formoterol controller therapy on discharge (GINA Step 3-4)"
    ],
    "india_context": "Delhi air pollution (stubble burning + Diwali firecrackers + vehicular) causes massive spikes in asthma exacerbations. AQI exceeds 500 ('severe plus') post-Diwali. India has ~30 million asthmatics. Most use only rescue inhalers due to steroid phobia and cost. GINA India recommends ICS-formoterol MART (maintenance and reliever therapy) approach."
  },
  {
    "id": "RESP-004",
    "title": "COPD Acute Exacerbation with Type 2 Respiratory Failure",
    "specialty": "respiratory",
    "difficulty": "intermediate",
    "source": "GOLD Guidelines - Indian Adaptation",
    "demographics": {"age": 62, "gender": "Male", "location": "Patna, Bihar"},
    "chief_complaint": "Worsening breathlessness with drowsiness for 3 days",
    "presentation": "A 62-year-old retired farmer from rural Bihar presents with progressive breathlessness, increased sputum production (greenish), and drowsiness for 3 days. He has been a smoker (40 bidi pack-years) and also has prolonged biomass fuel smoke exposure (cooking with cow dung cakes). He was diagnosed with COPD 5 years ago but uses medications intermittently.",
    "vital_signs": {"bp": "150/90", "hr": 110, "rr": 10, "temp": 37.8, "spo2": 78},
    "history": "Known COPD for 5 years (GOLD Group D/E). Progressive dyspnea worsening over 3 days. Sputum: increased volume, became greenish (suggesting infection). Drowsy and confused since morning. Smokes 40 bidi pack-years. Wife cooks with biomass fuel (cow dung cakes, wood) in poorly ventilated kitchen - lifelong exposure. Uses tiotropium irregularly. No home oxygen. Previous exacerbation 3 months ago (hospitalized). No inhaler technique training.",
    "physical_exam": "Drowsy (CO2 narcosis), cyanosed. Barrel chest. Pursed lip breathing. Using accessory muscles. Asterixis (flapping tremor). Chest: Hyperresonant, diminished breath sounds globally, scattered rhonchi and wheeze. Prolonged expiration. No peripheral edema (no cor pulmonale currently). Bounding pulse (CO2 retention).",
    "investigations": "ABG (on room air): pH 7.28, PaCO2 78 mmHg, PaO2 45 mmHg, HCO3 34 (acute-on-chronic respiratory acidosis). SpO2 78%. CXR: Hyperinflated lungs, flat diaphragm, increased AP diameter, no consolidation, no pneumothorax. CBC: WBC 14,000 (neutrophilia), Hb 16.5 (polycythemia secondary to chronic hypoxemia). Sputum: Gram-negative rods (likely H. influenzae). Spirometry (old): FEV1 32% predicted, FEV1/FVC 0.55. BNP: 180 (borderline - ?early cor pulmonale).",
    "diagnosis": "Acute infective exacerbation of COPD with type 2 (hypercapnic) respiratory failure and CO2 narcosis",
    "differentials": ["COPD acute exacerbation", "Community-acquired pneumonia", "Congestive heart failure", "Pulmonary embolism", "Pneumothorax", "Metabolic encephalopathy"],
    "learning_points": [
      "Target SpO2 in COPD: 88-92% - high-flow oxygen can worsen CO2 retention (Haldane effect + V/Q mismatch)",
      "Non-invasive ventilation (NIV/BiPAP) is first-line for acute hypercapnic respiratory failure in COPD",
      "NIV indications: pH <7.35 with PaCO2 >45 with respiratory distress",
      "Anthonisen criteria for antibiotics: Increased dyspnea + increased sputum volume + increased sputum purulence (2 of 3)",
      "Biomass fuel exposure causes COPD identical to smoking - major cause in Indian women and rural men",
      "GOLD E group (≥2 exacerbations or ≥1 hospitalization): LAMA + LABA ± ICS"
    ],
    "india_context": "India has ~30 million COPD patients. Biomass fuel exposure accounts for 40-50% of COPD in India (especially women). Bidi smoking is more harmful than cigarettes (higher tar, unfiltered). BOLD (Burden of Obstructive Lung Disease) India study showed COPD prevalence of 4.2% in adults >35 years. Most patients diagnosed late due to low spirometry access."
  },
  {
    "id": "RESP-005",
    "title": "Pulmonary Tuberculosis with Massive Hemoptysis",
    "specialty": "respiratory",
    "difficulty": "intermediate",
    "source": "NTEP - Hemoptysis Management",
    "demographics": {"age": 45, "gender": "Male", "location": "Varanasi, UP"},
    "chief_complaint": "Coughing up large amounts of blood",
    "presentation": "A 45-year-old weaver from Varanasi presents with sudden onset massive hemoptysis (estimated 300 mL of bright red blood in 2 hours). He has a known history of pulmonary TB treated 3 years ago (completed 6 months ATT, declared cured). He has been having intermittent mild hemoptysis for the past 2 months which he ignored.",
    "vital_signs": {"bp": "95/60", "hr": 120, "rr": 28, "temp": 37.0, "spo2": 90},
    "history": "Sudden onset coughing up bright red blood - ~300 mL in 2 hours (massive hemoptysis). History of treated pulmonary TB 3 years ago (Cat I DOTS, completed, declared cured). Mild hemoptysis (streaks) intermittently for 2 months, not investigated. No current fever or night sweats. Weight stable. No anticoagulant use. Smokes 10 bidis/day. Occupational exposure to cotton dust (weaving). No previous hemoptysis investigation.",
    "physical_exam": "Anxious, blood-stained sputum. Tachycardic, hypotensive. Pallor. Chest: Reduced breath sounds right upper zone, coarse crepitations right upper zone. No wheeze. Oropharynx: Active blood in airway.",
    "investigations": "CXR: Right upper lobe cavity (4 cm) with fungal ball (Aspergilloma - meniscus/air crescent sign). CT chest (after stabilization): Right upper lobe thick-walled cavity with intracavitary mass (aspergilloma), surrounding fibrosis and bronchiectasis. No active TB features. Sputum AFB: Negative x 2. GeneXpert: MTB not detected. Sputum fungal culture: Aspergillus fumigatus. Aspergillus-specific IgG: Strongly positive. CBC: Hb 7.5 (acute blood loss anemia). Coagulation: Normal.",
    "diagnosis": "Aspergilloma (pulmonary mycetoma) in post-TB cavity with massive hemoptysis",
    "differentials": ["Aspergilloma with hemoptysis", "TB reactivation", "Bronchiectasis with hemoptysis", "Bronchogenic carcinoma", "Rasmussen aneurysm (TB)", "Bronchial artery malformation"],
    "learning_points": [
      "Massive hemoptysis: >300 mL in 24 hours or >100 mL/hour - life-threatening",
      "First priority: Airway protection - position patient bleeding-side-down, secure airway",
      "Bronchial artery embolization (BAE) is first-line for massive hemoptysis (>90% success)",
      "Aspergilloma develops in pre-existing TB cavities in 10-15% of cases",
      "Air crescent sign / meniscus sign on imaging is characteristic of aspergilloma",
      "Definitive treatment: Surgical resection (lobectomy) for recurrent hemoptysis"
    ],
    "india_context": "Post-TB sequelae including aspergilloma and bronchiectasis are common in India due to the high TB burden. CPA (chronic pulmonary aspergillosis) is estimated to affect 290,000 Indians. Most tertiary centers offer BAE. National guidelines recommend screening post-TB patients with persistent symptoms for fungal complications."
  },
  {
    "id": "RESP-006",
    "title": "Interstitial Lung Disease - Hypersensitivity Pneumonitis",
    "specialty": "respiratory",
    "difficulty": "advanced",
    "source": "Indian Chest Society - ILD Registry",
    "demographics": {"age": 50, "gender": "Female", "location": "Jodhpur, Rajasthan"},
    "chief_complaint": "Progressive breathlessness and dry cough for 8 months",
    "presentation": "A 50-year-old woman from Jodhpur presents with progressive exertional dyspnea and dry cough for 8 months. She keeps pigeons as a hobby (>50 birds on her terrace for 10 years). She has noticed her symptoms improve when she visits her daughter's house in Jaipur (away from pigeons) and worsen on return. She has developed finger clubbing.",
    "vital_signs": {"bp": "120/80", "hr": 90, "rr": 24, "temp": 37.0, "spo2": 89},
    "history": "Progressive dyspnea on exertion for 8 months (MMRC Grade 3). Dry non-productive cough. No wheeze. No fever. Weight loss 4 kg. Keeps >50 pigeons on terrace for 10 years (pigeon fancier). Symptoms clearly worse at home, improve when away (temporal association with pigeon exposure). No smoking. No occupational dust exposure. No connective tissue disease symptoms. No drug history (amiodarone, MTX, nitrofurantoin).",
    "physical_exam": "Tachypneic at rest. Clubbing grade III. Cyanosis on exertion. Chest: Bilateral mid and lower zone fine inspiratory (Velcro) crepitations. No wheeze. 6-minute walk test: Desaturation from 89% to 78% (significant exercise desaturation).",
    "investigations": "HRCT chest: Diffuse ground-glass opacities with mosaic attenuation (air trapping), centrilobular nodules, and areas of fibrosis in upper and mid zones. No honeycombing. Spirometry: FVC 55% predicted, FEV1 58%, FEV1/FVC 0.85 (restrictive pattern). DLCO: 40% predicted (severely reduced). Serum precipitins (pigeon IgG): Strongly positive. BAL: Lymphocytosis 45% (CD8 predominant, low CD4/CD8 ratio). ANA, RF: Negative. CBC: Normal. CRP: 35.",
    "diagnosis": "Chronic hypersensitivity pneumonitis (pigeon fancier's lung / bird fancier's disease) with fibrosis",
    "differentials": ["Hypersensitivity pneumonitis", "Idiopathic pulmonary fibrosis", "Sarcoidosis", "Connective tissue disease-ILD", "Drug-induced ILD", "Chronic eosinophilic pneumonia"],
    "learning_points": [
      "HP has acute (4-6 hours post-exposure), subacute, and chronic (insidious fibrosis) forms",
      "Antigen avoidance is the single most important intervention",
      "HRCT: Mosaic attenuation + centrilobular nodules + ground-glass in upper/mid zones = HP",
      "BAL lymphocytosis with low CD4/CD8 ratio supports HP diagnosis",
      "IPF vs chronic HP: IPF = lower zone predominant, UIP pattern. HP = upper/mid zone, mosaic pattern",
      "Treatment: Antigen avoidance + corticosteroids ± mycophenolate for fibrotic HP"
    ],
    "india_context": "Pigeon keeping is culturally significant in Rajasthan and parts of North India, making pigeon fancier's lung relatively common. The ILD-India registry showed HP as the second commonest ILD (after IPF) in India. Hot and humid climate in some regions promotes mold-related HP (farmer's lung in South India). Awareness among physicians about HP as a cause of ILD is increasing."
  },
  {
    "id": "RESP-007",
    "title": "Pleural Effusion - Meigs Syndrome",
    "specialty": "respiratory",
    "difficulty": "advanced",
    "source": "JAPI - Unusual Causes of Pleural Effusion",
    "demographics": {"age": 55, "gender": "Female", "location": "Coimbatore, Tamil Nadu"},
    "chief_complaint": "Breathlessness and abdominal distension for 1 month",
    "presentation": "A 55-year-old postmenopausal woman presents with progressive breathlessness and abdominal distension for 1 month. She was initially suspected to have ovarian cancer with malignant effusion. However, repeated pleural fluid cytology is negative for malignant cells. She has a large pelvic mass on imaging.",
    "vital_signs": {"bp": "130/80", "hr": 88, "rr": 24, "temp": 37.0, "spo2": 92},
    "history": "Progressive breathlessness for 1 month. Abdominal distension noticed for 3 weeks. No cough. No weight loss initially. Postmenopausal (menopause at 50). No postmenopausal bleeding. No family history of ovarian/breast cancer. CA-125 mildly elevated. Initially suspected malignancy.",
    "physical_exam": "Right-sided stony dull percussion, absent breath sounds (large pleural effusion). Abdomen: Distended with ascites, large pelvic mass palpable (firm, mobile, non-tender). No lymphadenopathy. No cachexia.",
    "investigations": "CXR: Large right pleural effusion. Pleural fluid: Transudative (Protein 2.5, LDH 120, Light's criteria borderline). Cytology: Negative for malignant cells x 3. CT abdomen-pelvis: Large right ovarian mass (12 cm, solid), moderate ascites, right pleural effusion. CA-125: 85 U/mL (mildly elevated). Other tumor markers normal. Ascitic fluid: Transudative, no malignant cells.",
    "diagnosis": "Meigs syndrome (ovarian fibroma with ascites and pleural effusion)",
    "differentials": ["Meigs syndrome", "Ovarian carcinoma with malignant effusion", "Hepatic cirrhosis", "Heart failure", "Nephrotic syndrome", "TB pleural effusion"],
    "learning_points": [
      "Meigs syndrome: Ovarian fibroma + ascites + pleural effusion (resolves after tumor removal)",
      "Effusion is typically RIGHT-sided (due to phrenic lymphatic drainage pattern)",
      "Fluid is transudative despite appearing 'exudative' by Light's criteria",
      "Key: Negative cytology in setting of ovarian mass should raise suspicion for Meigs",
      "Complete resolution of effusion and ascites post-oophorectomy confirms diagnosis",
      "Pseudo-Meigs: Same triad but with other ovarian tumors or pelvic tumors"
    ],
    "india_context": "Ovarian tumors are the third commonest gynecological malignancy in India. Meigs syndrome is important to recognize to avoid labeling benign conditions as malignant, sparing patients unnecessary chemotherapy."
  },
  {
    "id": "RESP-008",
    "title": "Obstructive Sleep Apnea with Metabolic Syndrome",
    "specialty": "respiratory",
    "difficulty": "intermediate",
    "source": "JAPI - OSA in Indian Population",
    "demographics": {"age": 45, "gender": "Male", "location": "Chandigarh, Punjab"},
    "chief_complaint": "Excessive daytime sleepiness and loud snoring",
    "presentation": "A 45-year-old Punjabi businessman presents with excessive daytime sleepiness (Epworth score 18/24), loud snoring reported by wife, witnessed apneas during sleep, and morning headaches. BMI 36. He has uncontrolled hypertension despite 3 antihypertensives and recently diagnosed type 2 diabetes. He fell asleep while driving last week, causing a minor accident.",
    "vital_signs": {"bp": "155/100", "hr": 80, "rr": 16, "temp": 37.0, "spo2": 94},
    "history": "Loud snoring for 5 years, worsening. Wife reports witnessed apneic episodes (stops breathing for 15-20 seconds). Excessive daytime sleepiness - falls asleep in meetings, while watching TV, nearly fell asleep driving. Morning headaches. Nocturia 2-3 times. Uncontrolled hypertension on amlodipine + telmisartan + chlorthalidone. Type 2 DM diagnosed 1 year ago. BMI 36. Neck circumference 44 cm. No alcohol. Family: Father had 'snoring and heart problems'.",
    "physical_exam": "Obese (BMI 36), neck circumference 44 cm. Crowded oropharynx (Mallampati IV). Retrognathia. BP 155/100 (resistant hypertension). No edema. Chest: Clear. CVS: Normal.",
    "investigations": "Polysomnography: AHI 45 events/hour (severe OSA), lowest SpO2 68%, 80% of events are obstructive apneas. ESS: 18/24. HbA1c: 8.2%. Lipid profile: Dyslipidemia. TSH: Normal. Echo: Concentric LVH, LVEF 55%. Pulmonary function: Mild restriction (obesity).",
    "diagnosis": "Severe obstructive sleep apnea (AHI 45) with metabolic syndrome and resistant hypertension",
    "differentials": ["Obstructive sleep apnea", "Central sleep apnea", "Obesity hypoventilation syndrome", "Narcolepsy", "Hypothyroidism", "Depression-related hypersomnia"],
    "learning_points": [
      "OSA severity: Mild (AHI 5-15), Moderate (15-30), Severe (>30)",
      "OSA is an independent risk factor for hypertension, MI, stroke, arrhythmias",
      "Resistant hypertension (uncontrolled on ≥3 drugs) - always screen for OSA",
      "CPAP is first-line treatment for moderate-severe OSA",
      "South Asians develop OSA at lower BMI due to craniofacial structure",
      "Epworth Sleepiness Scale ≥10 is abnormal, ≥16 indicates severe sleepiness"
    ],
    "india_context": "OSA prevalence in India estimated 9-14% in urban males. Grossly underdiagnosed due to low awareness and limited sleep lab access. ICMR recommends screening in patients with resistant hypertension, uncontrolled DM, and unexplained polycythemia. CPAP compliance is challenged by noise, discomfort, and cultural factors (joint family sleeping arrangements)."
  }
]
