{
  "case_id": "017ca640",
  "case_data": {
    "patient": {
      "age": 42,
      "gender": "Female",
      "location": "Lucknow, Uttar Pradesh"
    },
    "chief_complaint": "Recurrent kidney stones, generalized body aches, and fatigue for 8 months",
    "initial_presentation": "A 42-year-old homemaker presents to the Medicine OPD with complaints of recurrent bilateral flank pain due to kidney stones, generalized bone pain, muscle weakness, and profound fatigue over the past 8 months. She was recently diagnosed with osteoporosis on a DEXA scan, which was surprising given her premenopausal status. She also reports increased thirst, frequent urination, and constipation.",
    "vital_signs": {
      "bp": "150/92",
      "hr": 78,
      "rr": 16,
      "temp": 37.0,
      "spo2": 98
    },
    "stages": [
      {
        "stage": "history",
        "info": "She has passed 3 kidney stones in the past 8 months (calcium-based, confirmed on stone analysis after first episode). She reports diffuse bone pain in the lower back, hips, and shins, worsening over months. Proximal muscle weakness — difficulty climbing stairs and getting up from the floor. Increased thirst (polydipsia, ~4-5 liters/day) and polyuria. Chronic constipation for 6 months (no blood in stool). Poor appetite, nausea, and 4 kg weight loss. Episodes of confusion and low mood — family reports personality change. No history of neck surgery or irradiation. No lithium, thiazide diuretic, or calcium/vitamin D supplement use. No family history of endocrine tumors or kidney stones. No history of peptic ulcer disease. Premenopausal — regular menses until 4 months ago when she developed oligomenorrhea."
      },
      {
        "stage": "physical_exam",
        "info": "Appears fatigued and mildly dehydrated (dry oral mucosa). BMI 23. No goiter. Neck examination: A small, firm, mobile, non-tender nodule (~1.5 cm) palpable in the right lower neck, posterior to the thyroid lobe — not moving with swallowing (suggestive of parathyroid origin rather than thyroid). Cardiovascular: Shortened QT interval on bedside rhythm strip. Abdomen: Mild bilateral renal angle tenderness. No hepatosplenomegaly. Musculoskeletal: Proximal muscle weakness (grade 4/5 in hip flexors and deltoids), no fasciculations, normal reflexes. Neuropsychiatric: Mildly depressed affect, psychomotor slowing, oriented to time/place/person. Skin: No café-au-lait spots, no subcutaneous nodules."
      },
      {
        "stage": "labs",
        "info": "Serum calcium (corrected): 13.2 mg/dL (elevated; normal 8.5-10.5). Ionized calcium: 1.72 mmol/L (elevated; normal 1.12-1.32). Serum phosphate: 1.8 mg/dL (low; normal 2.5-4.5). Serum albumin: 3.8 g/dL (normal). Intact PTH (iPTH): 385 pg/mL (markedly elevated; normal 10-65 — inappropriately elevated for hypercalcemia). Alkaline phosphatase (ALP): 480 U/L (elevated; normal 44-147). 24-hour urine calcium: 420 mg/day (elevated; >400 = hypercalciuria, rules out familial hypocalciuric hypercalcemia). Serum creatinine: 1.4 mg/dL (mildly elevated). Vitamin D (25-OH): 12 ng/mL (deficient — common in India, can exacerbate PHPT presentation). X-ray hands: Subperiosteal bone resorption in radial aspect of middle phalanges. X-ray skull: 'Salt and pepper' skull appearance. DEXA scan: T-score lumbar spine -2.8, femoral neck -3.1 (osteoporosis). Sestamibi (Tc-99m) parathyroid scan: Single focus of increased uptake inferior to the right thyroid lobe, with delayed washout — consistent with a right inferior parathyroid adenoma. Neck ultrasound: 1.6 cm hypoechoic lesion posterior to right thyroid lobe with a feeding polar vessel. Thyroid appears normal. ECG: Shortened QT interval. CT KUB: Bilateral nephrolithiasis (3 stones in right kidney, 1 in left kidney, calcium-containing). Serum calcitonin: Normal. Serum prolactin, IGF-1: Normal. Fasting glucose: 108 mg/dL."
      }
    ],
    "diagnosis": "Primary hyperparathyroidism (PHPT) due to a single right inferior parathyroid adenoma with symptomatic hypercalcemia (nephrolithiasis, osteoporosis, neuropsychiatric symptoms, and GI symptoms)",
    "differentials": [
      "Primary hyperparathyroidism (parathyroid adenoma)",
      "Malignancy-associated hypercalcemia (PTHrP-mediated or bony metastases)",
      "Familial hypocalciuric hypercalcemia (FHH)",
      "Vitamin D intoxication or granulomatous disease (sarcoidosis, tuberculosis)",
      "Multiple endocrine neoplasia type 1 (MEN1) with primary hyperparathyroidism"
    ],
    "learning_points": [
      "Primary hyperparathyroidism presents with the classic mnemonic 'Bones, Stones, Abdominal Groans, and Psychiatric Moans' — this patient demonstrates all four components (osteoporosis/subperiosteal resorption, nephrolithiasis, constipation/nausea, depression/confusion).",
      "In PHPT, both calcium AND PTH are elevated (or PTH is inappropriately normal for the high calcium). In malignancy-associated hypercalcemia, PTH is suppressed (<20 pg/mL). This distinction is critical for diagnosis.",
      "24-hour urine calcium >200 mg/day (or calcium-creatinine clearance ratio >0.02) helps differentiate PHPT from familial hypocalciuric hypercalcemia (FHH), where urine calcium is low — important because FHH does NOT require surgery.",
      "Concurrent vitamin D deficiency (extremely common in India) can mask the severity of PHPT by lowering the serum calcium and raising PTH further. Vitamin D should be cautiously repleted before or after parathyroidectomy. In India, PHPT often presents with more severe skeletal disease (osteitis fibrosa cystica) compared to the West, partly due to coexisting vitamin D deficiency."
    ],
    "atypical_features": "This case is challenging because: (1) The patient is premenopausal, which makes the finding of severe osteoporosis unexpected and should prompt evaluation for secondary causes. (2) Coexisting vitamin D deficiency — very common in India — complicates interpretation as it can worsen bone disease and elevate PTH further, raising the question of whether the elevated PTH is simply secondary to vitamin D deficiency (but the markedly elevated calcium rules this out). (3) The palpable neck nodule mimicking a thyroid nodule could mislead the clinician — parathyroid adenomas are rarely palpable and when they are, parathyroid carcinoma must be considered (though imaging and biochemistry here favor adenoma). (4) MEN1 must be excluded in a young patient with PHPT — screening for pituitary and pancreatic tumors is warranted.",
    "specialty": "endocrinology",
    "difficulty": "intermediate",
    "id": "017ca640"
  },
  "timestamp": "2026-02-14T16:27:09.247975"
}