{
  "case_id": "575004f6",
  "case_data": {
    "patient": {
      "age": 28,
      "gender": "Female",
      "location": "Jaipur, Rajasthan"
    },
    "chief_complaint": "Progressive pain and swelling of the right wrist for 3 months with recent onset numbness in the thumb, index, and middle fingers",
    "initial_presentation": "A 28-year-old woman from Jaipur, working as a block-printing artisan, presents with a 3-month history of progressive right wrist pain and diffuse swelling over the dorsal aspect. Over the past 3 weeks, she has developed tingling and numbness in her right thumb, index, and middle fingers, especially at night, along with difficulty gripping her printing blocks.",
    "vital_signs": {
      "bp": "118/74",
      "hr": 78,
      "rr": 16,
      "temp": 37.1,
      "spo2": 99
    },
    "stages": [
      {
        "stage": "history",
        "info": "The patient reports insidious onset of dull aching pain over the dorsum of the right wrist 3 months ago, initially attributed to overuse from her block-printing work. The pain has gradually worsened and is now present at rest. She noticed a diffuse boggy swelling over the dorsal wrist that has slowly increased in size. For the past 3 weeks, she has developed numbness and tingling in the thumb, index, and middle fingers of the right hand, worse at night and often waking her from sleep (nocturnal paresthesias). She reports difficulty holding her printing tools and occasionally drops small objects. She also feels stiffness in the wrist in the morning lasting 30-45 minutes. She denies any trauma, fever, weight loss, or skin rashes. There is no history of cough, hemoptysis, or contact with tuberculosis patients. She has no significant past medical history, no prior surgeries, and is not on any medications. She is a vegetarian. Family history is unremarkable. She has not been evaluated for rheumatological disease previously. She tried local oil massage and over-the-counter diclofenac with minimal relief."
      },
      {
        "stage": "physical_exam",
        "info": "Right wrist: Diffuse, boggy, non-tender to mildly tender swelling over the dorsal aspect of the wrist extending along the extensor tendon sheaths. The swelling is soft, fluctuant, and has a characteristic doughy consistency. No warmth or erythema. No sinus or discharge. The compound palmar ganglion test (cross-fluctuation between dorsal and volar aspects of the wrist through the carpal tunnel) is positive — pressure on the dorsal swelling causes a bulge on the volar aspect, suggesting tenosynovial fluid communicating through the carpal tunnel. Wrist range of motion: flexion 40 degrees (reduced from normal 80), extension 35 degrees (reduced from normal 70), radial and ulnar deviation mildly reduced. Grip strength: significantly reduced on the right compared to left. Tinel sign at the carpal tunnel: Positive — tapping over the volar wrist at the carpal tunnel reproduces tingling in the median nerve distribution. Phalen test: Positive at 20 seconds — wrist flexion reproduces paresthesias in the thumb, index, and middle fingers. Sensation: diminished light touch and pinprick over the palmar aspect of the thumb, index, middle finger, and radial half of ring finger (median nerve territory). Thenar muscles: no obvious wasting yet, but abductor pollicis brevis power is 4/5. No lymphadenopathy (axillary or epitrochlear). No other joint involvement. Chest examination: normal. No hepatosplenomegaly."
      },
      {
        "stage": "labs",
        "info": "Blood investigations: Hb 10.8 g/dL (mild anemia), TLC 7,200/mm3 with normal differential, ESR 48 mm/hr (elevated), CRP 18 mg/L (mildly elevated). Rheumatoid factor: Negative. Anti-CCP antibody: Negative. Serum uric acid: 4.2 mg/dL (normal). HbA1c: 5.2%. Mantoux test: 22 mm induration at 48 hours (strongly positive). X-ray right wrist AP and lateral: Soft tissue swelling around the wrist, periarticular osteopenia of the carpal bones, no joint space narrowing, no bony erosions, no calcification. Phemister triad (juxta-articular osteoporosis, peripherally located erosions, gradual joint space narrowing) — only osteoporosis is present at this stage. MRI right wrist (1.5T with gadolinium): Extensive tenosynovitis involving the flexor and extensor tendon sheaths with thickened synovium showing peripheral enhancement and central non-enhancing areas (rice body pattern). The hypertrophied synovium is seen compressing the median nerve within the carpal tunnel. Carpal bones show periarticular marrow edema but no erosions or destruction. No intraosseous abscess. Nerve conduction study: Prolonged distal motor latency of the right median nerve (5.8 ms, normal <4.2 ms) and reduced sensory nerve conduction velocity across the carpal tunnel, consistent with moderate carpal tunnel syndrome. Ultrasound-guided biopsy of tenosynovial tissue: Histopathology shows caseating granulomas with epithelioid cells, Langhans-type giant cells, and central caseous necrosis. ZN stain: Acid-fast bacilli seen (few). GeneXpert MTB/RIF: Mycobacterium tuberculosis detected, rifampicin resistance not detected. Chest X-ray PA: Normal, no pulmonary lesion."
      }
    ],
    "diagnosis": "Tuberculous tenosynovitis (compound palmar ganglion) of the right wrist with secondary carpal tunnel syndrome",
    "differentials": [
      "Tuberculous tenosynovitis (compound palmar ganglion)",
      "Rheumatoid arthritis with flexor tenosynovitis and secondary carpal tunnel syndrome",
      "De Quervain tenosynovitis (typically radial styloid, but can confuse early on)",
      "Atypical mycobacterial (non-tuberculous mycobacterial) tenosynovitis",
      "Giant cell tumor of tendon sheath (PVNS — pigmented villonodular synovitis)"
    ],
    "learning_points": [
      "Compound palmar ganglion is a classic presentation of tuberculous tenosynovitis of the wrist, characterized by a dumbbell-shaped or hourglass swelling with cross-fluctuation between the dorsal and volar aspects of the wrist through the carpal tunnel — this cross-fluctuation sign is pathognomonic and a high-yield clinical finding for exams",
      "Tuberculous tenosynovitis can cause secondary carpal tunnel syndrome by compression of the median nerve within the carpal tunnel by hypertrophied granulomatous synovium — any young patient presenting with carpal tunnel syndrome and associated wrist swelling in an endemic country like India should raise suspicion for TB tenosynovitis",
      "The 'rice bodies' seen on MRI (and sometimes intraoperatively as free-floating white bodies in the synovial fluid) are characteristic of tuberculous tenosynovitis, though they can also be seen in rheumatoid arthritis — rice bodies are composed of fibrin and collagen and represent chronic synovial inflammation",
      "Treatment of tuberculous tenosynovitis includes standard anti-tubercular therapy (ATT) with the RNTCP/NTEP regimen (2HRZE + 4HRE for extrapulmonary TB) combined with surgical synovectomy and carpal tunnel decompression when there is significant median nerve compression; early diagnosis and treatment prevent tendon rupture and irreversible nerve damage"
    ],
    "atypical_features": "The case is challenging because the patient presents primarily with carpal tunnel syndrome symptoms (nocturnal paresthesias, median nerve territory numbness) which may mislead the student toward idiopathic CTS or repetitive strain injury given her occupation as a block-printing artisan. The absence of classic systemic TB symptoms (no fever, no weight loss, no cough, normal chest X-ray), negative rheumatoid factor, and the young age of the patient require the student to recognize the significance of the boggy dorsal swelling with cross-fluctuation and the strongly positive Mantoux test in an endemic setting. The combination of extrapulmonary TB presenting as tenosynovitis with secondary nerve compression tests the student's ability to connect musculoskeletal and neurological findings to an infectious etiology.",
    "specialty": "orthopedics",
    "difficulty": "intermediate",
    "id": "575004f6"
  },
  "timestamp": "2026-02-14T16:45:40.071779"
}