{
  "case_id": "6bc31d91",
  "case_data": {
    "patient": {
      "age": 28,
      "gender": "Female",
      "location": "Jaipur, Rajasthan"
    },
    "chief_complaint": "Persistent pain and swelling in the left wrist for 4 months with progressive difficulty gripping objects",
    "initial_presentation": "A 28-year-old female schoolteacher from Jaipur presents with a 4-month history of progressive left wrist pain and swelling. She reports increasing difficulty holding chalk, writing on the blackboard, and wringing clothes. She denies any history of trauma but mentions she was treated for pulmonary tuberculosis 18 months ago with a completed ATT course.",
    "vital_signs": {
      "bp": "116/74",
      "hr": 80,
      "rr": 16,
      "temp": 37.2,
      "spo2": 99
    },
    "stages": [
      {
        "stage": "history",
        "info": "Pain is insidious in onset, dull aching, localized to the dorsal aspect of the left wrist, gradually progressive. Aggravated by wrist movements especially extension and gripping; partially relieved by rest and NSAIDs. Swelling noticed approximately 3 months ago, initially intermittent, now persistent and gradually increasing. She reports morning stiffness lasting 30-40 minutes. She experienced occasional low-grade evening fever (not documented) and mild weight loss (~3 kg) over the past 4 months. Appetite has been reduced. She completed 6 months of ATT (2HRZE + 4HR) for sputum-positive pulmonary TB 18 months ago and was declared cured. No history of trauma, no similar joint involvement elsewhere, no skin rash, no oral ulcers, no eye symptoms. No family history of TB or rheumatological disease. She is right-hand dominant but uses the left hand significantly for board work. No history of diabetes, immunosuppression, or HIV risk factors. She has not been investigated for the wrist complaint before — took NSAIDs and local application of pain-relief balm from a chemist shop."
      },
      {
        "stage": "physical_exam",
        "info": "Left wrist: Diffuse, boggy, non-tender to mildly tender swelling on the dorsal aspect of the wrist, extending over the extensor tendon sheaths. Skin is warm but not erythematous. No sinus or discharge. Cross-fluctuation test positive across the extensor retinaculum (compound palmar ganglion/hourglass swelling — fluid-filled swelling both above and below the extensor retinaculum). Wrist range of motion: Dorsiflexion 30° (normal 70°), palmar flexion 40° (normal 80°), radial deviation 10°, ulnar deviation 20°. Grip strength markedly reduced on the left (measured by hand dynamometer: 8 kg vs 26 kg on right). No triggering of fingers. Tenderness on palpation over the radiocarpal joint and distal radioulnar joint. No crepitus. Finkelstein test: Negative. Tinel's test at carpal tunnel: Mildly positive (occasional tingling in median nerve distribution — suggests early carpal tunnel involvement from synovial swelling). Allen test: Normal (vascular integrity preserved). No axillary or epitrochlear lymphadenopathy. Examination of other joints including bilateral knees, hips, shoulders, and small joints of hands: Normal. Chest examination: Clear, no adventitious sounds. Left elbow: Full range of motion, no swelling."
      },
      {
        "stage": "labs",
        "info": "Blood investigations: Hb 10.8 g/dL, TLC 7,800/mm³ (lymphocyte-predominant: 48% lymphocytes), ESR 52 mm/hr (elevated), CRP 28 mg/L (elevated). RA factor: Negative. Anti-CCP antibody: Negative. Serum uric acid: 4.1 mg/dL (normal). HbA1c: 5.2%. HIV I & II: Non-reactive. Mantoux test: 22 mm induration at 48 hours (strongly positive). X-ray left wrist AP and lateral: Periarticular osteoporosis (Phemister triad component), erosions at the radiocarpal joint with relative preservation of the joint space (unlike RA where joint space narrows early), soft tissue swelling. No calcifications. Chest X-ray PA view: Old fibrotic lesion in the right upper zone, no active infiltrates. MRI left wrist (1.5T with contrast): Diffuse synovial thickening with enhancement involving the radiocarpal joint, midcarpal joint, and extensor tendon sheaths. Multiple rice bodies within the thickened synovium (hypointense on T1 and T2 — classic for TB synovitis). Erosions in the scaphoid, lunate, and distal radius with marrow edema. No abscess. Synovial biopsy (ultrasound-guided from dorsal wrist synovium): Histopathology shows caseating granulomas with epithelioid cells, Langhans giant cells, and central caseous necrosis. ZN stain: Acid-fast bacilli seen (1+). GeneXpert MTB/RIF of synovial tissue: Mycobacterium tuberculosis detected, Rifampicin resistance NOT detected."
      }
    ],
    "diagnosis": "Tubercular arthritis of the left wrist (osteoarticular tuberculosis) with tubercular tenosynovitis of extensor tendons, confirmed by synovial biopsy showing caseating granulomas and GeneXpert positivity for Mycobacterium tuberculosis",
    "differentials": [
      "Tubercular arthritis of the wrist",
      "Rheumatoid arthritis (early, seronegative — but absence of bilateral small joint involvement and negative Anti-CCP make this less likely)",
      "Chronic non-specific tenosynovitis (compound palmar ganglion from non-TB causes)",
      "Fungal arthritis (sporotrichosis, histoplasmosis — rare, requires culture)",
      "Gout or pseudogout (monoarticular involvement possible, but uric acid normal and no chondrocalcinosis)"
    ],
    "learning_points": [
      "Phemister triad is the classical radiological triad of osteoarticular TB: periarticular osteoporosis, peripheral osseous erosions, and gradual narrowing of the joint space — unlike RA where joint space narrowing occurs early, in TB the joint space is relatively preserved until late stages due to the granulomatous (not enzymatic) nature of cartilage destruction",
      "Rice bodies on MRI (small, hypointense loose bodies in thickened synovium) are a characteristic but not pathognomonic feature of tubercular synovitis — they can also be seen in RA and pigmented villonodular synovitis (PVNS), but in the clinical context of a young Indian patient with prior TB and caseating granulomas, TB is the most likely etiology",
      "Osteoarticular TB can occur as reactivation even after completion of ATT for pulmonary TB, because osteoarticular sites are paucibacillary and may harbor dormant bacilli; treatment involves extended ATT (RNTCP Category I regimen for 12-18 months for osteoarticular TB, which is longer than the 6-month regimen for pulmonary TB) along with joint rest, splinting, and physiotherapy",
      "GeneXpert MTB/RIF on tissue samples provides rapid diagnosis (within 2 hours) with high sensitivity and simultaneously detects rifampicin resistance — it is recommended by RNTCP as the initial diagnostic test for extrapulmonary TB including osteoarticular TB; synovial biopsy remains the gold standard for histopathological confirmation",
      "Compound palmar ganglion (hourglass swelling with cross-fluctuation across the flexor/extensor retinaculum) in a young Indian patient should raise strong suspicion for tubercular tenosynovitis — this is a classic clinical sign frequently tested in NEET-PG"
    ],
    "atypical_features": "The case is challenging because: (1) the patient has a history of completed ATT for pulmonary TB, which may falsely reassure the clinician that TB is 'cured' — osteoarticular TB can present as reactivation months to years later; (2) the presentation mimics early seronegative rheumatoid arthritis with boggy synovitis, morning stiffness, and wrist involvement in a young female; (3) the wrist is an uncommon site for osteoarticular TB (spine and hip are far more common), making TB lower on the initial differential; (4) the compound palmar ganglion presentation draws attention to the tenosynovitis, potentially distracting from the underlying joint destruction that requires urgent diagnosis and prolonged ATT",
    "specialty": "orthopedics",
    "difficulty": "intermediate",
    "id": "6bc31d91"
  },
  "timestamp": "2026-02-14T19:11:56.996044"
}