{
  "case_id": "7f504cc3",
  "case_data": {
    "patient": {
      "age": 42,
      "gender": "Male",
      "location": "Lucknow, Uttar Pradesh"
    },
    "chief_complaint": "Progressive fatigue, darkening of skin, and recurrent dizziness for 3 months",
    "initial_presentation": "A 42-year-old government school teacher from Lucknow presents with worsening fatigue, generalized skin darkening, episodes of dizziness especially on standing, and a 6 kg weight loss over 3 months. He also reports intermittent nausea and vague abdominal discomfort. He was recently diagnosed with 'low BP' by a local practitioner and started on oral rehydration salts without improvement.",
    "vital_signs": {
      "bp": "88/56",
      "hr": 98,
      "rr": 16,
      "temp": 37.1,
      "spo2": 98
    },
    "stages": [
      {
        "stage": "history",
        "info": "Progressive fatigue over 3 months, initially attributed to work stress. Generalized skin darkening noticed by wife — particularly on knuckles, elbows, and gum line. Recurrent postural dizziness — nearly fainted twice while getting up from bed. Weight loss of 6 kg without dieting. Salt craving — has been adding extra salt to food. Intermittent nausea and vague periumbilical pain, no vomiting or diarrhea. Decreased appetite. No fever, night sweats, or cough. No history of tuberculosis, but a colleague at school was diagnosed with pulmonary TB 2 years ago. No history of autoimmune disease in family. No exogenous steroid use — specifically denied any injections, creams, or ayurvedic preparations containing steroids. No chronic headache or visual disturbance. He was prescribed fludrocortisone briefly abroad during a trip 6 months ago for 'low cortisol' but stopped it after returning to India as he could not find the medication locally."
      },
      {
        "stage": "physical_exam",
        "info": "Thin, asthenic build. Marked hyperpigmentation: diffuse darkening of face, dorsum of hands, knuckles, elbows, knees, and axillae. Buccal mucosa: slate-grey pigmentation on inner cheeks and gums. Palmar crease hyperpigmentation. Postural hypotension confirmed: BP supine 94/60, standing 74/48 with HR rise from 92 to 118 (positive tilt). No goiter. No vitiligo. No lymphadenopathy. Chest clear. Abdomen: Mild diffuse tenderness, no organomegaly. No signs of Cushing syndrome. Muscle power globally 4+/5, no focal deficit. No peripheral edema."
      },
      {
        "stage": "labs",
        "info": "Serum sodium: 126 mEq/L (low). Serum potassium: 5.8 mEq/L (high). Blood glucose (fasting): 62 mg/dL (low). BUN: 28, Creatinine: 1.1. CBC: Hb 10.8 (mild normocytic anemia), WBC: 4200 with relative eosinophilia (12%), lymphocyte count mildly elevated. 8 AM serum cortisol: 1.8 μg/dL (severely low; normal 6-18). ACTH (simultaneous): 485 pg/mL (markedly elevated; normal 10-60) — confirming primary adrenal insufficiency. ACTH stimulation test (250 μg Synacthen): Cortisol at 30 min = 2.1 μg/dL, at 60 min = 2.4 μg/dL (flat response — confirms adrenal failure). Serum DHEA-S: Low. Aldosterone: Low. Plasma renin activity: Elevated. Anti-21-hydroxylase antibodies: Negative. TSH: 6.8 mIU/L (mildly elevated), Free T4: 0.7 ng/dL (low-normal). CT abdomen: Bilateral adrenal glands are enlarged and show calcifications. Chest X-ray: Old fibrotic lesion in right upper zone. Mantoux test: 18 mm induration. ESR: 45 mm/hr."
      }
    ],
    "diagnosis": "Primary adrenal insufficiency (Addison's disease) due to adrenal tuberculosis",
    "differentials": [
      "Autoimmune Addison's disease (anti-21-hydroxylase antibody-mediated)",
      "Adrenal metastases causing bilateral adrenal destruction",
      "Adrenal hemorrhage (Waterhouse-Friderichsen syndrome)",
      "Secondary adrenal insufficiency (pituitary cause — but ACTH is high, ruling this out)",
      "Polyglandular autoimmune syndrome (APS type 2 — Addison + hypothyroidism + T1DM)"
    ],
    "learning_points": [
      "In India, tuberculosis remains the most common cause of primary adrenal insufficiency, unlike the West where autoimmune destruction predominates. Bilateral adrenal calcification on CT in the setting of adrenal insufficiency is highly suggestive of tubercular etiology.",
      "Classic triad of Addison's disease: hyperpigmentation (due to high ACTH/MSH), hypotension (due to aldosterone deficiency), and hypoglycemia (due to cortisol deficiency). Hyponatremia with hyperkalemia is the hallmark electrolyte pattern of primary (not secondary) adrenal insufficiency.",
      "An 8 AM cortisol <3 μg/dL with ACTH >2x upper normal is virtually diagnostic of primary adrenal insufficiency. The ACTH stimulation test (Synacthen test) confirms the diagnosis when cortisol fails to rise above 18 μg/dL at 30 or 60 minutes.",
      "Mildly elevated TSH in Addison's disease may be due to concomitant autoimmune thyroiditis (APS-2) OR may normalize after glucocorticoid replacement (cortisol deficiency itself can raise TSH). Recheck thyroid function 6-8 weeks after starting hydrocortisone before committing to levothyroxine."
    ],
    "atypical_features": "This case challenges students to differentiate tubercular from autoimmune etiology of Addison's disease — anti-21-hydroxylase antibodies are negative, and bilateral adrenal calcifications with a positive Mantoux and old pulmonary fibrotic lesion point toward tuberculosis as the cause, which is the leading etiology in India. The mildly elevated TSH creates a secondary diagnostic dilemma: is it autoimmune thyroiditis (suggesting APS-2) or merely a consequence of cortisol deficiency? Additionally, the history of brief fludrocortisone use abroad and discontinuation may confuse students into considering iatrogenic adrenal suppression, but the markedly elevated ACTH confirms a primary adrenal process.",
    "specialty": "endocrinology",
    "difficulty": "intermediate",
    "id": "7f504cc3"
  },
  "timestamp": "2026-02-14T15:51:02.981888"
}