{
  "case_id": "89053f4e",
  "case_data": {
    "patient": {
      "age": 28,
      "gender": "Male",
      "location": "Lucknow, Uttar Pradesh"
    },
    "chief_complaint": "Cough with fever and blood-streaked sputum for 3 weeks",
    "initial_presentation": "A 28-year-old male data entry operator from Lucknow presents to the OPD with a 3-week history of persistent cough with mucoid sputum that has recently become blood-streaked, low-grade evening fever, and progressive loss of appetite. He reports a weight loss of approximately 5 kg over the past 2 months and drenching night sweats requiring him to change his clothes.",
    "vital_signs": {
      "bp": "110/70",
      "hr": 96,
      "rr": 20,
      "temp": 37.9,
      "spo2": 96
    },
    "stages": [
      {
        "stage": "history",
        "info": "Cough started 3 weeks ago, initially dry, now productive with whitish-yellow mucoid sputum. Blood streaking in sputum noted for the past 5 days (approximately one teaspoon per episode). Low-grade fever, predominantly in the evenings, reaching up to 100-101°F, relieved partially by paracetamol. Drenching night sweats for 2 weeks. Loss of appetite with weight loss of ~5 kg in 2 months. Mild exertional dyspnea on climbing stairs (new onset). No chest pain, no wheezing. No history of contact with a diagnosed TB patient initially, but on detailed probing, his office colleague was diagnosed with pulmonary TB 6 months ago and was on ATT. Patient is a non-smoker, occasional social drinker. No diabetes, no HIV risk factors. No previous history of TB or ATT. No history of asthma or allergies. He lives in a shared rented room with 3 other colleagues. BCG scar present on left deltoid."
      },
      {
        "stage": "physical_exam",
        "info": "Thin-built male, appears mildly unwell. BMI 19.2 kg/m². Mild pallor present. No clubbing, no cyanosis, no lymphadenopathy (cervical, axillary, or inguinal). BCG scar present on left deltoid. Oral cavity: normal. Chest examination: Inspection - normal shape, bilateral symmetrical chest movements. Palpation - reduced vocal fremitus in the right supra- and infraclavicular regions. Percussion - impaired note in the right supraclavicular and infraclavicular areas. Auscultation - bronchial breath sounds with post-tussive coarse crepitations heard in the right upper zone (supra- and infraclavicular). Rest of the lung fields: normal vesicular breath sounds. Cardiovascular: S1S2 normal, no murmur. Abdomen: soft, non-tender, no organomegaly."
      },
      {
        "stage": "labs",
        "info": "CBC: Hb 11.2 g/dL, WBC 9,800/mm³ (lymphocyte predominant - 52%), Platelets 3.2 lakh, ESR 55 mm/hr (elevated). CRP: 28 mg/L (elevated). Random blood sugar: 102 mg/dL. Renal function and LFT: within normal limits. Sputum examination (2 samples): Sputum for AFB (ZN stain) - Sample 1: Positive (1+), Sample 2: Positive (1+). Sputum GeneXpert MTB/RIF: Mycobacterium tuberculosis DETECTED, Rifampicin resistance NOT DETECTED. HIV rapid test: Non-reactive. Chest X-ray PA view: Heterogeneous opacity involving the right upper zone with a small (1.5 cm) cavity in the right apex. No pleural effusion. Left lung field appears clear. Costophrenic angles clear bilaterally. Cardiac silhouette normal."
      }
    ],
    "diagnosis": "Drug-sensitive pulmonary tuberculosis (new case, sputum smear-positive)",
    "differentials": [
      "Pulmonary tuberculosis",
      "Community-acquired pneumonia (bacterial)",
      "Lung abscess",
      "Bronchiectasis with secondary infection",
      "Pulmonary malignancy (less likely given age)"
    ],
    "learning_points": [
      "The classic triad of pulmonary TB includes chronic cough (>2 weeks), evening rise of fever with night sweats, and weight loss/anorexia. Hemoptysis is an important red flag symptom requiring urgent sputum evaluation.",
      "GeneXpert MTB/RIF is the initial diagnostic test recommended by NTEP (National TB Elimination Programme) for presumptive TB cases — it detects MTB DNA and rifampicin resistance simultaneously within 2 hours.",
      "Right upper zone involvement with cavitation on chest X-ray is the most characteristic radiological pattern of reactivation/post-primary pulmonary TB due to high oxygen tension in the lung apices.",
      "Under NTEP, all newly diagnosed drug-sensitive pulmonary TB patients are started on a fixed-dose combination (FDC) regimen: Intensive phase — 2 months of HRZE (Isoniazid, Rifampicin, Pyrazinamide, Ethambutol), followed by Continuation phase — 4 months of HRE. All patients must be notified on the Nikshay portal and offered HIV testing."
    ],
    "atypical_features": "This is a straightforward beginner-level case with a classic presentation of pulmonary TB. The mild challenge lies in eliciting the history of TB contact (office colleague rather than a household member), which students may overlook. The case reinforces the importance of systematic history-taking including occupational and social contact history in any patient presenting with chronic cough in the Indian setting.",
    "specialty": "respiratory",
    "difficulty": "beginner",
    "id": "89053f4e"
  },
  "timestamp": "2026-02-15T09:07:24.429976"
}