{
  "case_id": "ba8c3cfa",
  "case_data": {
    "patient": {
      "age": 42,
      "gender": "Male",
      "location": "Lucknow, Uttar Pradesh"
    },
    "chief_complaint": "Recurrent kidney stones, bone pain, and fatigue for 8 months",
    "initial_presentation": "A 42-year-old government clerk from Lucknow presents with recurrent bilateral renal colic requiring two hospitalizations in the past 8 months, along with diffuse bone pain and progressive fatigue. He also reports increased thirst and frequent urination. He was referred from the urology department after his second episode of calcium-containing kidney stones.",
    "vital_signs": {
      "bp": "150/92",
      "hr": 78,
      "rr": 16,
      "temp": 36.8,
      "spo2": 98
    },
    "stages": [
      {
        "stage": "history",
        "info": "The patient describes dull aching pain in the lower back and both legs for 8 months, progressively worsening. He has had two episodes of renal colic (right side 8 months ago, left side 3 months ago) — both confirmed as calcium oxalate stones on analysis. He reports polydipsia (drinking 5-6 liters/day) and polyuria. He has developed constipation over the past 4 months, requiring regular laxatives. He reports poor appetite, nausea, and a 6 kg weight loss. He has noticed difficulty concentrating at work and his wife reports personality changes — increased irritability and low mood. He denies any steroid use, excessive calcium or vitamin D supplementation, or antacid abuse. No family history of endocrine disorders or kidney stones. He takes no regular medications other than laxatives. He was a non-smoker and occasional alcohol consumer. He had a fragility fracture of the left wrist 2 months ago after a minor fall, which was unusual and raised concern."
      },
      {
        "stage": "physical_exam",
        "info": "The patient appears thin and fatigued. BMI 21 (previously 24). Mild dehydration noted. No goiter or thyroid nodules palpable. No neck mass or lymphadenopathy. Cardiovascular examination reveals a shortened QT interval on bedside ECG. Abdominal examination shows mild diffuse tenderness, no organomegaly, no palpable mass. Musculoskeletal: Diffuse bony tenderness, especially over the shins and lumbar spine. Proximal muscle weakness — difficulty rising from a squatting position (grade 4/5 hip flexors). Left wrist in a healed cast. Band keratopathy not appreciated on gross inspection. Neuropsychiatric: Alert but slow to respond. Mildly depressed affect. No focal neurological deficits."
      },
      {
        "stage": "labs",
        "info": "Serum calcium (corrected): 13.2 mg/dL (elevated; normal 8.5-10.5). Serum phosphorus: 1.8 mg/dL (low; normal 2.5-4.5). Serum albumin: 3.8 g/dL. Intact PTH: 385 pg/mL (markedly elevated; normal 15-65). 24-hour urine calcium: 480 mg/day (elevated; normal <250). Serum alkaline phosphatase (ALP): 520 U/L (elevated; normal 44-147). Serum creatinine: 1.6 mg/dL (mildly elevated). BUN: 32 mg/dL. Serum 25-hydroxy vitamin D: 18 ng/mL (insufficient but not severely deficient). HbA1c: 5.4% (normal). ECG: Shortened QT interval. X-ray hands: Subperiosteal resorption of phalanges (radial aspect of middle phalanges) — classic finding. X-ray skull: 'Salt and pepper' skull appearance. DEXA scan: T-score lumbar spine -3.5, femoral neck -2.8 (osteoporosis). Ultrasound neck with Tc-99m Sestamibi scan: A single 2.2 cm hyperfunctioning parathyroid adenoma localized to the right inferior parathyroid gland. Ultrasound abdomen: Bilateral nephrocalcinosis with a 6 mm calculus in left lower calyx. No adrenal masses."
      }
    ],
    "diagnosis": "Primary hyperparathyroidism due to a right inferior parathyroid adenoma presenting with symptomatic hypercalcemia (renal stones, bony disease, and neuropsychiatric manifestations)",
    "differentials": [
      "Primary hyperparathyroidism (parathyroid adenoma)",
      "Malignancy-associated hypercalcemia (PTHrP-mediated or bony metastases)",
      "Familial hypocalciuric hypercalcemia (FHH)",
      "Vitamin D intoxication or granulomatous disease (sarcoidosis/tuberculosis)",
      "Multiple myeloma with hypercalcemia"
    ],
    "learning_points": [
      "The classic mnemonic for hypercalcemia symptoms is 'Stones (renal calculi), Bones (osteitis fibrosa cystica, fractures), Groans (abdominal pain, constipation, nausea), and Psychiatric Moans (depression, confusion, fatigue)' — this patient has ALL components.",
      "In primary hyperparathyroidism: Calcium is HIGH, phosphorus is LOW, and PTH is inappropriately HIGH. This triad is diagnostic. In malignancy-related hypercalcemia, PTH is suppressed (<20 pg/mL).",
      "Subperiosteal bone resorption (especially radial aspect of middle phalanges) is the most specific radiological sign of hyperparathyroidism. 'Salt and pepper skull' and brown tumors are other classic findings of osteitis fibrosa cystica.",
      "Localization before surgery requires dual imaging — Tc-99m Sestamibi scan (functional) + neck ultrasound (anatomical). Minimally invasive parathyroidectomy is the definitive treatment. Intraoperative PTH monitoring (>50% drop in 10 minutes) confirms successful adenoma removal."
    ],
    "atypical_features": "Indian patients with primary hyperparathyroidism tend to present with more advanced skeletal disease (osteitis fibrosa cystica) compared to Western populations where the disease is often detected incidentally on routine calcium screening. This case is challenging because the presenting complaint is recurrent nephrolithiasis referred from urology, requiring the student to connect kidney stones with bone pain, psychiatric symptoms, and constipation into a unifying diagnosis. The concomitant vitamin D insufficiency (common in India) can partially mask the degree of hypercalcemia and must be corrected cautiously after parathyroidectomy to avoid hungry bone syndrome. Additionally, the mildly elevated creatinine suggests early chronic kidney disease from nephrocalcinosis — a complication that may not fully reverse.",
    "specialty": "endocrinology",
    "difficulty": "intermediate",
    "id": "ba8c3cfa"
  },
  "timestamp": "2026-02-14T15:51:38.008566"
}