{
  "case_id": "bfd06758",
  "case_data": {
    "patient": {
      "age": 28,
      "gender": "Male",
      "location": "Jaipur, Rajasthan"
    },
    "chief_complaint": "Persistent right hip and thigh pain for 3 months with progressive difficulty walking",
    "initial_presentation": "A 28-year-old male auto-rickshaw driver from Jaipur presents with a 3-month history of progressive right hip pain radiating to the anterior thigh and knee. He reports increasing difficulty getting in and out of his auto-rickshaw and has developed a noticeable limp over the past month. He denies any history of trauma but mentions recurrent episodes of sickle cell crises requiring hospitalization in the past.",
    "vital_signs": {
      "bp": "118/74",
      "hr": 82,
      "rr": 16,
      "temp": 37.1,
      "spo2": 98
    },
    "stages": [
      {
        "stage": "history",
        "info": "The patient has been experiencing insidious onset right groin pain for 3 months, dull and aching in nature, radiating to the anterior thigh and occasionally to the right knee. Pain is worse with prolonged sitting (especially during auto-rickshaw driving), weight-bearing, and climbing stairs. He gets partial relief with rest and over-the-counter diclofenac. He reports morning stiffness in the hip lasting about 10 minutes. He has difficulty squatting for Indian-style toilet use and cannot sit cross-legged. He was diagnosed with sickle cell trait (HbAS) at age 12 during a family screening program but was told it was 'nothing serious.' However, he has had 3 episodes of severe bone pain requiring hospitalization in the past 5 years, the last one being 6 months ago involving bilateral leg pain during a dehydration episode in the summer. During his last crisis, he was treated with IV fluids, analgesics, and oxygen at a district hospital for 4 days. He denies any history of corticosteroid use, alcohol consumption, smoking, or trauma. No history of SLE, nephrotic syndrome, or organ transplant. He has no family history of hip problems but his younger brother has sickle cell disease (HbSS). He works 10-12 hours daily driving his auto-rickshaw, which is the sole source of income for his family."
      },
      {
        "stage": "physical_exam",
        "info": "The patient walks with an antalgic gait, shortened stance phase on the right side, with a mild Trendelenburg lurch. Trendelenburg test is positive on the right. Examination of the right hip: flexion 95 degrees (restricted, normal 120), internal rotation markedly reduced to 10 degrees (normal 40) with pain at end range — this is the earliest and most sensitive finding, external rotation 25 degrees (reduced), abduction 30 degrees (mildly reduced), adduction normal. FIRA (flexion-internal rotation-adduction) test is positive — reproduces deep groin pain. Thomas test reveals a 5-degree fixed flexion deformity on the right. Log roll test is positive with pain on gentle internal and external rotation. Left hip: range of motion is full but internal rotation is slightly reduced to 30 degrees with mild discomfort at the end range — suspicious for early contralateral involvement. True limb lengths are equal bilaterally. No distal neurovascular deficit. Knee and spine examination are unremarkable. No hepatosplenomegaly on abdominal examination. Mild pallor present. No jaundice. No lymphadenopathy."
      },
      {
        "stage": "labs",
        "info": "X-ray pelvis AP with both hips: Right femoral head shows patchy sclerosis with a subtle crescent sign (subchondral lucency) at the superolateral weight-bearing area, femoral head sphericity is maintained but there is early subtle flattening. Left femoral head shows mild patchy sclerosis without collapse or crescent sign. Joint spaces are maintained bilaterally. No acetabular changes. Ficat and Arlet classification: Right hip — Stage III (crescent sign present), Left hip — Stage II (sclerosis, no collapse). MRI both hips (T1, T2, STIR, coronal and sagittal): Right femoral head — serpiginous low-signal band on T1 (reactive interface) surrounding a necrotic segment involving approximately 40% of the weight-bearing surface. T2 shows 'double line sign' — pathognomonic of AVN. Subchondral fracture present (crescent sign), early loss of head sphericity. Mild joint effusion. Modified Kerboul combined necrotic angle: 190 degrees. Left femoral head — small area of serpiginous band on T1 involving approximately 15% of the weight-bearing surface, no subchondral fracture, spherical head maintained. Kerboul angle: 110 degrees. Blood investigations: Hb 10.2 g/dL, MCV 82 fL, TLC 9,800/mm³, Platelets 2.4 lakh. Peripheral smear: occasional sickle-shaped cells and target cells. Hb electrophoresis: HbA 58%, HbS 38%, HbF 2%, HbA2 2% — consistent with sickle cell trait (HbAS). Reticulocyte count: 3.2% (mildly elevated). ESR: 32 mm/hr. CRP: 8 mg/L. LDH: 320 U/L (mildly elevated). Serum creatinine: 0.8 mg/dL. Lipid profile: normal. HIV: Negative. Liver function tests: Normal. Serum ferritin: 180 ng/mL."
      }
    ],
    "diagnosis": "Bilateral avascular necrosis (osteonecrosis) of the femoral heads secondary to sickle cell hemoglobinopathy (sickle cell trait with vaso-occlusive episodes). Right hip: Ficat Stage III (subchondral collapse). Left hip: Ficat Stage II (pre-collapse)",
    "differentials": [
      "Avascular necrosis of the femoral head (sickle cell hemoglobinopathy-related)",
      "Osteoarthritis of the hip (primary — unlikely at age 28 without predisposing factors)",
      "Transient osteoporosis of the hip (self-limiting, diffuse marrow edema on MRI, no necrotic band)",
      "Inflammatory arthritis (ankylosing spondylitis — sacroiliac involvement, HLA-B27 positive, younger male)",
      "Septic arthritis or osteomyelitis of the proximal femur (fever, elevated inflammatory markers, joint aspiration)"
    ],
    "learning_points": [
      "AVN is classically associated with corticosteroid use and alcohol, but sickle cell hemoglobinopathies (including sickle cell trait under physiological stress) are an important cause in the Indian tribal belt of Rajasthan, Madhya Pradesh, Chhattisgarh, and Maharashtra. Vaso-occlusive crises cause microvascular thrombosis in the femoral head's tenuous blood supply, leading to ischemia and bone necrosis.",
      "Sickle cell trait (HbAS) is generally considered benign, but under conditions of severe dehydration, hypoxia, acidosis, or extreme physical exertion, it can cause vaso-occlusive episodes and AVN — this is a frequently tested and commonly missed association. AVN in sickle cell trait patients should prompt evaluation of the contralateral hip as bilateral involvement occurs in 40-80% of cases.",
      "The Ficat and Arlet classification guides management: Stage I/II (pre-collapse) — head-preserving procedures like core decompression with or without bone grafting or vascularized fibular graft; Stage III (subchondral collapse with maintained joint space) — core decompression may still be attempted for small lesions (Kerboul angle <200°), but total hip arthroplasty (THA) is often required for large lesions; Stage IV — THA is the definitive treatment.",
      "MRI is the gold standard for early diagnosis of AVN (sensitivity >95%). The 'double line sign' on T2-weighted images (inner bright line of granulation tissue and outer dark line of sclerotic bone) is pathognomonic. The modified Kerboul combined necrotic angle (sum of necrotic angles on mid-coronal and mid-sagittal MRI) is a key prognostic tool: <200° suggests a better outcome with head-preserving surgery, while >200° has a high likelihood of progression to collapse."
    ],
    "atypical_features": "This case is challenging because AVN is occurring in a young man with sickle cell trait (HbAS), which is often dismissed as a benign carrier state. Students may focus on more common causes of AVN (steroids, alcohol) and miss the hemoglobinopathy association. The referred pain to the knee may initially mislead toward a knee pathology. Additionally, the bilateral but asymmetric involvement requiring different treatment strategies for each hip (head-preserving vs. arthroplasty) adds clinical complexity. The early contralateral hip involvement detected only on MRI emphasizes the importance of screening the opposite hip in all AVN cases.",
    "specialty": "orthopedics",
    "difficulty": "intermediate",
    "id": "bfd06758"
  },
  "timestamp": "2026-02-14T17:01:18.426524"
}