{
  "case_id": "c47a58fd",
  "case_data": {
    "patient": {
      "age": 28,
      "gender": "Female",
      "location": "Jaipur, Rajasthan"
    },
    "chief_complaint": "Persistent pain and swelling in the left wrist for 3 months with progressive difficulty gripping objects",
    "initial_presentation": "A 28-year-old female schoolteacher from Jaipur presents with a 3-month history of progressive left wrist pain and swelling. She reports difficulty holding chalk, writing on the blackboard, and wringing clothes. She denies any history of trauma but mentions that her wrist occasionally 'clicks' painfully during rotation movements.",
    "vital_signs": {
      "bp": "118/74",
      "hr": 78,
      "rr": 16,
      "temp": 37.0,
      "spo2": 99
    },
    "stages": [
      {
        "stage": "history",
        "info": "The patient reports insidious onset of dorsal left wrist pain 3 months ago, initially mild and intermittent, now constant and aggravated by gripping, twisting (wringing clothes, opening jars), and weight-bearing on the wrist (getting up from the floor). She notices a visible bump on the back of the wrist that has been slowly increasing. She reports painful clicking during pronation-supination. No history of any trauma, fall on outstretched hand, or repetitive heavy lifting. No fever, night sweats, or weight loss. No history of inflammatory arthritis, psoriasis, or autoimmune disease. No family history of rheumatoid arthritis or tuberculosis. She has been taking ibuprofen from a local chemist with partial relief. She consulted an Ayurvedic practitioner who applied medicated paste and performed fomentation for 6 weeks without improvement. She is right-hand dominant but uses the left hand significantly for blackboard writing. She has no history of oral contraceptive use or pregnancy. Menstrual cycles are regular. No history of gout, pseudogout, or metabolic disorders."
      },
      {
        "stage": "physical_exam",
        "info": "Left wrist: Visible dorsal swelling over the scapholunate region, firm to palpation, mildly tender, non-transilluminant (unlike a ganglion cyst). Diffuse tenderness over the dorsal wrist centered on the scapholunate interval. Range of motion: Flexion 40 degrees (normal 80), extension 50 degrees (normal 70), radial deviation 10 degrees (normal 20), ulnar deviation 20 degrees (normal 30). Grip strength reduced to approximately 60% of the contralateral side measured by asking the patient to squeeze the examiner's fingers. Watson's scaphoid shift test: Positive — applying pressure over the scaphoid tubercle while moving the wrist from ulnar to radial deviation produces a painful clunk as the scaphoid subluxes dorsally, with pain relief on releasing pressure. Finkelstein test: Negative (ruling out de Quervain tenosynovitis). Phalen test and Tinel sign at carpal tunnel: Negative. No warmth or erythema. No distal neurovascular deficit. Piano key sign for DRUJ instability: Negative. Contralateral right wrist: Normal examination. No swelling or tenderness over any other joints. No skin rashes, nail changes, or nodules."
      },
      {
        "stage": "labs",
        "info": "X-ray left wrist PA and lateral: PA view shows widened scapholunate interval measuring 4.5 mm (normal <3 mm) — the 'Terry Thomas sign' (named after the gap-toothed British actor) is positive. Scaphoid appears foreshortened with a cortical ring sign (scaphoid is flexed and viewed end-on, suggesting rotatory subluxation). Lateral view shows scapholunate angle of 78 degrees (normal 30-60 degrees, >70 suggests scapholunate dissociation). No fracture, no degenerative changes, no DISI or VISI pattern yet. Grip compression view (clenched fist AP): Scapholunate gap widens further to 6 mm compared to 2 mm on the contralateral side, confirming dynamic instability. MRI left wrist (1.5T with dedicated wrist coil): Complete tear of the scapholunate interosseous ligament (SLIL) — dorsal and membranous components disrupted, with fluid signal tracking through the scapholunate interval. Mild surrounding synovitis. No avascular necrosis of the scaphoid (Preiser disease ruled out). No triangular fibrocartilage complex (TFCC) tear. Articular cartilage of the radiocarpal joint is intact. No bone marrow edema suggesting occult fracture. Blood investigations: CBC normal (Hb 12.8 g/dL, TLC 7,200/mm3). ESR 12 mm/hr, CRP 3 mg/L (both normal — against inflammatory arthritis). RA factor: Negative. Anti-CCP antibodies: Negative. Serum uric acid: 4.8 mg/dL (normal)."
      }
    ],
    "diagnosis": "Scapholunate ligament dissociation (complete tear) of the left wrist with dynamic carpal instability (Garcia-Elias Stage 3-4), presenting as chronic wrist pain without antecedent trauma",
    "differentials": [
      "Scapholunate ligament dissociation (carpal instability)",
      "Dorsal wrist ganglion cyst",
      "Scaphoid fracture or non-union (missed occult fracture)",
      "De Quervain tenosynovitis",
      "Kienböck disease (avascular necrosis of the lunate)"
    ],
    "learning_points": [
      "The scapholunate interosseous ligament (SLIL) is the most commonly injured intrinsic carpal ligament; while most cases follow a fall on outstretched hand (FOOSH), some present insidiously without clear trauma history, making diagnosis challenging. The dorsal component of the SLIL is the strongest and most important biomechanically.",
      "Watson's scaphoid shift test is the key clinical examination for scapholunate instability: pressure on the scaphoid tubercle during ulnar-to-radial deviation prevents the scaphoid from flexing, causing it to sublux dorsally with a painful clunk. Always compare with the contralateral side as some patients have physiological laxity.",
      "The 'Terry Thomas sign' (scapholunate gap >3 mm on PA X-ray) and scaphoid cortical ring sign (foreshortened flexed scaphoid seen end-on) are classic radiographic findings of scapholunate dissociation — a clenched fist (grip compression) view can unmask dynamic instability not visible on standard views. The scapholunate angle >70 degrees on lateral view confirms the dissociation.",
      "Untreated scapholunate dissociation leads to a predictable pattern of degenerative arthritis called SLAC (Scapholunate Advanced Collapse) wrist, which is the most common pattern of degenerative arthritis of the wrist. Treatment depends on the stage: acute complete tears may be repaired directly with dorsal capsulodesis; chronic cases with no arthritis require ligament reconstruction (e.g., Brunelli technique or RASL procedure); established SLAC wrist requires salvage procedures such as proximal row carpectomy or four-corner fusion."
    ],
    "atypical_features": "This case is challenging because the patient has no clear history of trauma, which is the typical mechanism for scapholunate ligament injury. The insidious onset mimics inflammatory or degenerative conditions and may lead clinicians toward diagnoses like ganglion cyst, Kienböck disease, or early inflammatory arthritis. The dorsal swelling could easily be mistaken for a ganglion cyst on initial assessment. Additionally, carpal instability is an under-recognized entity in general orthopedic practice in India, and many cases are misdiagnosed as 'wrist sprain' for months. The positive Watson test is the clinical key, but it requires familiarity with the technique. The case also highlights the importance of stress radiographic views (clenched fist view) to unmask dynamic instability not visible on routine X-rays.",
    "specialty": "orthopedics",
    "difficulty": "intermediate",
    "id": "c47a58fd"
  },
  "timestamp": "2026-02-14T16:44:57.115072"
}