{
  "case_id": "ee2c5487",
  "case_data": {
    "patient": {
      "age": 42,
      "gender": "Male",
      "location": "Lucknow, Uttar Pradesh"
    },
    "chief_complaint": "Recurrent kidney stones, bone pain, and generalized weakness for 8 months",
    "initial_presentation": "A 42-year-old government clerk presents with recurrent bilateral kidney stones (3 episodes in 8 months), progressive bone pain in the lower back and legs, and generalized weakness. He also reports excessive thirst, frequent urination, and constipation. He was referred after an incidentally discovered serum calcium of 13.2 mg/dL during his last renal colic workup.",
    "vital_signs": {
      "bp": "150/92",
      "hr": 78,
      "rr": 16,
      "temp": 37.0,
      "spo2": 98
    },
    "stages": [
      {
        "stage": "history",
        "info": "The patient reports 3 episodes of renal colic in 8 months — bilateral, calcium-based stones on analysis. He has had progressive diffuse bone pain, especially in the lumbar spine, hips, and shins for 6 months. He notes proximal muscle weakness (difficulty rising from squatting position — important in Indian context). He has polyuria (4-5 L/day), polydipsia, constipation, poor appetite, and 6 kg weight loss. He reports depressed mood, difficulty concentrating at work, and disturbed sleep for 4 months. He was treated for a peptic ulcer 3 months ago (epigastric pain, antacid-responsive). No family history of kidney stones or endocrine disorders. No history of thiazide use, vitamin D/calcium supplementation, lithium use, or prolonged immobilization. He consumes a mixed diet. He has smoked 5-6 bidis/day for 15 years."
      },
      {
        "stage": "physical_exam",
        "info": "Mild dehydration (dry tongue, reduced skin turgor). BMI 21 (previously 24 — weight loss). No palpable neck mass or thyroid nodule (note: parathyroid adenomas are rarely palpable). Tenderness over lumbar spine and bilateral tibiae on palpation. Proximal muscle weakness — grade 4/5 in hip flexors and shoulder abductors. Mild bilateral renal angle tenderness. No band keratopathy on slit lamp (requested). No signs suggestive of MEN1 (no skin lesions, no visual field defects, no features of Cushing or acromegaly). No abdominal mass. Mild epigastric tenderness. Deep tendon reflexes — normal. No neuromuscular irritability."
      },
      {
        "stage": "labs",
        "info": "Serum calcium: 13.2 mg/dL (elevated; normal 8.5–10.5). Albumin: 4.0 g/dL (corrected calcium = 13.2). Serum phosphorus: 1.8 mg/dL (low; normal 2.5–4.5). Intact PTH: 385 pg/mL (markedly elevated; normal 10–65) — INAPPROPRIATELY elevated for hypercalcemia. Alkaline phosphatase: 480 U/L (elevated; normal 40–129). 24-hour urine calcium: 520 mg (elevated; >250 in males suggests hypercalciuria, rules out FHH). Calcium-creatinine clearance ratio: 0.035 (>0.02 supports primary hyperparathyroidism over FHH). 25-OH Vitamin D: 12 ng/mL (deficient — coexistent, common in India). Serum creatinine: 1.6 mg/dL (mildly elevated — chronic hypercalcemia effect). BUN: 32. Serum chloride: 112 (elevated — PTH increases chloride reabsorption; Cl/PO4 ratio >33 suggestive of PHPT). Serum magnesium: 1.7 (low normal). X-ray hands: Subperiosteal bone resorption at radial aspect of middle phalanges (pathognomonic). X-ray skull: Salt and pepper skull appearance. X-ray spine: Diffuse osteopenia. DEXA scan: Osteoporosis at distal 1/3 radius (T-score -3.6) — cortical bone preferentially affected. USG neck (Tc-99m Sestamibi scan): Single right inferior parathyroid adenoma (3.2 cm), concordant on USG and sestamibi. USG KUB: Bilateral nephrolithiasis, left hydroureteronephrosis. ECG: Shortened QT interval."
      }
    ],
    "diagnosis": "Primary hyperparathyroidism due to single right inferior parathyroid adenoma with osteitis fibrosa cystica and nephrolithiasis",
    "differentials": [
      "Primary hyperparathyroidism (parathyroid adenoma)",
      "Familial hypocalciuric hypercalcemia (FHH)",
      "Hypercalcemia of malignancy (PTHrP-mediated or osteolytic)",
      "Multiple myeloma with hypercalcemia",
      "Vitamin D intoxication / Granulomatous disease (sarcoidosis / tuberculosis)"
    ],
    "learning_points": [
      "In primary hyperparathyroidism, PTH is INAPPROPRIATELY elevated in the setting of hypercalcemia — this is the hallmark finding. In all other causes of hypercalcemia (except FHH and lithium), PTH is suppressed.",
      "Calcium-creatinine clearance ratio >0.02 distinguishes primary hyperparathyroidism from familial hypocalciuric hypercalcemia (FHH), which is a benign condition NOT requiring surgery.",
      "Classical bone disease in PHPT — 'osteitis fibrosa cystica' with subperiosteal resorption (pathognomonic), salt-and-pepper skull, brown tumors, and preferential cortical bone loss (distal 1/3 radius on DEXA) — is still commonly seen in India due to late presentation, unlike in the West where most cases are detected incidentally.",
      "Indications for parathyroidectomy include: serum calcium >1 mg/dL above normal, age <50, T-score ≤ -2.5 at any site, eGFR <60, nephrolithiasis/nephrocalcinosis, or 24-hr urine calcium >400 mg. This patient meets multiple criteria."
    ],
    "atypical_features": "This case is challenging because the patient presents with the full-blown symptomatic phenotype of primary hyperparathyroidism ('stones, bones, abdominal groans, and psychic moans') which is now rarely seen in Western settings but remains common in India due to delayed diagnosis. The coexistent severe vitamin D deficiency (common in Indian PHPT patients) can mask the degree of hypercalcemia and cause even higher PTH levels — students must recognize this interplay. Additionally, the mild renal impairment and elevated BP add complexity to perioperative management. The peptic ulcer history may mislead students toward a GI-focused workup rather than recognizing it as part of the hypercalcemia symptom complex.",
    "specialty": "endocrinology",
    "difficulty": "intermediate",
    "id": "ee2c5487"
  },
  "timestamp": "2026-02-14T16:40:49.071897"
}